ErichStyger/mcuoneclipse/Examples/KDS/TWR-KV58F220M/TWR_KV58F220M_PEx_2_SDKv2/SDK/platform/devices/MKV58F24/include/MKV58F24_extension.h
/*! @brief Set the DACBFRP field to a new value. */
#define DAC_WR_C2_DACBFRP(base, value) (DAC_RMW_C2(base, DAC_C2_DACBFRP_MASK, DAC_C2_DACBFRP(value)))
#define DAC_BWR_C2_DACBFRP(base, value) (BME_BFI8(&DAC_C2_REG(base), ((uint8_t)(value) << DAC_C2_DACBFRP_SHIFT), DAC_C2_DACBFRP_SHIFT, DAC_C2_DACBFRP_WIDTH))
/*@}*/

/*
 * MKV58F24 DMA
 *
 * Enhanced direct memory access controller
 *
 * Registers defined in this header file:
 * - DMA_CR - Control Register
 * - DMA_ES - Error Status Register
 * - DMA_ERQ - Enable Request Register
 * - DMA_EEI - Enable Error Interrupt Register
 * - DMA_CEEI - Clear Enable Error Interrupt Register
 * - DMA_SEEI - Set Enable Error Interrupt Register
 * - DMA_CERQ - Clear Enable Request Register
 * - DMA_SERQ - Set Enable Request Register
 * - DMA_CDNE - Clear DONE Status Bit Register
 * - DMA_SSRT - Set START Bit Register
 * - DMA_CERR - Clear Error Register
 * - DMA_CINT - Clear Interrupt Request Register
 * - DMA_INT - Interrupt Request Register
 * - DMA_ERR - Error Register
 * - DMA_HRS - Hardware Request Status Register
 * - DMA_EARS - Enable Asynchronous Request in Stop Register
 * - DMA_DCHPRI3 - Channel n Priority Register
 * - DMA_DCHPRI2 - Channel n Priority Register
 * - DMA_DCHPRI1 - Channel n Priority Register
 * - DMA_DCHPRI0 - Channel n Priority Register
 * - DMA_DCHPRI7 - Channel n Priority Register
 * - DMA_DCHPRI6 - Channel n Priority Register
 * - DMA_DCHPRI5 - Channel n Priority Register
 * - DMA_DCHPRI4 - Channel n Priority Register
 * - DMA_DCHPRI11 - Channel n Priority Register
 * - DMA_DCHPRI10 - Channel n Priority Register
 * - DMA_DCHPRI9 - Channel n Priority Register
 * - DMA_DCHPRI8 - Channel n Priority Register
 * - DMA_DCHPRI15 - Channel n Priority Register
 * - DMA_DCHPRI14 - Channel n Priority Register
 * - DMA_DCHPRI13 - Channel n Priority Register
 * - DMA_DCHPRI12 - Channel n Priority Register
 * - DMA_DCHPRI19 - Channel n Priority Register
 * - DMA_DCHPRI18 - Channel n Priority Register
 * - DMA_DCHPRI17 - Channel n Priority Register
 * - DMA_DCHPRI16 - Channel n Priority Register
 * - DMA_DCHPRI23 - Channel n Priority Register
 * - DMA_DCHPRI22 - Channel n Priority Register
 * - DMA_DCHPRI21 - Channel n Priority Register
 * - DMA_DCHPRI20 - Channel n Priority Register
 * - DMA_DCHPRI27 - Channel n Priority Register
 * - DMA_DCHPRI26 - Channel n Priority Register
 * - DMA_DCHPRI25 - Channel n Priority Register
 * - DMA_DCHPRI24 - Channel n Priority Register
 * - DMA_DCHPRI31 - Channel n Priority Register
 * - DMA_DCHPRI30 - Channel n Priority Register
 * - DMA_DCHPRI29 - Channel n Priority Register
 * - DMA_DCHPRI28 - Channel n Priority Register
 * - DMA_SADDR - TCD Source Address
 * - DMA_SOFF - TCD Signed Source Address Offset
 * - DMA_ATTR - TCD Transfer Attributes
 * - DMA_NBYTES_MLNO - TCD Minor Byte Count (Minor Loop Mapping Disabled)
 * - DMA_NBYTES_MLOFFNO - TCD Signed Minor Loop Offset (Minor Loop Mapping Enabled and Offset Disabled)
 * - DMA_NBYTES_MLOFFYES - TCD Signed Minor Loop Offset (Minor Loop Mapping and Offset Enabled)
 * - DMA_SLAST - TCD Last Source Address Adjustment
 * - DMA_DADDR - TCD Destination Address
 * - DMA_DOFF - TCD Signed Destination Address Offset
 * - DMA_CITER_ELINKNO - TCD Current Minor Loop Link, Major Loop Count (Channel Linking Disabled)
 * - DMA_CITER_ELINKYES - TCD Current Minor Loop Link, Major Loop Count (Channel Linking Enabled)
 * - DMA_DLAST_SGA - TCD Last Destination Address Adjustment/Scatter Gather Address
 * - DMA_CSR - TCD Control and Status
 * - DMA_BITER_ELINKNO - TCD Beginning Minor Loop Link, Major Loop Count (Channel Linking Disabled)
 * - DMA_BITER_ELINKYES - TCD Beginning Minor Loop Link, Major Loop Count (Channel Linking Enabled)
 */

#define DMA_INSTANCE_COUNT (1U) /*!< Number of instances of the DMA module. */
#define DMA_IDX (0U) /*!< Instance number for DMA. */

/*******************************************************************************
 * DMA_CR - Control Register
 ******************************************************************************/

/*!
 * @brief DMA_CR - Control Register (RW)
 *
 * Reset value: 0x00000400U
 *
 * The CR defines the basic operating configuration of the DMA. The DMA
 * arbitrates channel service requests in two groups of 16 channels each: Group 1
 * contains channels 31-16 Group 0 contains channels 15-0 Arbitration within a group can
 * be configured to use either a fixed-priority or a round-robin scheme. For
 * fixed-priority arbitration, the highest priority channel requesting service is
 * selected to execute. The channel priority registers assign the priorities; see
 * the DCHPRIn registers. For round-robin arbitration, the channel priorities are
 * ignored and channels within each group are cycled through (from high to low
 * channel number) without regard to priority. For correct operation, writes to the
 * CR register must be performed only when the DMA channels are inactive; that
 * is, when TCDn_CSR[ACTIVE] bits are cleared. The group priorities operate in a
 * similar fashion. In group fixed priority arbitration mode, channel service
 * requests in the highest priority group are executed first, where priority level 1
 * is the highest and priority level 0 is the lowest. The group priorities are
 * assigned in the GRPnPRI fields of the DMA Control Register (CR). All group
 * priorities must have unique values prior to any channel service requests occurring;
 * otherwise, a configuration error will be reported. For group round robin
 * arbitration, the group priorities are ignored and the groups are cycled through
 * (from high to low group number) without regard to priority. Minor loop offsets
 * are address offset values added to the final source address (TCDn_SADDR) or
 * destination address (TCDn_DADDR) upon minor loop completion. When minor loop
 * offsets are enabled, the minor loop offset (MLOFF) is added to the final source
 * address (TCDn_SADDR), to the final destination address (TCDn_DADDR), or to both
 * prior to the addresses being written back into the TCD. If the major loop is
 * complete, the minor loop offset is ignored and the major loop address offsets
 * (TCDn_SLAST and TCDn_DLAST_SGA) are used to compute the next TCDn_SADDR and
 * TCDn_DADDR values. When minor loop mapping is enabled (EMLM is 1), TCDn word2 is
 * redefined. A portion of TCDn word2 is used to specify multiple fields: a
 * source enable bit (SMLOE) to specify the minor loop offset should be applied to the
 * source address (TCDn_SADDR) upon minor loop completion, a destination enable
 * bit (DMLOE) to specify the minor loop offset should be applied to the
 * destination address (TCDn_DADDR) upon minor loop completion, and the sign extended
 * minor loop offset value (MLOFF). The same offset value (MLOFF) is used for both
 * source and destination minor loop offsets. When either minor loop offset is
 * enabled (SMLOE set or DMLOE set), the NBYTES field is reduced to 10 bits. When
 * both minor loop offsets are disabled (SMLOE cleared and DMLOE cleared), the
 * NBYTES field is a 30-bit vector. When minor loop mapping is disabled (EMLM is 0),
 * all 32 bits of TCDn word2 are assigned to the NBYTES field.
 */
/*!
 * @name Constants and macros for entire DMA_CR register
 */
/*@{*/
#define DMA_RD_CR(base)          (DMA_CR_REG(base))
#define DMA_WR_CR(base, value)   (DMA_CR_REG(base) = (value))
#define DMA_RMW_CR(base, mask, value) (DMA_WR_CR(base, (DMA_RD_CR(base) & ~(mask)) | (value)))
#define DMA_SET_CR(base, value)  (BME_OR32(&DMA_CR_REG(base), (uint32_t)(value)))
#define DMA_CLR_CR(base, value)  (BME_AND32(&DMA_CR_REG(base), (uint32_t)(~(value))))
#define DMA_TOG_CR(base, value)  (BME_XOR32(&DMA_CR_REG(base), (uint32_t)(value)))
/*@}*/

