ErichStyger/mcuoneclipse/Examples/KDS/TWR-KV58F220M/TWR_KV58F220M_PEx_2_SDKv2/SDK/platform/devices/MKV58F24/include/MKV58F24_extension.h
/*! @brief Set the ERQ25 field to a new value. */
#define DMA_WR_ERQ_ERQ25(base, value) (DMA_RMW_ERQ(base, DMA_ERQ_ERQ25_MASK, DMA_ERQ_ERQ25(value)))
#define DMA_BWR_ERQ_ERQ25(base, value) (BME_BFI32(&DMA_ERQ_REG(base), ((uint32_t)(value) << DMA_ERQ_ERQ25_SHIFT), DMA_ERQ_ERQ25_SHIFT, DMA_ERQ_ERQ25_WIDTH))
/*@}*/

/*!
 * @name Register DMA_ERQ, field ERQ26[26] (RW)
 *
 * Values:
 * - 0b0 - The DMA request signal for the corresponding channel is disabled
 * - 0b1 - The DMA request signal for the corresponding channel is enabled
 */
/*@{*/
/*! @brief Read current value of the DMA_ERQ_ERQ26 field. */
#define DMA_RD_ERQ_ERQ26(base) ((DMA_ERQ_REG(base) & DMA_ERQ_ERQ26_MASK) >> DMA_ERQ_ERQ26_SHIFT)
#define DMA_BRD_ERQ_ERQ26(base) (BME_UBFX32(&DMA_ERQ_REG(base), DMA_ERQ_ERQ26_SHIFT, DMA_ERQ_ERQ26_WIDTH))

/*! @brief Set the ERQ26 field to a new value. */
#define DMA_WR_ERQ_ERQ26(base, value) (DMA_RMW_ERQ(base, DMA_ERQ_ERQ26_MASK, DMA_ERQ_ERQ26(value)))
#define DMA_BWR_ERQ_ERQ26(base, value) (BME_BFI32(&DMA_ERQ_REG(base), ((uint32_t)(value) << DMA_ERQ_ERQ26_SHIFT), DMA_ERQ_ERQ26_SHIFT, DMA_ERQ_ERQ26_WIDTH))
/*@}*/

/*!
 * @name Register DMA_ERQ, field ERQ27[27] (RW)
 *
 * Values:
 * - 0b0 - The DMA request signal for the corresponding channel is disabled
 * - 0b1 - The DMA request signal for the corresponding channel is enabled
 */
/*@{*/
/*! @brief Read current value of the DMA_ERQ_ERQ27 field. */
#define DMA_RD_ERQ_ERQ27(base) ((DMA_ERQ_REG(base) & DMA_ERQ_ERQ27_MASK) >> DMA_ERQ_ERQ27_SHIFT)
#define DMA_BRD_ERQ_ERQ27(base) (BME_UBFX32(&DMA_ERQ_REG(base), DMA_ERQ_ERQ27_SHIFT, DMA_ERQ_ERQ27_WIDTH))

/*! @brief Set the ERQ27 field to a new value. */
#define DMA_WR_ERQ_ERQ27(base, value) (DMA_RMW_ERQ(base, DMA_ERQ_ERQ27_MASK, DMA_ERQ_ERQ27(value)))
#define DMA_BWR_ERQ_ERQ27(base, value) (BME_BFI32(&DMA_ERQ_REG(base), ((uint32_t)(value) << DMA_ERQ_ERQ27_SHIFT), DMA_ERQ_ERQ27_SHIFT, DMA_ERQ_ERQ27_WIDTH))
/*@}*/

/*!
 * @name Register DMA_ERQ, field ERQ28[28] (RW)
 *
 * Values:
 * - 0b0 - The DMA request signal for the corresponding channel is disabled
 * - 0b1 - The DMA request signal for the corresponding channel is enabled
 */
/*@{*/
/*! @brief Read current value of the DMA_ERQ_ERQ28 field. */
#define DMA_RD_ERQ_ERQ28(base) ((DMA_ERQ_REG(base) & DMA_ERQ_ERQ28_MASK) >> DMA_ERQ_ERQ28_SHIFT)
#define DMA_BRD_ERQ_ERQ28(base) (BME_UBFX32(&DMA_ERQ_REG(base), DMA_ERQ_ERQ28_SHIFT, DMA_ERQ_ERQ28_WIDTH))

/*! @brief Set the ERQ28 field to a new value. */
#define DMA_WR_ERQ_ERQ28(base, value) (DMA_RMW_ERQ(base, DMA_ERQ_ERQ28_MASK, DMA_ERQ_ERQ28(value)))
#define DMA_BWR_ERQ_ERQ28(base, value) (BME_BFI32(&DMA_ERQ_REG(base), ((uint32_t)(value) << DMA_ERQ_ERQ28_SHIFT), DMA_ERQ_ERQ28_SHIFT, DMA_ERQ_ERQ28_WIDTH))
/*@}*/

/*!
 * @name Register DMA_ERQ, field ERQ29[29] (RW)
 *
 * Values:
 * - 0b0 - The DMA request signal for the corresponding channel is disabled
 * - 0b1 - The DMA request signal for the corresponding channel is enabled
 */
/*@{*/
/*! @brief Read current value of the DMA_ERQ_ERQ29 field. */
#define DMA_RD_ERQ_ERQ29(base) ((DMA_ERQ_REG(base) & DMA_ERQ_ERQ29_MASK) >> DMA_ERQ_ERQ29_SHIFT)
#define DMA_BRD_ERQ_ERQ29(base) (BME_UBFX32(&DMA_ERQ_REG(base), DMA_ERQ_ERQ29_SHIFT, DMA_ERQ_ERQ29_WIDTH))

/*! @brief Set the ERQ29 field to a new value. */
#define DMA_WR_ERQ_ERQ29(base, value) (DMA_RMW_ERQ(base, DMA_ERQ_ERQ29_MASK, DMA_ERQ_ERQ29(value)))
#define DMA_BWR_ERQ_ERQ29(base, value) (BME_BFI32(&DMA_ERQ_REG(base), ((uint32_t)(value) << DMA_ERQ_ERQ29_SHIFT), DMA_ERQ_ERQ29_SHIFT, DMA_ERQ_ERQ29_WIDTH))
/*@}*/

/*!
 * @name Register DMA_ERQ, field ERQ30[30] (RW)
 *
 * Values:
 * - 0b0 - The DMA request signal for the corresponding channel is disabled
 * - 0b1 - The DMA request signal for the corresponding channel is enabled
 */
/*@{*/
/*! @brief Read current value of the DMA_ERQ_ERQ30 field. */
#define DMA_RD_ERQ_ERQ30(base) ((DMA_ERQ_REG(base) & DMA_ERQ_ERQ30_MASK) >> DMA_ERQ_ERQ30_SHIFT)
#define DMA_BRD_ERQ_ERQ30(base) (BME_UBFX32(&DMA_ERQ_REG(base), DMA_ERQ_ERQ30_SHIFT, DMA_ERQ_ERQ30_WIDTH))

/*! @brief Set the ERQ30 field to a new value. */
#define DMA_WR_ERQ_ERQ30(base, value) (DMA_RMW_ERQ(base, DMA_ERQ_ERQ30_MASK, DMA_ERQ_ERQ30(value)))
#define DMA_BWR_ERQ_ERQ30(base, value) (BME_BFI32(&DMA_ERQ_REG(base), ((uint32_t)(value) << DMA_ERQ_ERQ30_SHIFT), DMA_ERQ_ERQ30_SHIFT, DMA_ERQ_ERQ30_WIDTH))
/*@}*/

/*!
 * @name Register DMA_ERQ, field ERQ31[31] (RW)
 *
 * Values:
 * - 0b0 - The DMA request signal for the corresponding channel is disabled
 * - 0b1 - The DMA request signal for the corresponding channel is enabled
 */
/*@{*/
/*! @brief Read current value of the DMA_ERQ_ERQ31 field. */
#define DMA_RD_ERQ_ERQ31(base) ((DMA_ERQ_REG(base) & DMA_ERQ_ERQ31_MASK) >> DMA_ERQ_ERQ31_SHIFT)
#define DMA_BRD_ERQ_ERQ31(base) (BME_UBFX32(&DMA_ERQ_REG(base), DMA_ERQ_ERQ31_SHIFT, DMA_ERQ_ERQ31_WIDTH))

/*! @brief Set the ERQ31 field to a new value. */
#define DMA_WR_ERQ_ERQ31(base, value) (DMA_RMW_ERQ(base, DMA_ERQ_ERQ31_MASK, DMA_ERQ_ERQ31(value)))
#define DMA_BWR_ERQ_ERQ31(base, value) (BME_BFI32(&DMA_ERQ_REG(base), ((uint32_t)(value) << DMA_ERQ_ERQ31_SHIFT), DMA_ERQ_ERQ31_SHIFT, DMA_ERQ_ERQ31_WIDTH))
/*@}*/

/*******************************************************************************
 * DMA_EEI - Enable Error Interrupt Register
 ******************************************************************************/

/*!
 * @brief DMA_EEI - Enable Error Interrupt Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The EEI register provides a bit map for the 32 channels to enable the error
 * interrupt signal for each channel. The state of any given channel's error
 * interrupt enable is directly affected by writes to this register; it is also
 * affected by writes to the SEEI and CEEI. These registers are provided so that the
 * error interrupt enable for a single channel can easily be modified without the
 * need to perform a read-modify-write sequence to the EEI register. The DMA error
 * indicator and the error interrupt enable flag must be asserted before an
 * error interrupt request for a given channel is asserted to the interrupt
 * controller.
 */
/*!
 * @name Constants and macros for entire DMA_EEI register
 */
/*@{*/
#define DMA_RD_EEI(base)         (DMA_EEI_REG(base))
#define DMA_WR_EEI(base, value)  (DMA_EEI_REG(base) = (value))
#define DMA_RMW_EEI(base, mask, value) (DMA_WR_EEI(base, (DMA_RD_EEI(base) & ~(mask)) | (value)))
#define DMA_SET_EEI(base, value) (BME_OR32(&DMA_EEI_REG(base), (uint32_t)(value)))
#define DMA_CLR_EEI(base, value) (BME_AND32(&DMA_EEI_REG(base), (uint32_t)(~(value))))
#define DMA_TOG_EEI(base, value) (BME_XOR32(&DMA_EEI_REG(base), (uint32_t)(value)))
/*@}*/

