ErichStyger/mcuoneclipse/Examples/KDS/TWR-KV58F220M/TWR_KV58F220M_PEx_2_SDKv2/SDK/platform/devices/MKV58F24/include/MKV58F24_extension.h
/*! @brief Set the INT5 field to a new value. */
#define DMA_WR_INT_INT5(base, value) (DMA_RMW_INT(base, (DMA_INT_INT5_MASK | DMA_INT_INT0_MASK | DMA_INT_INT1_MASK | DMA_INT_INT2_MASK | DMA_INT_INT3_MASK | DMA_INT_INT4_MASK | DMA_INT_INT6_MASK | DMA_INT_INT7_MASK | DMA_INT_INT8_MASK | DMA_INT_INT9_MASK | DMA_INT_INT10_MASK | DMA_INT_INT11_MASK | DMA_INT_INT12_MASK | DMA_INT_INT13_MASK | DMA_INT_INT14_MASK | DMA_INT_INT15_MASK | DMA_INT_INT16_MASK | DMA_INT_INT17_MASK | DMA_INT_INT18_MASK | DMA_INT_INT19_MASK | DMA_INT_INT20_MASK | DMA_INT_INT21_MASK | DMA_INT_INT22_MASK | DMA_INT_INT23_MASK | DMA_INT_INT24_MASK | DMA_INT_INT25_MASK | DMA_INT_INT26_MASK | DMA_INT_INT27_MASK | DMA_INT_INT28_MASK | DMA_INT_INT29_MASK | DMA_INT_INT30_MASK | DMA_INT_INT31_MASK), DMA_INT_INT5(value)))
#define DMA_BWR_INT_INT5(base, value) (BME_BFI32(&DMA_INT_REG(base), ((uint32_t)(value) << DMA_INT_INT5_SHIFT), DMA_INT_INT5_SHIFT, DMA_INT_INT5_WIDTH))
/*@}*/

/*!
 * @name Register DMA_INT, field INT6[6] (W1C)
 *
 * Values:
 * - 0b0 - The interrupt request for corresponding channel is cleared
 * - 0b1 - The interrupt request for corresponding channel is active
 */
/*@{*/
/*! @brief Read current value of the DMA_INT_INT6 field. */
#define DMA_RD_INT_INT6(base) ((DMA_INT_REG(base) & DMA_INT_INT6_MASK) >> DMA_INT_INT6_SHIFT)
#define DMA_BRD_INT_INT6(base) (BME_UBFX32(&DMA_INT_REG(base), DMA_INT_INT6_SHIFT, DMA_INT_INT6_WIDTH))

/*! @brief Set the INT6 field to a new value. */
#define DMA_WR_INT_INT6(base, value) (DMA_RMW_INT(base, (DMA_INT_INT6_MASK | DMA_INT_INT0_MASK | DMA_INT_INT1_MASK | DMA_INT_INT2_MASK | DMA_INT_INT3_MASK | DMA_INT_INT4_MASK | DMA_INT_INT5_MASK | DMA_INT_INT7_MASK | DMA_INT_INT8_MASK | DMA_INT_INT9_MASK | DMA_INT_INT10_MASK | DMA_INT_INT11_MASK | DMA_INT_INT12_MASK | DMA_INT_INT13_MASK | DMA_INT_INT14_MASK | DMA_INT_INT15_MASK | DMA_INT_INT16_MASK | DMA_INT_INT17_MASK | DMA_INT_INT18_MASK | DMA_INT_INT19_MASK | DMA_INT_INT20_MASK | DMA_INT_INT21_MASK | DMA_INT_INT22_MASK | DMA_INT_INT23_MASK | DMA_INT_INT24_MASK | DMA_INT_INT25_MASK | DMA_INT_INT26_MASK | DMA_INT_INT27_MASK | DMA_INT_INT28_MASK | DMA_INT_INT29_MASK | DMA_INT_INT30_MASK | DMA_INT_INT31_MASK), DMA_INT_INT6(value)))
#define DMA_BWR_INT_INT6(base, value) (BME_BFI32(&DMA_INT_REG(base), ((uint32_t)(value) << DMA_INT_INT6_SHIFT), DMA_INT_INT6_SHIFT, DMA_INT_INT6_WIDTH))
/*@}*/

/*!
 * @name Register DMA_INT, field INT7[7] (W1C)
 *
 * Values:
 * - 0b0 - The interrupt request for corresponding channel is cleared
 * - 0b1 - The interrupt request for corresponding channel is active
 */
/*@{*/
/*! @brief Read current value of the DMA_INT_INT7 field. */
#define DMA_RD_INT_INT7(base) ((DMA_INT_REG(base) & DMA_INT_INT7_MASK) >> DMA_INT_INT7_SHIFT)
#define DMA_BRD_INT_INT7(base) (BME_UBFX32(&DMA_INT_REG(base), DMA_INT_INT7_SHIFT, DMA_INT_INT7_WIDTH))

/*! @brief Set the INT7 field to a new value. */
#define DMA_WR_INT_INT7(base, value) (DMA_RMW_INT(base, (DMA_INT_INT7_MASK | DMA_INT_INT0_MASK | DMA_INT_INT1_MASK | DMA_INT_INT2_MASK | DMA_INT_INT3_MASK | DMA_INT_INT4_MASK | DMA_INT_INT5_MASK | DMA_INT_INT6_MASK | DMA_INT_INT8_MASK | DMA_INT_INT9_MASK | DMA_INT_INT10_MASK | DMA_INT_INT11_MASK | DMA_INT_INT12_MASK | DMA_INT_INT13_MASK | DMA_INT_INT14_MASK | DMA_INT_INT15_MASK | DMA_INT_INT16_MASK | DMA_INT_INT17_MASK | DMA_INT_INT18_MASK | DMA_INT_INT19_MASK | DMA_INT_INT20_MASK | DMA_INT_INT21_MASK | DMA_INT_INT22_MASK | DMA_INT_INT23_MASK | DMA_INT_INT24_MASK | DMA_INT_INT25_MASK | DMA_INT_INT26_MASK | DMA_INT_INT27_MASK | DMA_INT_INT28_MASK | DMA_INT_INT29_MASK | DMA_INT_INT30_MASK | DMA_INT_INT31_MASK), DMA_INT_INT7(value)))
#define DMA_BWR_INT_INT7(base, value) (BME_BFI32(&DMA_INT_REG(base), ((uint32_t)(value) << DMA_INT_INT7_SHIFT), DMA_INT_INT7_SHIFT, DMA_INT_INT7_WIDTH))
/*@}*/

/*!
 * @name Register DMA_INT, field INT8[8] (W1C)
 *
 * Values:
 * - 0b0 - The interrupt request for corresponding channel is cleared
 * - 0b1 - The interrupt request for corresponding channel is active
 */
/*@{*/
/*! @brief Read current value of the DMA_INT_INT8 field. */
#define DMA_RD_INT_INT8(base) ((DMA_INT_REG(base) & DMA_INT_INT8_MASK) >> DMA_INT_INT8_SHIFT)
#define DMA_BRD_INT_INT8(base) (BME_UBFX32(&DMA_INT_REG(base), DMA_INT_INT8_SHIFT, DMA_INT_INT8_WIDTH))

/*! @brief Set the INT8 field to a new value. */
#define DMA_WR_INT_INT8(base, value) (DMA_RMW_INT(base, (DMA_INT_INT8_MASK | DMA_INT_INT0_MASK | DMA_INT_INT1_MASK | DMA_INT_INT2_MASK | DMA_INT_INT3_MASK | DMA_INT_INT4_MASK | DMA_INT_INT5_MASK | DMA_INT_INT6_MASK | DMA_INT_INT7_MASK | DMA_INT_INT9_MASK | DMA_INT_INT10_MASK | DMA_INT_INT11_MASK | DMA_INT_INT12_MASK | DMA_INT_INT13_MASK | DMA_INT_INT14_MASK | DMA_INT_INT15_MASK | DMA_INT_INT16_MASK | DMA_INT_INT17_MASK | DMA_INT_INT18_MASK | DMA_INT_INT19_MASK | DMA_INT_INT20_MASK | DMA_INT_INT21_MASK | DMA_INT_INT22_MASK | DMA_INT_INT23_MASK | DMA_INT_INT24_MASK | DMA_INT_INT25_MASK | DMA_INT_INT26_MASK | DMA_INT_INT27_MASK | DMA_INT_INT28_MASK | DMA_INT_INT29_MASK | DMA_INT_INT30_MASK | DMA_INT_INT31_MASK), DMA_INT_INT8(value)))
#define DMA_BWR_INT_INT8(base, value) (BME_BFI32(&DMA_INT_REG(base), ((uint32_t)(value) << DMA_INT_INT8_SHIFT), DMA_INT_INT8_SHIFT, DMA_INT_INT8_WIDTH))
/*@}*/

/*!
 * @name Register DMA_INT, field INT9[9] (W1C)
 *
 * Values:
 * - 0b0 - The interrupt request for corresponding channel is cleared
 * - 0b1 - The interrupt request for corresponding channel is active
 */
/*@{*/
/*! @brief Read current value of the DMA_INT_INT9 field. */
#define DMA_RD_INT_INT9(base) ((DMA_INT_REG(base) & DMA_INT_INT9_MASK) >> DMA_INT_INT9_SHIFT)
#define DMA_BRD_INT_INT9(base) (BME_UBFX32(&DMA_INT_REG(base), DMA_INT_INT9_SHIFT, DMA_INT_INT9_WIDTH))

/*! @brief Set the INT9 field to a new value. */
#define DMA_WR_INT_INT9(base, value) (DMA_RMW_INT(base, (DMA_INT_INT9_MASK | DMA_INT_INT0_MASK | DMA_INT_INT1_MASK | DMA_INT_INT2_MASK | DMA_INT_INT3_MASK | DMA_INT_INT4_MASK | DMA_INT_INT5_MASK | DMA_INT_INT6_MASK | DMA_INT_INT7_MASK | DMA_INT_INT8_MASK | DMA_INT_INT10_MASK | DMA_INT_INT11_MASK | DMA_INT_INT12_MASK | DMA_INT_INT13_MASK | DMA_INT_INT14_MASK | DMA_INT_INT15_MASK | DMA_INT_INT16_MASK | DMA_INT_INT17_MASK | DMA_INT_INT18_MASK | DMA_INT_INT19_MASK | DMA_INT_INT20_MASK | DMA_INT_INT21_MASK | DMA_INT_INT22_MASK | DMA_INT_INT23_MASK | DMA_INT_INT24_MASK | DMA_INT_INT25_MASK | DMA_INT_INT26_MASK | DMA_INT_INT27_MASK | DMA_INT_INT28_MASK | DMA_INT_INT29_MASK | DMA_INT_INT30_MASK | DMA_INT_INT31_MASK), DMA_INT_INT9(value)))
#define DMA_BWR_INT_INT9(base, value) (BME_BFI32(&DMA_INT_REG(base), ((uint32_t)(value) << DMA_INT_INT9_SHIFT), DMA_INT_INT9_SHIFT, DMA_INT_INT9_WIDTH))
/*@}*/

/*!
 * @name Register DMA_INT, field INT10[10] (W1C)
 *
 * Values:
 * - 0b0 - The interrupt request for corresponding channel is cleared
 * - 0b1 - The interrupt request for corresponding channel is active
 */
/*@{*/
/*! @brief Read current value of the DMA_INT_INT10 field. */
#define DMA_RD_INT_INT10(base) ((DMA_INT_REG(base) & DMA_INT_INT10_MASK) >> DMA_INT_INT10_SHIFT)
#define DMA_BRD_INT_INT10(base) (BME_UBFX32(&DMA_INT_REG(base), DMA_INT_INT10_SHIFT, DMA_INT_INT10_WIDTH))

