ErichStyger/mcuoneclipse/Examples/KDS/TWR-KV58F220M/TWR_KV58F220M_PEx_2_SDKv2/SDK/platform/devices/MKV58F24/include/MKV58F24_extension.h
/*! @brief Set the EDREQ_9 field to a new value. */
#define DMA_WR_EARS_EDREQ_9(base, value) (DMA_RMW_EARS(base, DMA_EARS_EDREQ_9_MASK, DMA_EARS_EDREQ_9(value)))
#define DMA_BWR_EARS_EDREQ_9(base, value) (BME_BFI32(&DMA_EARS_REG(base), ((uint32_t)(value) << DMA_EARS_EDREQ_9_SHIFT), DMA_EARS_EDREQ_9_SHIFT, DMA_EARS_EDREQ_9_WIDTH))
/*@}*/

/*!
 * @name Register DMA_EARS, field EDREQ_10[10] (RW)
 *
 * Values:
 * - 0b0 - Disable asynchronous DMA request for channel 10.
 * - 0b1 - Enable asynchronous DMA request for channel 10.
 */
/*@{*/
/*! @brief Read current value of the DMA_EARS_EDREQ_10 field. */
#define DMA_RD_EARS_EDREQ_10(base) ((DMA_EARS_REG(base) & DMA_EARS_EDREQ_10_MASK) >> DMA_EARS_EDREQ_10_SHIFT)
#define DMA_BRD_EARS_EDREQ_10(base) (BME_UBFX32(&DMA_EARS_REG(base), DMA_EARS_EDREQ_10_SHIFT, DMA_EARS_EDREQ_10_WIDTH))

/*! @brief Set the EDREQ_10 field to a new value. */
#define DMA_WR_EARS_EDREQ_10(base, value) (DMA_RMW_EARS(base, DMA_EARS_EDREQ_10_MASK, DMA_EARS_EDREQ_10(value)))
#define DMA_BWR_EARS_EDREQ_10(base, value) (BME_BFI32(&DMA_EARS_REG(base), ((uint32_t)(value) << DMA_EARS_EDREQ_10_SHIFT), DMA_EARS_EDREQ_10_SHIFT, DMA_EARS_EDREQ_10_WIDTH))
/*@}*/

/*!
 * @name Register DMA_EARS, field EDREQ_11[11] (RW)
 *
 * Values:
 * - 0b0 - Disable asynchronous DMA request for channel 11.
 * - 0b1 - Enable asynchronous DMA request for channel 11.
 */
/*@{*/
/*! @brief Read current value of the DMA_EARS_EDREQ_11 field. */
#define DMA_RD_EARS_EDREQ_11(base) ((DMA_EARS_REG(base) & DMA_EARS_EDREQ_11_MASK) >> DMA_EARS_EDREQ_11_SHIFT)
#define DMA_BRD_EARS_EDREQ_11(base) (BME_UBFX32(&DMA_EARS_REG(base), DMA_EARS_EDREQ_11_SHIFT, DMA_EARS_EDREQ_11_WIDTH))

/*! @brief Set the EDREQ_11 field to a new value. */
#define DMA_WR_EARS_EDREQ_11(base, value) (DMA_RMW_EARS(base, DMA_EARS_EDREQ_11_MASK, DMA_EARS_EDREQ_11(value)))
#define DMA_BWR_EARS_EDREQ_11(base, value) (BME_BFI32(&DMA_EARS_REG(base), ((uint32_t)(value) << DMA_EARS_EDREQ_11_SHIFT), DMA_EARS_EDREQ_11_SHIFT, DMA_EARS_EDREQ_11_WIDTH))
/*@}*/

/*!
 * @name Register DMA_EARS, field EDREQ_12[12] (RW)
 *
 * Values:
 * - 0b0 - Disable asynchronous DMA request for channel 12.
 * - 0b1 - Enable asynchronous DMA request for channel 12.
 */
/*@{*/
/*! @brief Read current value of the DMA_EARS_EDREQ_12 field. */
#define DMA_RD_EARS_EDREQ_12(base) ((DMA_EARS_REG(base) & DMA_EARS_EDREQ_12_MASK) >> DMA_EARS_EDREQ_12_SHIFT)
#define DMA_BRD_EARS_EDREQ_12(base) (BME_UBFX32(&DMA_EARS_REG(base), DMA_EARS_EDREQ_12_SHIFT, DMA_EARS_EDREQ_12_WIDTH))

/*! @brief Set the EDREQ_12 field to a new value. */
#define DMA_WR_EARS_EDREQ_12(base, value) (DMA_RMW_EARS(base, DMA_EARS_EDREQ_12_MASK, DMA_EARS_EDREQ_12(value)))
#define DMA_BWR_EARS_EDREQ_12(base, value) (BME_BFI32(&DMA_EARS_REG(base), ((uint32_t)(value) << DMA_EARS_EDREQ_12_SHIFT), DMA_EARS_EDREQ_12_SHIFT, DMA_EARS_EDREQ_12_WIDTH))
/*@}*/

/*!
 * @name Register DMA_EARS, field EDREQ_13[13] (RW)
 *
 * Values:
 * - 0b0 - Disable asynchronous DMA request for channel 13.
 * - 0b1 - Enable asynchronous DMA request for channel 13.
 */
/*@{*/
/*! @brief Read current value of the DMA_EARS_EDREQ_13 field. */
#define DMA_RD_EARS_EDREQ_13(base) ((DMA_EARS_REG(base) & DMA_EARS_EDREQ_13_MASK) >> DMA_EARS_EDREQ_13_SHIFT)
#define DMA_BRD_EARS_EDREQ_13(base) (BME_UBFX32(&DMA_EARS_REG(base), DMA_EARS_EDREQ_13_SHIFT, DMA_EARS_EDREQ_13_WIDTH))

/*! @brief Set the EDREQ_13 field to a new value. */
#define DMA_WR_EARS_EDREQ_13(base, value) (DMA_RMW_EARS(base, DMA_EARS_EDREQ_13_MASK, DMA_EARS_EDREQ_13(value)))
#define DMA_BWR_EARS_EDREQ_13(base, value) (BME_BFI32(&DMA_EARS_REG(base), ((uint32_t)(value) << DMA_EARS_EDREQ_13_SHIFT), DMA_EARS_EDREQ_13_SHIFT, DMA_EARS_EDREQ_13_WIDTH))
/*@}*/

/*!
 * @name Register DMA_EARS, field EDREQ_14[14] (RW)
 *
 * Values:
 * - 0b0 - Disable asynchronous DMA request for channel 14.
 * - 0b1 - Enable asynchronous DMA request for channel 14.
 */
/*@{*/
/*! @brief Read current value of the DMA_EARS_EDREQ_14 field. */
#define DMA_RD_EARS_EDREQ_14(base) ((DMA_EARS_REG(base) & DMA_EARS_EDREQ_14_MASK) >> DMA_EARS_EDREQ_14_SHIFT)
#define DMA_BRD_EARS_EDREQ_14(base) (BME_UBFX32(&DMA_EARS_REG(base), DMA_EARS_EDREQ_14_SHIFT, DMA_EARS_EDREQ_14_WIDTH))

/*! @brief Set the EDREQ_14 field to a new value. */
#define DMA_WR_EARS_EDREQ_14(base, value) (DMA_RMW_EARS(base, DMA_EARS_EDREQ_14_MASK, DMA_EARS_EDREQ_14(value)))
#define DMA_BWR_EARS_EDREQ_14(base, value) (BME_BFI32(&DMA_EARS_REG(base), ((uint32_t)(value) << DMA_EARS_EDREQ_14_SHIFT), DMA_EARS_EDREQ_14_SHIFT, DMA_EARS_EDREQ_14_WIDTH))
/*@}*/

/*!
 * @name Register DMA_EARS, field EDREQ_15[15] (RW)
 *
 * Values:
 * - 0b0 - Disable asynchronous DMA request for channel 15.
 * - 0b1 - Enable asynchronous DMA request for channel 15.
 */
/*@{*/
/*! @brief Read current value of the DMA_EARS_EDREQ_15 field. */
#define DMA_RD_EARS_EDREQ_15(base) ((DMA_EARS_REG(base) & DMA_EARS_EDREQ_15_MASK) >> DMA_EARS_EDREQ_15_SHIFT)
#define DMA_BRD_EARS_EDREQ_15(base) (BME_UBFX32(&DMA_EARS_REG(base), DMA_EARS_EDREQ_15_SHIFT, DMA_EARS_EDREQ_15_WIDTH))

/*! @brief Set the EDREQ_15 field to a new value. */
#define DMA_WR_EARS_EDREQ_15(base, value) (DMA_RMW_EARS(base, DMA_EARS_EDREQ_15_MASK, DMA_EARS_EDREQ_15(value)))
#define DMA_BWR_EARS_EDREQ_15(base, value) (BME_BFI32(&DMA_EARS_REG(base), ((uint32_t)(value) << DMA_EARS_EDREQ_15_SHIFT), DMA_EARS_EDREQ_15_SHIFT, DMA_EARS_EDREQ_15_WIDTH))
/*@}*/

/*!
 * @name Register DMA_EARS, field EDREQ_16[16] (RW)
 *
 * Values:
 * - 0b0 - Disable asynchronous DMA request for channel 16
 * - 0b1 - Enable asynchronous DMA request for channel 16
 */
/*@{*/
/*! @brief Read current value of the DMA_EARS_EDREQ_16 field. */
#define DMA_RD_EARS_EDREQ_16(base) ((DMA_EARS_REG(base) & DMA_EARS_EDREQ_16_MASK) >> DMA_EARS_EDREQ_16_SHIFT)
#define DMA_BRD_EARS_EDREQ_16(base) (BME_UBFX32(&DMA_EARS_REG(base), DMA_EARS_EDREQ_16_SHIFT, DMA_EARS_EDREQ_16_WIDTH))

/*! @brief Set the EDREQ_16 field to a new value. */
#define DMA_WR_EARS_EDREQ_16(base, value) (DMA_RMW_EARS(base, DMA_EARS_EDREQ_16_MASK, DMA_EARS_EDREQ_16(value)))
#define DMA_BWR_EARS_EDREQ_16(base, value) (BME_BFI32(&DMA_EARS_REG(base), ((uint32_t)(value) << DMA_EARS_EDREQ_16_SHIFT), DMA_EARS_EDREQ_16_SHIFT, DMA_EARS_EDREQ_16_WIDTH))
/*@}*/

/*!
 * @name Register DMA_EARS, field EDREQ_17[17] (RW)
 *
 * Values:
 * - 0b0 - Disable asynchronous DMA request for channel 17
 * - 0b1 - Enable asynchronous DMA request for channel 17
 */
/*@{*/
/*! @brief Read current value of the DMA_EARS_EDREQ_17 field. */
#define DMA_RD_EARS_EDREQ_17(base) ((DMA_EARS_REG(base) & DMA_EARS_EDREQ_17_MASK) >> DMA_EARS_EDREQ_17_SHIFT)
#define DMA_BRD_EARS_EDREQ_17(base) (BME_UBFX32(&DMA_EARS_REG(base), DMA_EARS_EDREQ_17_SHIFT, DMA_EARS_EDREQ_17_WIDTH))

/*! @brief Set the EDREQ_17 field to a new value. */
#define DMA_WR_EARS_EDREQ_17(base, value) (DMA_RMW_EARS(base, DMA_EARS_EDREQ_17_MASK, DMA_EARS_EDREQ_17(value)))
#define DMA_BWR_EARS_EDREQ_17(base, value) (BME_BFI32(&DMA_EARS_REG(base), ((uint32_t)(value) << DMA_EARS_EDREQ_17_SHIFT), DMA_EARS_EDREQ_17_SHIFT, DMA_EARS_EDREQ_17_WIDTH))
/*@}*/

/*!
 * @name Register DMA_EARS, field EDREQ_18[18] (RW)
 *
 * Values:
 * - 0b0 - Disable asynchronous DMA request for channel 18
 * - 0b1 - Enable asynchronous DMA request for channel 18
 */
/*@{*/
/*! @brief Read current value of the DMA_EARS_EDREQ_18 field. */
#define DMA_RD_EARS_EDREQ_18(base) ((DMA_EARS_REG(base) & DMA_EARS_EDREQ_18_MASK) >> DMA_EARS_EDREQ_18_SHIFT)
#define DMA_BRD_EARS_EDREQ_18(base) (BME_UBFX32(&DMA_EARS_REG(base), DMA_EARS_EDREQ_18_SHIFT, DMA_EARS_EDREQ_18_WIDTH))

/*! @brief Set the EDREQ_18 field to a new value. */
#define DMA_WR_EARS_EDREQ_18(base, value) (DMA_RMW_EARS(base, DMA_EARS_EDREQ_18_MASK, DMA_EARS_EDREQ_18(value)))
#define DMA_BWR_EARS_EDREQ_18(base, value) (BME_BFI32(&DMA_EARS_REG(base), ((uint32_t)(value) << DMA_EARS_EDREQ_18_SHIFT), DMA_EARS_EDREQ_18_SHIFT, DMA_EARS_EDREQ_18_WIDTH))
/*@}*/

/*!
 * @name Register DMA_EARS, field EDREQ_19[19] (RW)
 *
 * Values:
 * - 0b0 - Disable asynchronous DMA request for channel 19
 * - 0b1 - Enable asynchronous DMA request for channel 19
 */
/*@{*/
/*! @brief Read current value of the DMA_EARS_EDREQ_19 field. */
#define DMA_RD_EARS_EDREQ_19(base) ((DMA_EARS_REG(base) & DMA_EARS_EDREQ_19_MASK) >> DMA_EARS_EDREQ_19_SHIFT)
#define DMA_BRD_EARS_EDREQ_19(base) (BME_UBFX32(&DMA_EARS_REG(base), DMA_EARS_EDREQ_19_SHIFT, DMA_EARS_EDREQ_19_WIDTH))

/*! @brief Set the EDREQ_19 field to a new value. */
#define DMA_WR_EARS_EDREQ_19(base, value) (DMA_RMW_EARS(base, DMA_EARS_EDREQ_19_MASK, DMA_EARS_EDREQ_19(value)))
#define DMA_BWR_EARS_EDREQ_19(base, value) (BME_BFI32(&DMA_EARS_REG(base), ((uint32_t)(value) << DMA_EARS_EDREQ_19_SHIFT), DMA_EARS_EDREQ_19_SHIFT, DMA_EARS_EDREQ_19_WIDTH))
/*@}*/

/*!
 * @name Register DMA_EARS, field EDREQ_20[20] (RW)
 *
 * Values:
 * - 0b0 - Disable asynchronous DMA request for channel 20
 * - 0b1 - Enable asynchronous DMA request for channel 20
 */
/*@{*/
/*! @brief Read current value of the DMA_EARS_EDREQ_20 field. */
#define DMA_RD_EARS_EDREQ_20(base) ((DMA_EARS_REG(base) & DMA_EARS_EDREQ_20_MASK) >> DMA_EARS_EDREQ_20_SHIFT)
#define DMA_BRD_EARS_EDREQ_20(base) (BME_UBFX32(&DMA_EARS_REG(base), DMA_EARS_EDREQ_20_SHIFT, DMA_EARS_EDREQ_20_WIDTH))

/*! @brief Set the EDREQ_20 field to a new value. */
#define DMA_WR_EARS_EDREQ_20(base, value) (DMA_RMW_EARS(base, DMA_EARS_EDREQ_20_MASK, DMA_EARS_EDREQ_20(value)))
#define DMA_BWR_EARS_EDREQ_20(base, value) (BME_BFI32(&DMA_EARS_REG(base), ((uint32_t)(value) << DMA_EARS_EDREQ_20_SHIFT), DMA_EARS_EDREQ_20_SHIFT, DMA_EARS_EDREQ_20_WIDTH))
/*@}*/

/*!
 * @name Register DMA_EARS, field EDREQ_21[21] (RW)
 *
 * Values:
 * - 0b0 - Disable asynchronous DMA request for channel 21
 * - 0b1 - Enable asynchronous DMA request for channel 21
 */
/*@{*/
/*! @brief Read current value of the DMA_EARS_EDREQ_21 field. */
#define DMA_RD_EARS_EDREQ_21(base) ((DMA_EARS_REG(base) & DMA_EARS_EDREQ_21_MASK) >> DMA_EARS_EDREQ_21_SHIFT)
#define DMA_BRD_EARS_EDREQ_21(base) (BME_UBFX32(&DMA_EARS_REG(base), DMA_EARS_EDREQ_21_SHIFT, DMA_EARS_EDREQ_21_WIDTH))

/*! @brief Set the EDREQ_21 field to a new value. */
#define DMA_WR_EARS_EDREQ_21(base, value) (DMA_RMW_EARS(base, DMA_EARS_EDREQ_21_MASK, DMA_EARS_EDREQ_21(value)))
#define DMA_BWR_EARS_EDREQ_21(base, value) (BME_BFI32(&DMA_EARS_REG(base), ((uint32_t)(value) << DMA_EARS_EDREQ_21_SHIFT), DMA_EARS_EDREQ_21_SHIFT, DMA_EARS_EDREQ_21_WIDTH))
/*@}*/

/*!
 * @name Register DMA_EARS, field EDREQ_22[22] (RW)
 *
 * Values:
 * - 0b0 - Disable asynchronous DMA request for channel 22
 * - 0b1 - Enable asynchronous DMA request for channel 22
 */
/*@{*/
/*! @brief Read current value of the DMA_EARS_EDREQ_22 field. */
#define DMA_RD_EARS_EDREQ_22(base) ((DMA_EARS_REG(base) & DMA_EARS_EDREQ_22_MASK) >> DMA_EARS_EDREQ_22_SHIFT)
#define DMA_BRD_EARS_EDREQ_22(base) (BME_UBFX32(&DMA_EARS_REG(base), DMA_EARS_EDREQ_22_SHIFT, DMA_EARS_EDREQ_22_WIDTH))

/*! @brief Set the EDREQ_22 field to a new value. */
#define DMA_WR_EARS_EDREQ_22(base, value) (DMA_RMW_EARS(base, DMA_EARS_EDREQ_22_MASK, DMA_EARS_EDREQ_22(value)))
#define DMA_BWR_EARS_EDREQ_22(base, value) (BME_BFI32(&DMA_EARS_REG(base), ((uint32_t)(value) << DMA_EARS_EDREQ_22_SHIFT), DMA_EARS_EDREQ_22_SHIFT, DMA_EARS_EDREQ_22_WIDTH))
/*@}*/

/*!
 * @name Register DMA_EARS, field EDREQ_23[23] (RW)
 *
 * Values:
 * - 0b0 - Disable asynchronous DMA request for channel 23
 * - 0b1 - Enable asynchronous DMA request for channel 23
 */
/*@{*/
/*! @brief Read current value of the DMA_EARS_EDREQ_23 field. */
#define DMA_RD_EARS_EDREQ_23(base) ((DMA_EARS_REG(base) & DMA_EARS_EDREQ_23_MASK) >> DMA_EARS_EDREQ_23_SHIFT)
#define DMA_BRD_EARS_EDREQ_23(base) (BME_UBFX32(&DMA_EARS_REG(base), DMA_EARS_EDREQ_23_SHIFT, DMA_EARS_EDREQ_23_WIDTH))

/*! @brief Set the EDREQ_23 field to a new value. */
#define DMA_WR_EARS_EDREQ_23(base, value) (DMA_RMW_EARS(base, DMA_EARS_EDREQ_23_MASK, DMA_EARS_EDREQ_23(value)))
#define DMA_BWR_EARS_EDREQ_23(base, value) (BME_BFI32(&DMA_EARS_REG(base), ((uint32_t)(value) << DMA_EARS_EDREQ_23_SHIFT), DMA_EARS_EDREQ_23_SHIFT, DMA_EARS_EDREQ_23_WIDTH))
/*@}*/

/*!
 * @name Register DMA_EARS, field EDREQ_24[24] (RW)
 *
 * Values:
 * - 0b0 - Disable asynchronous DMA request for channel 24
 * - 0b1 - Enable asynchronous DMA request for channel 24
 */
/*@{*/
/*! @brief Read current value of the DMA_EARS_EDREQ_24 field. */
#define DMA_RD_EARS_EDREQ_24(base) ((DMA_EARS_REG(base) & DMA_EARS_EDREQ_24_MASK) >> DMA_EARS_EDREQ_24_SHIFT)
#define DMA_BRD_EARS_EDREQ_24(base) (BME_UBFX32(&DMA_EARS_REG(base), DMA_EARS_EDREQ_24_SHIFT, DMA_EARS_EDREQ_24_WIDTH))

