ErichStyger/mcuoneclipse/Examples/KDS/TWR-KV58F220M/TWR_KV58F220M_PEx_2_SDKv2/SDK/platform/devices/MKV58F24/include/MKV58F24_extension.h
/*******************************************************************************
 * ENC_POSD - Position Difference Counter Register
 ******************************************************************************/

/*!
 * @brief ENC_POSD - Position Difference Counter Register (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire ENC_POSD register
 */
/*@{*/
#define ENC_RD_POSD(base)        (ENC_POSD_REG(base))
#define ENC_WR_POSD(base, value) (ENC_POSD_REG(base) = (value))
#define ENC_RMW_POSD(base, mask, value) (ENC_WR_POSD(base, (ENC_RD_POSD(base) & ~(mask)) | (value)))
#define ENC_SET_POSD(base, value) (BME_OR16(&ENC_POSD_REG(base), (uint16_t)(value)))
#define ENC_CLR_POSD(base, value) (BME_AND16(&ENC_POSD_REG(base), (uint16_t)(~(value))))
#define ENC_TOG_POSD(base, value) (BME_XOR16(&ENC_POSD_REG(base), (uint16_t)(value)))
/*@}*/

/*******************************************************************************
 * ENC_POSDH - Position Difference Hold Register
 ******************************************************************************/

/*!
 * @brief ENC_POSDH - Position Difference Hold Register (RO)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire ENC_POSDH register
 */
/*@{*/
#define ENC_RD_POSDH(base)       (ENC_POSDH_REG(base))
/*@}*/

/*******************************************************************************
 * ENC_REV - Revolution Counter Register
 ******************************************************************************/

/*!
 * @brief ENC_REV - Revolution Counter Register (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire ENC_REV register
 */
/*@{*/
#define ENC_RD_REV(base)         (ENC_REV_REG(base))
#define ENC_WR_REV(base, value)  (ENC_REV_REG(base) = (value))
#define ENC_RMW_REV(base, mask, value) (ENC_WR_REV(base, (ENC_RD_REV(base) & ~(mask)) | (value)))
#define ENC_SET_REV(base, value) (BME_OR16(&ENC_REV_REG(base), (uint16_t)(value)))
#define ENC_CLR_REV(base, value) (BME_AND16(&ENC_REV_REG(base), (uint16_t)(~(value))))
#define ENC_TOG_REV(base, value) (BME_XOR16(&ENC_REV_REG(base), (uint16_t)(value)))
/*@}*/

/*******************************************************************************
 * ENC_REVH - Revolution Hold Register
 ******************************************************************************/

/*!
 * @brief ENC_REVH - Revolution Hold Register (RO)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire ENC_REVH register
 */
/*@{*/
#define ENC_RD_REVH(base)        (ENC_REVH_REG(base))
/*@}*/

/*******************************************************************************
 * ENC_UPOS - Upper Position Counter Register
 ******************************************************************************/

/*!
 * @brief ENC_UPOS - Upper Position Counter Register (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire ENC_UPOS register
 */
/*@{*/
#define ENC_RD_UPOS(base)        (ENC_UPOS_REG(base))
#define ENC_WR_UPOS(base, value) (ENC_UPOS_REG(base) = (value))
#define ENC_RMW_UPOS(base, mask, value) (ENC_WR_UPOS(base, (ENC_RD_UPOS(base) & ~(mask)) | (value)))
#define ENC_SET_UPOS(base, value) (BME_OR16(&ENC_UPOS_REG(base), (uint16_t)(value)))
#define ENC_CLR_UPOS(base, value) (BME_AND16(&ENC_UPOS_REG(base), (uint16_t)(~(value))))
#define ENC_TOG_UPOS(base, value) (BME_XOR16(&ENC_UPOS_REG(base), (uint16_t)(value)))
/*@}*/

/*******************************************************************************
 * ENC_LPOS - Lower Position Counter Register
 ******************************************************************************/

/*!
 * @brief ENC_LPOS - Lower Position Counter Register (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire ENC_LPOS register
 */
/*@{*/
#define ENC_RD_LPOS(base)        (ENC_LPOS_REG(base))
#define ENC_WR_LPOS(base, value) (ENC_LPOS_REG(base) = (value))
#define ENC_RMW_LPOS(base, mask, value) (ENC_WR_LPOS(base, (ENC_RD_LPOS(base) & ~(mask)) | (value)))
#define ENC_SET_LPOS(base, value) (BME_OR16(&ENC_LPOS_REG(base), (uint16_t)(value)))
#define ENC_CLR_LPOS(base, value) (BME_AND16(&ENC_LPOS_REG(base), (uint16_t)(~(value))))
#define ENC_TOG_LPOS(base, value) (BME_XOR16(&ENC_LPOS_REG(base), (uint16_t)(value)))
/*@}*/

/*******************************************************************************
 * ENC_UPOSH - Upper Position Hold Register
 ******************************************************************************/

/*!
 * @brief ENC_UPOSH - Upper Position Hold Register (RO)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire ENC_UPOSH register
 */
/*@{*/
#define ENC_RD_UPOSH(base)       (ENC_UPOSH_REG(base))
/*@}*/

/*******************************************************************************
 * ENC_LPOSH - Lower Position Hold Register
 ******************************************************************************/

/*!
 * @brief ENC_LPOSH - Lower Position Hold Register (RO)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire ENC_LPOSH register
 */
/*@{*/
#define ENC_RD_LPOSH(base)       (ENC_LPOSH_REG(base))
/*@}*/

/*******************************************************************************
 * ENC_UINIT - Upper Initialization Register
 ******************************************************************************/

/*!
 * @brief ENC_UINIT - Upper Initialization Register (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire ENC_UINIT register
 */
/*@{*/
#define ENC_RD_UINIT(base)       (ENC_UINIT_REG(base))
#define ENC_WR_UINIT(base, value) (ENC_UINIT_REG(base) = (value))
#define ENC_RMW_UINIT(base, mask, value) (ENC_WR_UINIT(base, (ENC_RD_UINIT(base) & ~(mask)) | (value)))
#define ENC_SET_UINIT(base, value) (BME_OR16(&ENC_UINIT_REG(base), (uint16_t)(value)))
#define ENC_CLR_UINIT(base, value) (BME_AND16(&ENC_UINIT_REG(base), (uint16_t)(~(value))))
#define ENC_TOG_UINIT(base, value) (BME_XOR16(&ENC_UINIT_REG(base), (uint16_t)(value)))
/*@}*/

