ErichStyger/mcuoneclipse/Examples/KDS/TWR-KV58F220M/TWR_KV58F220M_PEx_2_SDKv2/SDK/platform/devices/MKV58F24/include/MKV58F24_extension.h
/*
 * Constants & macros for individual ENC_TST bitfields
 */

/*!
 * @name Register ENC_TST, field TEST_COUNT[7:0] (RW)
 *
 * These bits hold the number of quadrature advances to generate.
 */
/*@{*/
/*! @brief Read current value of the ENC_TST_TEST_COUNT field. */
#define ENC_RD_TST_TEST_COUNT(base) ((ENC_TST_REG(base) & ENC_TST_TEST_COUNT_MASK) >> ENC_TST_TEST_COUNT_SHIFT)
#define ENC_BRD_TST_TEST_COUNT(base) (BME_UBFX16(&ENC_TST_REG(base), ENC_TST_TEST_COUNT_SHIFT, ENC_TST_TEST_COUNT_WIDTH))

/*! @brief Set the TEST_COUNT field to a new value. */
#define ENC_WR_TST_TEST_COUNT(base, value) (ENC_RMW_TST(base, ENC_TST_TEST_COUNT_MASK, ENC_TST_TEST_COUNT(value)))
#define ENC_BWR_TST_TEST_COUNT(base, value) (BME_BFI16(&ENC_TST_REG(base), ((uint16_t)(value) << ENC_TST_TEST_COUNT_SHIFT), ENC_TST_TEST_COUNT_SHIFT, ENC_TST_TEST_COUNT_WIDTH))
/*@}*/

/*!
 * @name Register ENC_TST, field TEST_PERIOD[12:8] (RW)
 *
 * These bits hold the period of quadrature phase in IPBus clock cycles.
 */
/*@{*/
/*! @brief Read current value of the ENC_TST_TEST_PERIOD field. */
#define ENC_RD_TST_TEST_PERIOD(base) ((ENC_TST_REG(base) & ENC_TST_TEST_PERIOD_MASK) >> ENC_TST_TEST_PERIOD_SHIFT)
#define ENC_BRD_TST_TEST_PERIOD(base) (BME_UBFX16(&ENC_TST_REG(base), ENC_TST_TEST_PERIOD_SHIFT, ENC_TST_TEST_PERIOD_WIDTH))

/*! @brief Set the TEST_PERIOD field to a new value. */
#define ENC_WR_TST_TEST_PERIOD(base, value) (ENC_RMW_TST(base, ENC_TST_TEST_PERIOD_MASK, ENC_TST_TEST_PERIOD(value)))
#define ENC_BWR_TST_TEST_PERIOD(base, value) (BME_BFI16(&ENC_TST_REG(base), ((uint16_t)(value) << ENC_TST_TEST_PERIOD_SHIFT), ENC_TST_TEST_PERIOD_SHIFT, ENC_TST_TEST_PERIOD_WIDTH))
/*@}*/

/*!
 * @name Register ENC_TST, field QDN[13] (RW)
 *
 * When set, this bit generates a negative quadrature signal. Otherwise the
 * signal is in a positive direction.
 *
 * Values:
 * - 0b0 - Leaves quadrature decoder signal in a positive direction
 * - 0b1 - Generates a negative quadrature decoder signal
 */
/*@{*/
/*! @brief Read current value of the ENC_TST_QDN field. */
#define ENC_RD_TST_QDN(base) ((ENC_TST_REG(base) & ENC_TST_QDN_MASK) >> ENC_TST_QDN_SHIFT)
#define ENC_BRD_TST_QDN(base) (BME_UBFX16(&ENC_TST_REG(base), ENC_TST_QDN_SHIFT, ENC_TST_QDN_WIDTH))

/*! @brief Set the QDN field to a new value. */
#define ENC_WR_TST_QDN(base, value) (ENC_RMW_TST(base, ENC_TST_QDN_MASK, ENC_TST_QDN(value)))
#define ENC_BWR_TST_QDN(base, value) (BME_BFI16(&ENC_TST_REG(base), ((uint16_t)(value) << ENC_TST_QDN_SHIFT), ENC_TST_QDN_SHIFT, ENC_TST_QDN_WIDTH))
/*@}*/

/*!
 * @name Register ENC_TST, field TCE[14] (RW)
 *
 * This bit connects the test counter to inputs of the quadrature decoder module.
 *
 * Values:
 * - 0b0 - Test count is not enabled
 * - 0b1 - Test count is enabled
 */
/*@{*/
/*! @brief Read current value of the ENC_TST_TCE field. */
#define ENC_RD_TST_TCE(base) ((ENC_TST_REG(base) & ENC_TST_TCE_MASK) >> ENC_TST_TCE_SHIFT)
#define ENC_BRD_TST_TCE(base) (BME_UBFX16(&ENC_TST_REG(base), ENC_TST_TCE_SHIFT, ENC_TST_TCE_WIDTH))

/*! @brief Set the TCE field to a new value. */
#define ENC_WR_TST_TCE(base, value) (ENC_RMW_TST(base, ENC_TST_TCE_MASK, ENC_TST_TCE(value)))
#define ENC_BWR_TST_TCE(base, value) (BME_BFI16(&ENC_TST_REG(base), ((uint16_t)(value) << ENC_TST_TCE_SHIFT), ENC_TST_TCE_SHIFT, ENC_TST_TCE_WIDTH))
/*@}*/

/*!
 * @name Register ENC_TST, field TEN[15] (RW)
 *
 * This bit connects the test module to inputs of the quadrature decoder module.
 *
 * Values:
 * - 0b0 - Test module is not enabled
 * - 0b1 - Test module is enabled
 */
/*@{*/
/*! @brief Read current value of the ENC_TST_TEN field. */
#define ENC_RD_TST_TEN(base) ((ENC_TST_REG(base) & ENC_TST_TEN_MASK) >> ENC_TST_TEN_SHIFT)
#define ENC_BRD_TST_TEN(base) (BME_UBFX16(&ENC_TST_REG(base), ENC_TST_TEN_SHIFT, ENC_TST_TEN_WIDTH))

/*! @brief Set the TEN field to a new value. */
#define ENC_WR_TST_TEN(base, value) (ENC_RMW_TST(base, ENC_TST_TEN_MASK, ENC_TST_TEN(value)))
#define ENC_BWR_TST_TEN(base, value) (BME_BFI16(&ENC_TST_REG(base), ((uint16_t)(value) << ENC_TST_TEN_SHIFT), ENC_TST_TEN_SHIFT, ENC_TST_TEN_WIDTH))
/*@}*/

/*******************************************************************************
 * ENC_CTRL2 - Control 2 Register
 ******************************************************************************/

/*!
 * @brief ENC_CTRL2 - Control 2 Register (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire ENC_CTRL2 register
 */
/*@{*/
#define ENC_RD_CTRL2(base)       (ENC_CTRL2_REG(base))
#define ENC_WR_CTRL2(base, value) (ENC_CTRL2_REG(base) = (value))
#define ENC_RMW_CTRL2(base, mask, value) (ENC_WR_CTRL2(base, (ENC_RD_CTRL2(base) & ~(mask)) | (value)))
#define ENC_SET_CTRL2(base, value) (BME_OR16(&ENC_CTRL2_REG(base), (uint16_t)(value)))
#define ENC_CLR_CTRL2(base, value) (BME_AND16(&ENC_CTRL2_REG(base), (uint16_t)(~(value))))
#define ENC_TOG_CTRL2(base, value) (BME_XOR16(&ENC_CTRL2_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual ENC_CTRL2 bitfields
 */

/*!
 * @name Register ENC_CTRL2, field UPDHLD[0] (RW)
 *
 * When set, this bit allows the TRIGGER input to cause an update of the POSDH,
 * REVH, UPOSH, and LPOSH registers. When clear, the hold registers are not
 * updated by the TRIGGER input. Updating the POSDH register will also cause the POSD
 * register to be cleared.
 *
 * Values:
 * - 0b0 - Disable updates of hold registers on rising edge of TRIGGER
 * - 0b1 - Enable updates of hold registers on rising edge of TRIGGER
 */
/*@{*/
/*! @brief Read current value of the ENC_CTRL2_UPDHLD field. */
#define ENC_RD_CTRL2_UPDHLD(base) ((ENC_CTRL2_REG(base) & ENC_CTRL2_UPDHLD_MASK) >> ENC_CTRL2_UPDHLD_SHIFT)
#define ENC_BRD_CTRL2_UPDHLD(base) (BME_UBFX16(&ENC_CTRL2_REG(base), ENC_CTRL2_UPDHLD_SHIFT, ENC_CTRL2_UPDHLD_WIDTH))

/*! @brief Set the UPDHLD field to a new value. */
#define ENC_WR_CTRL2_UPDHLD(base, value) (ENC_RMW_CTRL2(base, (ENC_CTRL2_UPDHLD_MASK | ENC_CTRL2_RUIRQ_MASK | ENC_CTRL2_ROIRQ_MASK | ENC_CTRL2_SABIRQ_MASK), ENC_CTRL2_UPDHLD(value)))
#define ENC_BWR_CTRL2_UPDHLD(base, value) (BME_BFI16(&ENC_CTRL2_REG(base), ((uint16_t)(value) << ENC_CTRL2_UPDHLD_SHIFT), ENC_CTRL2_UPDHLD_SHIFT, ENC_CTRL2_UPDHLD_WIDTH))
/*@}*/

/*!
 * @name Register ENC_CTRL2, field UPDPOS[1] (RW)
 *
 * When set, this bit allows the TRIGGER input to clear the POSD, REV, UPOS and
 * LPOS registers. When clear, the POSD, REV, UPOS and LPOS registers ignore the
 * TRIGGER input.
 *
 * Values:
 * - 0b0 - No action for POSD, REV, UPOS and LPOS on rising edge of TRIGGER
 * - 0b1 - Clear POSD, REV, UPOS and LPOS on rising edge of TRIGGER
 */
/*@{*/
/*! @brief Read current value of the ENC_CTRL2_UPDPOS field. */
#define ENC_RD_CTRL2_UPDPOS(base) ((ENC_CTRL2_REG(base) & ENC_CTRL2_UPDPOS_MASK) >> ENC_CTRL2_UPDPOS_SHIFT)
#define ENC_BRD_CTRL2_UPDPOS(base) (BME_UBFX16(&ENC_CTRL2_REG(base), ENC_CTRL2_UPDPOS_SHIFT, ENC_CTRL2_UPDPOS_WIDTH))

/*! @brief Set the UPDPOS field to a new value. */
#define ENC_WR_CTRL2_UPDPOS(base, value) (ENC_RMW_CTRL2(base, (ENC_CTRL2_UPDPOS_MASK | ENC_CTRL2_RUIRQ_MASK | ENC_CTRL2_ROIRQ_MASK | ENC_CTRL2_SABIRQ_MASK), ENC_CTRL2_UPDPOS(value)))
#define ENC_BWR_CTRL2_UPDPOS(base, value) (BME_BFI16(&ENC_CTRL2_REG(base), ((uint16_t)(value) << ENC_CTRL2_UPDPOS_SHIFT), ENC_CTRL2_UPDPOS_SHIFT, ENC_CTRL2_UPDPOS_WIDTH))
/*@}*/

/*!
 * @name Register ENC_CTRL2, field MOD[2] (RW)
 *
 * When set, this bit allows the position counters (UPOS and LPOS) to count in a
 * modulo fashion using MOD and INIT as the upper and lower bounds of the
 * counting range. During modulo counting when a count up is indicated and the position
 * counter is equal to MOD, then the postion counter will be reloaded with the
 * value of INIT. When a count down is indicated and the position counter is equal
 * to INIT, then the position counter will be reloaded with the value of MOD.
 * When clear, then the values of MOD and INIT are ignored and the position counter
 * wraps to zero when counting up from 0xffffffff and wraps to 0xffffffff when
 * counting down from 0.
 *
 * Values:
 * - 0b0 - Disable modulo counting
 * - 0b1 - Enable modulo counting
 */
/*@{*/
/*! @brief Read current value of the ENC_CTRL2_MOD field. */
#define ENC_RD_CTRL2_MOD(base) ((ENC_CTRL2_REG(base) & ENC_CTRL2_MOD_MASK) >> ENC_CTRL2_MOD_SHIFT)
#define ENC_BRD_CTRL2_MOD(base) (BME_UBFX16(&ENC_CTRL2_REG(base), ENC_CTRL2_MOD_SHIFT, ENC_CTRL2_MOD_WIDTH))

/*! @brief Set the MOD field to a new value. */
#define ENC_WR_CTRL2_MOD(base, value) (ENC_RMW_CTRL2(base, (ENC_CTRL2_MOD_MASK | ENC_CTRL2_RUIRQ_MASK | ENC_CTRL2_ROIRQ_MASK | ENC_CTRL2_SABIRQ_MASK), ENC_CTRL2_MOD(value)))
#define ENC_BWR_CTRL2_MOD(base, value) (BME_BFI16(&ENC_CTRL2_REG(base), ((uint16_t)(value) << ENC_CTRL2_MOD_SHIFT), ENC_CTRL2_MOD_SHIFT, ENC_CTRL2_MOD_WIDTH))
/*@}*/

/*!
 * @name Register ENC_CTRL2, field DIR[3] (RO)
 *
 * This read-only flag is used to indicate the direction of the last count.
 *
 * Values:
 * - 0b0 - Last count was in the down direction
 * - 0b1 - Last count was in the up direction
 */
/*@{*/
/*! @brief Read current value of the ENC_CTRL2_DIR field. */
#define ENC_RD_CTRL2_DIR(base) ((ENC_CTRL2_REG(base) & ENC_CTRL2_DIR_MASK) >> ENC_CTRL2_DIR_SHIFT)
#define ENC_BRD_CTRL2_DIR(base) (BME_UBFX16(&ENC_CTRL2_REG(base), ENC_CTRL2_DIR_SHIFT, ENC_CTRL2_DIR_WIDTH))
/*@}*/

/*!
 * @name Register ENC_CTRL2, field RUIE[4] (RW)
 *
 * This read/write bit enables roll-under interrupts based on CTRL2[RUIRQ] being
 * set. This interrupt is combined with the index interrupt signal.
 *
 * Values:
 * - 0b0 - Roll-under interrupt is disabled
 * - 0b1 - Roll-under interrupt is enabled
 */
/*@{*/
/*! @brief Read current value of the ENC_CTRL2_RUIE field. */
#define ENC_RD_CTRL2_RUIE(base) ((ENC_CTRL2_REG(base) & ENC_CTRL2_RUIE_MASK) >> ENC_CTRL2_RUIE_SHIFT)
#define ENC_BRD_CTRL2_RUIE(base) (BME_UBFX16(&ENC_CTRL2_REG(base), ENC_CTRL2_RUIE_SHIFT, ENC_CTRL2_RUIE_WIDTH))

/*! @brief Set the RUIE field to a new value. */
#define ENC_WR_CTRL2_RUIE(base, value) (ENC_RMW_CTRL2(base, (ENC_CTRL2_RUIE_MASK | ENC_CTRL2_RUIRQ_MASK | ENC_CTRL2_ROIRQ_MASK | ENC_CTRL2_SABIRQ_MASK), ENC_CTRL2_RUIE(value)))
#define ENC_BWR_CTRL2_RUIE(base, value) (BME_BFI16(&ENC_CTRL2_REG(base), ((uint16_t)(value) << ENC_CTRL2_RUIE_SHIFT), ENC_CTRL2_RUIE_SHIFT, ENC_CTRL2_RUIE_WIDTH))
/*@}*/

/*!
 * @name Register ENC_CTRL2, field RUIRQ[5] (W1C)
 *
 * This bit is set when the position counter (POS) rolls under from the INIT
 * value to the MOD value or from 0x00000000 to 0xffffffff. It will remain set until
 * cleared by software. Write a one to this bit to clear.
 *
 * Values:
 * - 0b0 - No roll-under has occurred
 * - 0b1 - Roll-under has occurred
 */
/*@{*/
/*! @brief Read current value of the ENC_CTRL2_RUIRQ field. */
#define ENC_RD_CTRL2_RUIRQ(base) ((ENC_CTRL2_REG(base) & ENC_CTRL2_RUIRQ_MASK) >> ENC_CTRL2_RUIRQ_SHIFT)
#define ENC_BRD_CTRL2_RUIRQ(base) (BME_UBFX16(&ENC_CTRL2_REG(base), ENC_CTRL2_RUIRQ_SHIFT, ENC_CTRL2_RUIRQ_WIDTH))

