ErichStyger/mcuoneclipse/Examples/KDS/TWR-KV58F220M/TWR_KV58F220M_PEx_2_SDKv2/SDK/platform/devices/MKV58F24/include/MKV58F24_extension.h
/*! @brief Set the RUIRQ field to a new value. */
#define ENC_WR_CTRL2_RUIRQ(base, value) (ENC_RMW_CTRL2(base, (ENC_CTRL2_RUIRQ_MASK | ENC_CTRL2_ROIRQ_MASK | ENC_CTRL2_SABIRQ_MASK), ENC_CTRL2_RUIRQ(value)))
#define ENC_BWR_CTRL2_RUIRQ(base, value) (BME_BFI16(&ENC_CTRL2_REG(base), ((uint16_t)(value) << ENC_CTRL2_RUIRQ_SHIFT), ENC_CTRL2_RUIRQ_SHIFT, ENC_CTRL2_RUIRQ_WIDTH))
/*@}*/

/*!
 * @name Register ENC_CTRL2, field ROIE[6] (RW)
 *
 * This read/write bit enables roll-over interrupts based on CTRL2[ROIRQ] being
 * set. This interrupt is combined with the index interrupt signal.
 *
 * Values:
 * - 0b0 - Roll-over interrupt is disabled
 * - 0b1 - Roll-over interrupt is enabled
 */
/*@{*/
/*! @brief Read current value of the ENC_CTRL2_ROIE field. */
#define ENC_RD_CTRL2_ROIE(base) ((ENC_CTRL2_REG(base) & ENC_CTRL2_ROIE_MASK) >> ENC_CTRL2_ROIE_SHIFT)
#define ENC_BRD_CTRL2_ROIE(base) (BME_UBFX16(&ENC_CTRL2_REG(base), ENC_CTRL2_ROIE_SHIFT, ENC_CTRL2_ROIE_WIDTH))

/*! @brief Set the ROIE field to a new value. */
#define ENC_WR_CTRL2_ROIE(base, value) (ENC_RMW_CTRL2(base, (ENC_CTRL2_ROIE_MASK | ENC_CTRL2_RUIRQ_MASK | ENC_CTRL2_ROIRQ_MASK | ENC_CTRL2_SABIRQ_MASK), ENC_CTRL2_ROIE(value)))
#define ENC_BWR_CTRL2_ROIE(base, value) (BME_BFI16(&ENC_CTRL2_REG(base), ((uint16_t)(value) << ENC_CTRL2_ROIE_SHIFT), ENC_CTRL2_ROIE_SHIFT, ENC_CTRL2_ROIE_WIDTH))
/*@}*/

/*!
 * @name Register ENC_CTRL2, field ROIRQ[7] (W1C)
 *
 * This bit is set when the position counter (POS) rolls over from the MOD value
 * to the INIT value or from 0xffffffff to 0x00000000. It will remain set until
 * cleared by software. Write a one to this bit to clear.
 *
 * Values:
 * - 0b0 - No roll-over has occurred
 * - 0b1 - Roll-over has occurred
 */
/*@{*/
/*! @brief Read current value of the ENC_CTRL2_ROIRQ field. */
#define ENC_RD_CTRL2_ROIRQ(base) ((ENC_CTRL2_REG(base) & ENC_CTRL2_ROIRQ_MASK) >> ENC_CTRL2_ROIRQ_SHIFT)
#define ENC_BRD_CTRL2_ROIRQ(base) (BME_UBFX16(&ENC_CTRL2_REG(base), ENC_CTRL2_ROIRQ_SHIFT, ENC_CTRL2_ROIRQ_WIDTH))

/*! @brief Set the ROIRQ field to a new value. */
#define ENC_WR_CTRL2_ROIRQ(base, value) (ENC_RMW_CTRL2(base, (ENC_CTRL2_ROIRQ_MASK | ENC_CTRL2_RUIRQ_MASK | ENC_CTRL2_SABIRQ_MASK), ENC_CTRL2_ROIRQ(value)))
#define ENC_BWR_CTRL2_ROIRQ(base, value) (BME_BFI16(&ENC_CTRL2_REG(base), ((uint16_t)(value) << ENC_CTRL2_ROIRQ_SHIFT), ENC_CTRL2_ROIRQ_SHIFT, ENC_CTRL2_ROIRQ_WIDTH))
/*@}*/

/*!
 * @name Register ENC_CTRL2, field REVMOD[8] (RW)
 *
 * This bit is used to determine how the revolution counter (REV) is
 * incremented/decremented. By default REV is controlled based on the count direction and
 * the INDEX pulse. As an option, REV can be controlled using the roll-over/under
 * detection during modulo counting.
 *
 * Values:
 * - 0b0 - Use INDEX pulse to increment/decrement revolution counter (REV).
 * - 0b1 - Use modulus counting roll-over/under to increment/decrement
 *     revolution counter (REV).
 */
/*@{*/
/*! @brief Read current value of the ENC_CTRL2_REVMOD field. */
#define ENC_RD_CTRL2_REVMOD(base) ((ENC_CTRL2_REG(base) & ENC_CTRL2_REVMOD_MASK) >> ENC_CTRL2_REVMOD_SHIFT)
#define ENC_BRD_CTRL2_REVMOD(base) (BME_UBFX16(&ENC_CTRL2_REG(base), ENC_CTRL2_REVMOD_SHIFT, ENC_CTRL2_REVMOD_WIDTH))

/*! @brief Set the REVMOD field to a new value. */
#define ENC_WR_CTRL2_REVMOD(base, value) (ENC_RMW_CTRL2(base, (ENC_CTRL2_REVMOD_MASK | ENC_CTRL2_RUIRQ_MASK | ENC_CTRL2_ROIRQ_MASK | ENC_CTRL2_SABIRQ_MASK), ENC_CTRL2_REVMOD(value)))
#define ENC_BWR_CTRL2_REVMOD(base, value) (BME_BFI16(&ENC_CTRL2_REG(base), ((uint16_t)(value) << ENC_CTRL2_REVMOD_SHIFT), ENC_CTRL2_REVMOD_SHIFT, ENC_CTRL2_REVMOD_WIDTH))
/*@}*/

/*!
 * @name Register ENC_CTRL2, field OUTCTL[9] (RW)
 *
 * This bit is used to control the behavior of the POSMATCH output signal. This
 * can control when a timer channel captures a time stamp.
 *
 * Values:
 * - 0b0 - POSMATCH pulses when a match occurs between the position counters
 *     (POS) and the compare value (COMP).
 * - 0b1 - POSMATCH pulses when the UPOS, LPOS, REV, or POSD registers are read.
 */
/*@{*/
/*! @brief Read current value of the ENC_CTRL2_OUTCTL field. */
#define ENC_RD_CTRL2_OUTCTL(base) ((ENC_CTRL2_REG(base) & ENC_CTRL2_OUTCTL_MASK) >> ENC_CTRL2_OUTCTL_SHIFT)
#define ENC_BRD_CTRL2_OUTCTL(base) (BME_UBFX16(&ENC_CTRL2_REG(base), ENC_CTRL2_OUTCTL_SHIFT, ENC_CTRL2_OUTCTL_WIDTH))

/*! @brief Set the OUTCTL field to a new value. */
#define ENC_WR_CTRL2_OUTCTL(base, value) (ENC_RMW_CTRL2(base, (ENC_CTRL2_OUTCTL_MASK | ENC_CTRL2_RUIRQ_MASK | ENC_CTRL2_ROIRQ_MASK | ENC_CTRL2_SABIRQ_MASK), ENC_CTRL2_OUTCTL(value)))
#define ENC_BWR_CTRL2_OUTCTL(base, value) (BME_BFI16(&ENC_CTRL2_REG(base), ((uint16_t)(value) << ENC_CTRL2_OUTCTL_SHIFT), ENC_CTRL2_OUTCTL_SHIFT, ENC_CTRL2_OUTCTL_WIDTH))
/*@}*/

/*!
 * @name Register ENC_CTRL2, field SABIE[10] (RW)
 *
 * This read/write bit enables simultaneous PHASEA and PHASEB change interrupts
 * based on SABIRQ being set.
 *
 * Values:
 * - 0b0 - Simultaneous PHASEA and PHASEB change interrupt disabled.
 * - 0b1 - Simultaneous PHASEA and PHASEB change interrupt enabled.
 */
/*@{*/
/*! @brief Read current value of the ENC_CTRL2_SABIE field. */
#define ENC_RD_CTRL2_SABIE(base) ((ENC_CTRL2_REG(base) & ENC_CTRL2_SABIE_MASK) >> ENC_CTRL2_SABIE_SHIFT)
#define ENC_BRD_CTRL2_SABIE(base) (BME_UBFX16(&ENC_CTRL2_REG(base), ENC_CTRL2_SABIE_SHIFT, ENC_CTRL2_SABIE_WIDTH))

/*! @brief Set the SABIE field to a new value. */
#define ENC_WR_CTRL2_SABIE(base, value) (ENC_RMW_CTRL2(base, (ENC_CTRL2_SABIE_MASK | ENC_CTRL2_RUIRQ_MASK | ENC_CTRL2_ROIRQ_MASK | ENC_CTRL2_SABIRQ_MASK), ENC_CTRL2_SABIE(value)))
#define ENC_BWR_CTRL2_SABIE(base, value) (BME_BFI16(&ENC_CTRL2_REG(base), ((uint16_t)(value) << ENC_CTRL2_SABIE_SHIFT), ENC_CTRL2_SABIE_SHIFT, ENC_CTRL2_SABIE_WIDTH))
/*@}*/

/*!
 * @name Register ENC_CTRL2, field SABIRQ[11] (W1C)
 *
 * This bit indicates that the PHASEA and PHASEB inputs changed simultaneously
 * (within a single clock period). This event typically indicates an error
 * condition because quadrature coding requires only one of these inputs to change at a
 * time. The bit remains set until it is cleared by software or a reset. Write 1
 * to this bit to clear it.
 *
 * Values:
 * - 0b0 - No simultaneous change of PHASEA and PHASEB has occurred.
 * - 0b1 - A simultaneous change of PHASEA and PHASEB has occurred.
 */
/*@{*/
/*! @brief Read current value of the ENC_CTRL2_SABIRQ field. */
#define ENC_RD_CTRL2_SABIRQ(base) ((ENC_CTRL2_REG(base) & ENC_CTRL2_SABIRQ_MASK) >> ENC_CTRL2_SABIRQ_SHIFT)
#define ENC_BRD_CTRL2_SABIRQ(base) (BME_UBFX16(&ENC_CTRL2_REG(base), ENC_CTRL2_SABIRQ_SHIFT, ENC_CTRL2_SABIRQ_WIDTH))

/*! @brief Set the SABIRQ field to a new value. */
#define ENC_WR_CTRL2_SABIRQ(base, value) (ENC_RMW_CTRL2(base, (ENC_CTRL2_SABIRQ_MASK | ENC_CTRL2_RUIRQ_MASK | ENC_CTRL2_ROIRQ_MASK), ENC_CTRL2_SABIRQ(value)))
#define ENC_BWR_CTRL2_SABIRQ(base, value) (BME_BFI16(&ENC_CTRL2_REG(base), ((uint16_t)(value) << ENC_CTRL2_SABIRQ_SHIFT), ENC_CTRL2_SABIRQ_SHIFT, ENC_CTRL2_SABIRQ_WIDTH))
/*@}*/

