ErichStyger/mcuoneclipse/Examples/KDS/TWR-KV58F220M/TWR_KV58F220M_PEx_2_SDKv2/SDK/platform/devices/MKV58F24/include/MKV58F24_extension.h
/*******************************************************************************
 * ENET_EIMR - Interrupt Mask Register
 ******************************************************************************/

/*!
 * @brief ENET_EIMR - Interrupt Mask Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * EIMR controls which interrupt events are allowed to generate actual
 * interrupts. A hardware reset clears this register. If the corresponding bits in the EIR
 * and EIMR registers are set, an interrupt is generated. The interrupt signal
 * remains asserted until a 1 is written to the EIR field (write 1 to clear) or a
 * 0 is written to the EIMR field.
 */
/*!
 * @name Constants and macros for entire ENET_EIMR register
 */
/*@{*/
#define ENET_RD_EIMR(base)       (ENET_EIMR_REG(base))
#define ENET_WR_EIMR(base, value) (ENET_EIMR_REG(base) = (value))
#define ENET_RMW_EIMR(base, mask, value) (ENET_WR_EIMR(base, (ENET_RD_EIMR(base) & ~(mask)) | (value)))
#define ENET_SET_EIMR(base, value) (BME_OR32(&ENET_EIMR_REG(base), (uint32_t)(value)))
#define ENET_CLR_EIMR(base, value) (BME_AND32(&ENET_EIMR_REG(base), (uint32_t)(~(value))))
#define ENET_TOG_EIMR(base, value) (BME_XOR32(&ENET_EIMR_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual ENET_EIMR bitfields
 */

/*!
 * @name Register ENET_EIMR, field TS_TIMER[15] (RW)
 *
 * Corresponds to interrupt source EIR[TS_TIMER] register and determines whether
 * an interrupt condition can generate an interrupt. At every module clock, the
 * EIR samples the signal generated by the interrupting source. The corresponding
 * EIR TS_TIMER field reflects the state of the interrupt signal even if the
 * corresponding EIMR field is cleared.
 */
/*@{*/
/*! @brief Read current value of the ENET_EIMR_TS_TIMER field. */
#define ENET_RD_EIMR_TS_TIMER(base) ((ENET_EIMR_REG(base) & ENET_EIMR_TS_TIMER_MASK) >> ENET_EIMR_TS_TIMER_SHIFT)
#define ENET_BRD_EIMR_TS_TIMER(base) (BME_UBFX32(&ENET_EIMR_REG(base), ENET_EIMR_TS_TIMER_SHIFT, ENET_EIMR_TS_TIMER_WIDTH))

/*! @brief Set the TS_TIMER field to a new value. */
#define ENET_WR_EIMR_TS_TIMER(base, value) (ENET_RMW_EIMR(base, ENET_EIMR_TS_TIMER_MASK, ENET_EIMR_TS_TIMER(value)))
#define ENET_BWR_EIMR_TS_TIMER(base, value) (BME_BFI32(&ENET_EIMR_REG(base), ((uint32_t)(value) << ENET_EIMR_TS_TIMER_SHIFT), ENET_EIMR_TS_TIMER_SHIFT, ENET_EIMR_TS_TIMER_WIDTH))
/*@}*/

/*!
 * @name Register ENET_EIMR, field TS_AVAIL[16] (RW)
 *
 * Corresponds to interrupt source EIR[TS_AVAIL] register and determines whether
 * an interrupt condition can generate an interrupt. At every module clock, the
 * EIR samples the signal generated by the interrupting source. The corresponding
 * EIR TS_AVAIL field reflects the state of the interrupt signal even if the
 * corresponding EIMR field is cleared.
 */
/*@{*/
/*! @brief Read current value of the ENET_EIMR_TS_AVAIL field. */
#define ENET_RD_EIMR_TS_AVAIL(base) ((ENET_EIMR_REG(base) & ENET_EIMR_TS_AVAIL_MASK) >> ENET_EIMR_TS_AVAIL_SHIFT)
#define ENET_BRD_EIMR_TS_AVAIL(base) (BME_UBFX32(&ENET_EIMR_REG(base), ENET_EIMR_TS_AVAIL_SHIFT, ENET_EIMR_TS_AVAIL_WIDTH))

/*! @brief Set the TS_AVAIL field to a new value. */
#define ENET_WR_EIMR_TS_AVAIL(base, value) (ENET_RMW_EIMR(base, ENET_EIMR_TS_AVAIL_MASK, ENET_EIMR_TS_AVAIL(value)))
#define ENET_BWR_EIMR_TS_AVAIL(base, value) (BME_BFI32(&ENET_EIMR_REG(base), ((uint32_t)(value) << ENET_EIMR_TS_AVAIL_SHIFT), ENET_EIMR_TS_AVAIL_SHIFT, ENET_EIMR_TS_AVAIL_WIDTH))
/*@}*/

/*!
 * @name Register ENET_EIMR, field WAKEUP[17] (RW)
 *
 * Corresponds to interrupt source EIR[WAKEUP] register and determines whether
 * an interrupt condition can generate an interrupt. At every module clock, the
 * EIR samples the signal generated by the interrupting source. The corresponding
 * EIR WAKEUP field reflects the state of the interrupt signal even if the
 * corresponding EIMR field is cleared.
 */
/*@{*/
/*! @brief Read current value of the ENET_EIMR_WAKEUP field. */
#define ENET_RD_EIMR_WAKEUP(base) ((ENET_EIMR_REG(base) & ENET_EIMR_WAKEUP_MASK) >> ENET_EIMR_WAKEUP_SHIFT)
#define ENET_BRD_EIMR_WAKEUP(base) (BME_UBFX32(&ENET_EIMR_REG(base), ENET_EIMR_WAKEUP_SHIFT, ENET_EIMR_WAKEUP_WIDTH))

/*! @brief Set the WAKEUP field to a new value. */
#define ENET_WR_EIMR_WAKEUP(base, value) (ENET_RMW_EIMR(base, ENET_EIMR_WAKEUP_MASK, ENET_EIMR_WAKEUP(value)))
#define ENET_BWR_EIMR_WAKEUP(base, value) (BME_BFI32(&ENET_EIMR_REG(base), ((uint32_t)(value) << ENET_EIMR_WAKEUP_SHIFT), ENET_EIMR_WAKEUP_SHIFT, ENET_EIMR_WAKEUP_WIDTH))
/*@}*/

/*!
 * @name Register ENET_EIMR, field PLR[18] (RW)
 *
 * Corresponds to interrupt source EIR[PLR] and determines whether an interrupt
 * condition can generate an interrupt. At every module clock, the EIR samples
 * the signal generated by the interrupting source. The corresponding EIR PLR field
 * reflects the state of the interrupt signal even if the corresponding EIMR
 * field is cleared.
 */
/*@{*/
/*! @brief Read current value of the ENET_EIMR_PLR field. */
#define ENET_RD_EIMR_PLR(base) ((ENET_EIMR_REG(base) & ENET_EIMR_PLR_MASK) >> ENET_EIMR_PLR_SHIFT)
#define ENET_BRD_EIMR_PLR(base) (BME_UBFX32(&ENET_EIMR_REG(base), ENET_EIMR_PLR_SHIFT, ENET_EIMR_PLR_WIDTH))

/*! @brief Set the PLR field to a new value. */
#define ENET_WR_EIMR_PLR(base, value) (ENET_RMW_EIMR(base, ENET_EIMR_PLR_MASK, ENET_EIMR_PLR(value)))
#define ENET_BWR_EIMR_PLR(base, value) (BME_BFI32(&ENET_EIMR_REG(base), ((uint32_t)(value) << ENET_EIMR_PLR_SHIFT), ENET_EIMR_PLR_SHIFT, ENET_EIMR_PLR_WIDTH))
/*@}*/

/*!
 * @name Register ENET_EIMR, field UN[19] (RW)
 *
 * Corresponds to interrupt source EIR[UN] and determines whether an interrupt
 * condition can generate an interrupt. At every module clock, the EIR samples the
 * signal generated by the interrupting source. The corresponding EIR UN field
 * reflects the state of the interrupt signal even if the corresponding EIMR field
 * is cleared.
 */
/*@{*/
/*! @brief Read current value of the ENET_EIMR_UN field. */
#define ENET_RD_EIMR_UN(base) ((ENET_EIMR_REG(base) & ENET_EIMR_UN_MASK) >> ENET_EIMR_UN_SHIFT)
#define ENET_BRD_EIMR_UN(base) (BME_UBFX32(&ENET_EIMR_REG(base), ENET_EIMR_UN_SHIFT, ENET_EIMR_UN_WIDTH))

/*! @brief Set the UN field to a new value. */
#define ENET_WR_EIMR_UN(base, value) (ENET_RMW_EIMR(base, ENET_EIMR_UN_MASK, ENET_EIMR_UN(value)))
#define ENET_BWR_EIMR_UN(base, value) (BME_BFI32(&ENET_EIMR_REG(base), ((uint32_t)(value) << ENET_EIMR_UN_SHIFT), ENET_EIMR_UN_SHIFT, ENET_EIMR_UN_WIDTH))
/*@}*/

/*!
 * @name Register ENET_EIMR, field RL[20] (RW)
 *
 * Corresponds to interrupt source EIR[RL] and determines whether an interrupt
 * condition can generate an interrupt. At every module clock, the EIR samples the
 * signal generated by the interrupting source. The corresponding EIR RL field
 * reflects the state of the interrupt signal even if the corresponding EIMR field
 * is cleared.
 */
/*@{*/
/*! @brief Read current value of the ENET_EIMR_RL field. */
#define ENET_RD_EIMR_RL(base) ((ENET_EIMR_REG(base) & ENET_EIMR_RL_MASK) >> ENET_EIMR_RL_SHIFT)
#define ENET_BRD_EIMR_RL(base) (BME_UBFX32(&ENET_EIMR_REG(base), ENET_EIMR_RL_SHIFT, ENET_EIMR_RL_WIDTH))

/*! @brief Set the RL field to a new value. */
#define ENET_WR_EIMR_RL(base, value) (ENET_RMW_EIMR(base, ENET_EIMR_RL_MASK, ENET_EIMR_RL(value)))
#define ENET_BWR_EIMR_RL(base, value) (BME_BFI32(&ENET_EIMR_REG(base), ((uint32_t)(value) << ENET_EIMR_RL_SHIFT), ENET_EIMR_RL_SHIFT, ENET_EIMR_RL_WIDTH))
/*@}*/

/*!
 * @name Register ENET_EIMR, field LC[21] (RW)
 *
 * Corresponds to interrupt source EIR[LC] and determines whether an interrupt
 * condition can generate an interrupt. At every module clock, the EIR samples the
 * signal generated by the interrupting source. The corresponding EIR LC field
 * reflects the state of the interrupt signal even if the corresponding EIMR field
 * is cleared.
 */
/*@{*/
/*! @brief Read current value of the ENET_EIMR_LC field. */
#define ENET_RD_EIMR_LC(base) ((ENET_EIMR_REG(base) & ENET_EIMR_LC_MASK) >> ENET_EIMR_LC_SHIFT)
#define ENET_BRD_EIMR_LC(base) (BME_UBFX32(&ENET_EIMR_REG(base), ENET_EIMR_LC_SHIFT, ENET_EIMR_LC_WIDTH))

