ErichStyger/mcuoneclipse/Examples/KDS/TWR-KV58F220M/TWR_KV58F220M_PEx_2_SDKv2/SDK/platform/devices/MKV58F24/include/MKV58F24_extension.h
/*******************************************************************************
 * ENET_RDSR - Receive Descriptor Ring Start Register
 ******************************************************************************/

/*!
 * @brief ENET_RDSR - Receive Descriptor Ring Start Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * RDSR points to the beginning of the circular receive buffer descriptor queue
 * in external memory. This pointer must be 64-bit aligned (bits 2-0 must be
 * zero); however, it is recommended to be 128-bit aligned, that is, evenly divisible
 * by 16. This register must be initialized prior to operation
 */
/*!
 * @name Constants and macros for entire ENET_RDSR register
 */
/*@{*/
#define ENET_RD_RDSR(base)       (ENET_RDSR_REG(base))
#define ENET_WR_RDSR(base, value) (ENET_RDSR_REG(base) = (value))
#define ENET_RMW_RDSR(base, mask, value) (ENET_WR_RDSR(base, (ENET_RD_RDSR(base) & ~(mask)) | (value)))
#define ENET_SET_RDSR(base, value) (BME_OR32(&ENET_RDSR_REG(base), (uint32_t)(value)))
#define ENET_CLR_RDSR(base, value) (BME_AND32(&ENET_RDSR_REG(base), (uint32_t)(~(value))))
#define ENET_TOG_RDSR(base, value) (BME_XOR32(&ENET_RDSR_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual ENET_RDSR bitfields
 */

/*!
 * @name Register ENET_RDSR, field R_DES_START[31:3] (RW)
 *
 * Pointer to the beginning of the receive buffer descriptor queue.
 */
/*@{*/
/*! @brief Read current value of the ENET_RDSR_R_DES_START field. */
#define ENET_RD_RDSR_R_DES_START(base) ((ENET_RDSR_REG(base) & ENET_RDSR_R_DES_START_MASK) >> ENET_RDSR_R_DES_START_SHIFT)
#define ENET_BRD_RDSR_R_DES_START(base) (ENET_RD_RDSR_R_DES_START(base))

/*! @brief Set the R_DES_START field to a new value. */
#define ENET_WR_RDSR_R_DES_START(base, value) (ENET_RMW_RDSR(base, ENET_RDSR_R_DES_START_MASK, ENET_RDSR_R_DES_START(value)))
#define ENET_BWR_RDSR_R_DES_START(base, value) (ENET_WR_RDSR_R_DES_START(base, value))
/*@}*/

/*******************************************************************************
 * ENET_TDSR - Transmit Buffer Descriptor Ring Start Register
 ******************************************************************************/

/*!
 * @brief ENET_TDSR - Transmit Buffer Descriptor Ring Start Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * TDSR provides a pointer to the beginning of the circular transmit buffer
 * descriptor queue in external memory. This pointer must be 64-bit aligned (bits 2-0
 * must be zero); however, it is recommended to be 128-bit aligned, that is,
 * evenly divisible by 16. This register must be initialized prior to operation.
 */
/*!
 * @name Constants and macros for entire ENET_TDSR register
 */
/*@{*/
#define ENET_RD_TDSR(base)       (ENET_TDSR_REG(base))
#define ENET_WR_TDSR(base, value) (ENET_TDSR_REG(base) = (value))
#define ENET_RMW_TDSR(base, mask, value) (ENET_WR_TDSR(base, (ENET_RD_TDSR(base) & ~(mask)) | (value)))
#define ENET_SET_TDSR(base, value) (BME_OR32(&ENET_TDSR_REG(base), (uint32_t)(value)))
#define ENET_CLR_TDSR(base, value) (BME_AND32(&ENET_TDSR_REG(base), (uint32_t)(~(value))))
#define ENET_TOG_TDSR(base, value) (BME_XOR32(&ENET_TDSR_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual ENET_TDSR bitfields
 */

/*!
 * @name Register ENET_TDSR, field X_DES_START[31:3] (RW)
 *
 * Pointer to the beginning of the transmit buffer descriptor queue.
 */
/*@{*/
/*! @brief Read current value of the ENET_TDSR_X_DES_START field. */
#define ENET_RD_TDSR_X_DES_START(base) ((ENET_TDSR_REG(base) & ENET_TDSR_X_DES_START_MASK) >> ENET_TDSR_X_DES_START_SHIFT)
#define ENET_BRD_TDSR_X_DES_START(base) (ENET_RD_TDSR_X_DES_START(base))

/*! @brief Set the X_DES_START field to a new value. */
#define ENET_WR_TDSR_X_DES_START(base, value) (ENET_RMW_TDSR(base, ENET_TDSR_X_DES_START_MASK, ENET_TDSR_X_DES_START(value)))
#define ENET_BWR_TDSR_X_DES_START(base, value) (ENET_WR_TDSR_X_DES_START(base, value))
/*@}*/

/*******************************************************************************
 * ENET_MRBR - Maximum Receive Buffer Size Register
 ******************************************************************************/

/*!
 * @brief ENET_MRBR - Maximum Receive Buffer Size Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The MRBR is a user-programmable register that dictates the maximum size of
 * all receive buffers. This value should take into consideration that the receive
 * CRC is always written into the last receive buffer. R_BUF_SIZE is
 * concatentated with the four least-significant bits of this register and are used as the
 * maximum receive buffer size. To allow one maximum size frame per buffer, MRBR
 * must be set to RCR[MAX_FL] or larger. To properly align the buffer, MRBR must be
 * evenly divisible by 16. To ensure this, the lower four bits are set to zero
 * by the device. To minimize bus usage (descriptor fetches), set MRBR greater
 * than or equal to 256 bytes. This register must be initialized before operation.
 */
/*!
 * @name Constants and macros for entire ENET_MRBR register
 */
/*@{*/
#define ENET_RD_MRBR(base)       (ENET_MRBR_REG(base))
#define ENET_WR_MRBR(base, value) (ENET_MRBR_REG(base) = (value))
#define ENET_RMW_MRBR(base, mask, value) (ENET_WR_MRBR(base, (ENET_RD_MRBR(base) & ~(mask)) | (value)))
#define ENET_SET_MRBR(base, value) (BME_OR32(&ENET_MRBR_REG(base), (uint32_t)(value)))
#define ENET_CLR_MRBR(base, value) (BME_AND32(&ENET_MRBR_REG(base), (uint32_t)(~(value))))
#define ENET_TOG_MRBR(base, value) (BME_XOR32(&ENET_MRBR_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual ENET_MRBR bitfields
 */

/*!
 * @name Register ENET_MRBR, field R_BUF_SIZE[10:4] (RW)
 *
 * Receive buffer size in bytes. This value, concatenated with the four
 * least-significant bits of this register (which are always zero), is the effective
 * maximum receive buffer size.
 */
/*@{*/
/*! @brief Read current value of the ENET_MRBR_R_BUF_SIZE field. */
#define ENET_RD_MRBR_R_BUF_SIZE(base) ((ENET_MRBR_REG(base) & ENET_MRBR_R_BUF_SIZE_MASK) >> ENET_MRBR_R_BUF_SIZE_SHIFT)
#define ENET_BRD_MRBR_R_BUF_SIZE(base) (BME_UBFX32(&ENET_MRBR_REG(base), ENET_MRBR_R_BUF_SIZE_SHIFT, ENET_MRBR_R_BUF_SIZE_WIDTH))

/*! @brief Set the R_BUF_SIZE field to a new value. */
#define ENET_WR_MRBR_R_BUF_SIZE(base, value) (ENET_RMW_MRBR(base, ENET_MRBR_R_BUF_SIZE_MASK, ENET_MRBR_R_BUF_SIZE(value)))
#define ENET_BWR_MRBR_R_BUF_SIZE(base, value) (BME_BFI32(&ENET_MRBR_REG(base), ((uint32_t)(value) << ENET_MRBR_R_BUF_SIZE_SHIFT), ENET_MRBR_R_BUF_SIZE_SHIFT, ENET_MRBR_R_BUF_SIZE_WIDTH))
/*@}*/

