ErichStyger/mcuoneclipse/Examples/KDS/TWR-KV58F220M/TWR_KV58F220M_PEx_2_SDKv2/SDK/platform/devices/MKV58F24/include/MKV58F24_extension.h
/*******************************************************************************
 * ENET_RSFL - Receive FIFO Section Full Threshold
 ******************************************************************************/

/*!
 * @brief ENET_RSFL - Receive FIFO Section Full Threshold (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire ENET_RSFL register
 */
/*@{*/
#define ENET_RD_RSFL(base)       (ENET_RSFL_REG(base))
#define ENET_WR_RSFL(base, value) (ENET_RSFL_REG(base) = (value))
#define ENET_RMW_RSFL(base, mask, value) (ENET_WR_RSFL(base, (ENET_RD_RSFL(base) & ~(mask)) | (value)))
#define ENET_SET_RSFL(base, value) (BME_OR32(&ENET_RSFL_REG(base), (uint32_t)(value)))
#define ENET_CLR_RSFL(base, value) (BME_AND32(&ENET_RSFL_REG(base), (uint32_t)(~(value))))
#define ENET_TOG_RSFL(base, value) (BME_XOR32(&ENET_RSFL_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual ENET_RSFL bitfields
 */

/*!
 * @name Register ENET_RSFL, field RX_SECTION_FULL[7:0] (RW)
 *
 * Value, in 64-bit words, of the receive FIFO section full threshold. Clear
 * this field to enable store and forward on the RX FIFO. When programming a value
 * greater than 0 (cut-through operation), it must be greater than
 * RAEM[RX_ALMOST_EMPTY]. When the FIFO level reaches the value in this field, data is available
 * in the Receive FIFO (cut-through operation).
 */
/*@{*/
/*! @brief Read current value of the ENET_RSFL_RX_SECTION_FULL field. */
#define ENET_RD_RSFL_RX_SECTION_FULL(base) ((ENET_RSFL_REG(base) & ENET_RSFL_RX_SECTION_FULL_MASK) >> ENET_RSFL_RX_SECTION_FULL_SHIFT)
#define ENET_BRD_RSFL_RX_SECTION_FULL(base) (BME_UBFX32(&ENET_RSFL_REG(base), ENET_RSFL_RX_SECTION_FULL_SHIFT, ENET_RSFL_RX_SECTION_FULL_WIDTH))

/*! @brief Set the RX_SECTION_FULL field to a new value. */
#define ENET_WR_RSFL_RX_SECTION_FULL(base, value) (ENET_RMW_RSFL(base, ENET_RSFL_RX_SECTION_FULL_MASK, ENET_RSFL_RX_SECTION_FULL(value)))
#define ENET_BWR_RSFL_RX_SECTION_FULL(base, value) (BME_BFI32(&ENET_RSFL_REG(base), ((uint32_t)(value) << ENET_RSFL_RX_SECTION_FULL_SHIFT), ENET_RSFL_RX_SECTION_FULL_SHIFT, ENET_RSFL_RX_SECTION_FULL_WIDTH))
/*@}*/

/*******************************************************************************
 * ENET_RSEM - Receive FIFO Section Empty Threshold
 ******************************************************************************/

/*!
 * @brief ENET_RSEM - Receive FIFO Section Empty Threshold (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire ENET_RSEM register
 */
/*@{*/
#define ENET_RD_RSEM(base)       (ENET_RSEM_REG(base))
#define ENET_WR_RSEM(base, value) (ENET_RSEM_REG(base) = (value))
#define ENET_RMW_RSEM(base, mask, value) (ENET_WR_RSEM(base, (ENET_RD_RSEM(base) & ~(mask)) | (value)))
#define ENET_SET_RSEM(base, value) (BME_OR32(&ENET_RSEM_REG(base), (uint32_t)(value)))
#define ENET_CLR_RSEM(base, value) (BME_AND32(&ENET_RSEM_REG(base), (uint32_t)(~(value))))
#define ENET_TOG_RSEM(base, value) (BME_XOR32(&ENET_RSEM_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual ENET_RSEM bitfields
 */

/*!
 * @name Register ENET_RSEM, field RX_SECTION_EMPTY[7:0] (RW)
 *
 * Value, in 64-bit words, of the receive FIFO section empty threshold. When the
 * FIFO has reached this level, a pause frame will be issued. A value of 0
 * disables automatic pause frame generation. When the FIFO level goes below the value
 * programmed in this field, an XON pause frame is issued to indicate the FIFO
 * congestion is cleared to the remote Ethernet client. The section-empty
 * threshold indications from both FIFOs are OR'ed to cause XOFF pause frame generation.
 */
/*@{*/
/*! @brief Read current value of the ENET_RSEM_RX_SECTION_EMPTY field. */
#define ENET_RD_RSEM_RX_SECTION_EMPTY(base) ((ENET_RSEM_REG(base) & ENET_RSEM_RX_SECTION_EMPTY_MASK) >> ENET_RSEM_RX_SECTION_EMPTY_SHIFT)
#define ENET_BRD_RSEM_RX_SECTION_EMPTY(base) (BME_UBFX32(&ENET_RSEM_REG(base), ENET_RSEM_RX_SECTION_EMPTY_SHIFT, ENET_RSEM_RX_SECTION_EMPTY_WIDTH))

/*! @brief Set the RX_SECTION_EMPTY field to a new value. */
#define ENET_WR_RSEM_RX_SECTION_EMPTY(base, value) (ENET_RMW_RSEM(base, ENET_RSEM_RX_SECTION_EMPTY_MASK, ENET_RSEM_RX_SECTION_EMPTY(value)))
#define ENET_BWR_RSEM_RX_SECTION_EMPTY(base, value) (BME_BFI32(&ENET_RSEM_REG(base), ((uint32_t)(value) << ENET_RSEM_RX_SECTION_EMPTY_SHIFT), ENET_RSEM_RX_SECTION_EMPTY_SHIFT, ENET_RSEM_RX_SECTION_EMPTY_WIDTH))
/*@}*/

/*!
 * @name Register ENET_RSEM, field STAT_SECTION_EMPTY[20:16] (RW)
 *
 * Defines number of frames in the receive FIFO, independent of its size, that
 * can be accepted. If the limit is reached, reception will continue normally,
 * however a pause frame will be triggered to indicate a possible congestion to the
 * remote device to avoid FIFO overflow. A value of 0 disables automatic pause
 * frame generation
 */
/*@{*/
/*! @brief Read current value of the ENET_RSEM_STAT_SECTION_EMPTY field. */
#define ENET_RD_RSEM_STAT_SECTION_EMPTY(base) ((ENET_RSEM_REG(base) & ENET_RSEM_STAT_SECTION_EMPTY_MASK) >> ENET_RSEM_STAT_SECTION_EMPTY_SHIFT)
#define ENET_BRD_RSEM_STAT_SECTION_EMPTY(base) (BME_UBFX32(&ENET_RSEM_REG(base), ENET_RSEM_STAT_SECTION_EMPTY_SHIFT, ENET_RSEM_STAT_SECTION_EMPTY_WIDTH))

/*! @brief Set the STAT_SECTION_EMPTY field to a new value. */
#define ENET_WR_RSEM_STAT_SECTION_EMPTY(base, value) (ENET_RMW_RSEM(base, ENET_RSEM_STAT_SECTION_EMPTY_MASK, ENET_RSEM_STAT_SECTION_EMPTY(value)))
#define ENET_BWR_RSEM_STAT_SECTION_EMPTY(base, value) (BME_BFI32(&ENET_RSEM_REG(base), ((uint32_t)(value) << ENET_RSEM_STAT_SECTION_EMPTY_SHIFT), ENET_RSEM_STAT_SECTION_EMPTY_SHIFT, ENET_RSEM_STAT_SECTION_EMPTY_WIDTH))
/*@}*/

/*******************************************************************************
 * ENET_RAEM - Receive FIFO Almost Empty Threshold
 ******************************************************************************/

/*!
 * @brief ENET_RAEM - Receive FIFO Almost Empty Threshold (RW)
 *
 * Reset value: 0x00000004U
 */
/*!
 * @name Constants and macros for entire ENET_RAEM register
 */
/*@{*/
#define ENET_RD_RAEM(base)       (ENET_RAEM_REG(base))
#define ENET_WR_RAEM(base, value) (ENET_RAEM_REG(base) = (value))
#define ENET_RMW_RAEM(base, mask, value) (ENET_WR_RAEM(base, (ENET_RD_RAEM(base) & ~(mask)) | (value)))
#define ENET_SET_RAEM(base, value) (BME_OR32(&ENET_RAEM_REG(base), (uint32_t)(value)))
#define ENET_CLR_RAEM(base, value) (BME_AND32(&ENET_RAEM_REG(base), (uint32_t)(~(value))))
#define ENET_TOG_RAEM(base, value) (BME_XOR32(&ENET_RAEM_REG(base), (uint32_t)(value)))
/*@}*/

