ErichStyger/mcuoneclipse/Examples/KDS/TWR-KV58F220M/TWR_KV58F220M_PEx_2_SDKv2/SDK/platform/devices/MKV58F24/include/MKV58F24_extension.h
/*
 * Constants & macros for individual ENET_ATCR bitfields
 */

/*!
 * @name Register ENET_ATCR, field EN[0] (RW)
 *
 * Values:
 * - 0b0 - The timer stops at the current value.
 * - 0b1 - The timer starts incrementing.
 */
/*@{*/
/*! @brief Read current value of the ENET_ATCR_EN field. */
#define ENET_RD_ATCR_EN(base) ((ENET_ATCR_REG(base) & ENET_ATCR_EN_MASK) >> ENET_ATCR_EN_SHIFT)
#define ENET_BRD_ATCR_EN(base) (BME_UBFX32(&ENET_ATCR_REG(base), ENET_ATCR_EN_SHIFT, ENET_ATCR_EN_WIDTH))

/*! @brief Set the EN field to a new value. */
#define ENET_WR_ATCR_EN(base, value) (ENET_RMW_ATCR(base, ENET_ATCR_EN_MASK, ENET_ATCR_EN(value)))
#define ENET_BWR_ATCR_EN(base, value) (BME_BFI32(&ENET_ATCR_REG(base), ((uint32_t)(value) << ENET_ATCR_EN_SHIFT), ENET_ATCR_EN_SHIFT, ENET_ATCR_EN_WIDTH))
/*@}*/

/*!
 * @name Register ENET_ATCR, field OFFEN[2] (RW)
 *
 * Values:
 * - 0b0 - Disable.
 * - 0b1 - The timer can be reset to zero when the given offset time is reached
 *     (offset event). The field is cleared when the offset event is reached, so
 *     no further event occurs until the field is set again. The timer offset
 *     value must be set before setting this field.
 */
/*@{*/
/*! @brief Read current value of the ENET_ATCR_OFFEN field. */
#define ENET_RD_ATCR_OFFEN(base) ((ENET_ATCR_REG(base) & ENET_ATCR_OFFEN_MASK) >> ENET_ATCR_OFFEN_SHIFT)
#define ENET_BRD_ATCR_OFFEN(base) (BME_UBFX32(&ENET_ATCR_REG(base), ENET_ATCR_OFFEN_SHIFT, ENET_ATCR_OFFEN_WIDTH))

/*! @brief Set the OFFEN field to a new value. */
#define ENET_WR_ATCR_OFFEN(base, value) (ENET_RMW_ATCR(base, ENET_ATCR_OFFEN_MASK, ENET_ATCR_OFFEN(value)))
#define ENET_BWR_ATCR_OFFEN(base, value) (BME_BFI32(&ENET_ATCR_REG(base), ((uint32_t)(value) << ENET_ATCR_OFFEN_SHIFT), ENET_ATCR_OFFEN_SHIFT, ENET_ATCR_OFFEN_WIDTH))
/*@}*/

/*!
 * @name Register ENET_ATCR, field OFFRST[3] (RW)
 *
 * Values:
 * - 0b0 - The timer is not affected and no action occurs, besides clearing
 *     OFFEN, when the offset is reached.
 * - 0b1 - If OFFEN is set, the timer resets to zero when the offset setting is
 *     reached. The offset event does not cause a timer interrupt.
 */
/*@{*/
/*! @brief Read current value of the ENET_ATCR_OFFRST field. */
#define ENET_RD_ATCR_OFFRST(base) ((ENET_ATCR_REG(base) & ENET_ATCR_OFFRST_MASK) >> ENET_ATCR_OFFRST_SHIFT)
#define ENET_BRD_ATCR_OFFRST(base) (BME_UBFX32(&ENET_ATCR_REG(base), ENET_ATCR_OFFRST_SHIFT, ENET_ATCR_OFFRST_WIDTH))

/*! @brief Set the OFFRST field to a new value. */
#define ENET_WR_ATCR_OFFRST(base, value) (ENET_RMW_ATCR(base, ENET_ATCR_OFFRST_MASK, ENET_ATCR_OFFRST(value)))
#define ENET_BWR_ATCR_OFFRST(base, value) (BME_BFI32(&ENET_ATCR_REG(base), ((uint32_t)(value) << ENET_ATCR_OFFRST_SHIFT), ENET_ATCR_OFFRST_SHIFT, ENET_ATCR_OFFRST_WIDTH))
/*@}*/

/*!
 * @name Register ENET_ATCR, field PEREN[4] (RW)
 *
 * Values:
 * - 0b0 - Disable.
 * - 0b1 - A period event interrupt can be generated (EIR[TS_TIMER]) and the
 *     event signal output is asserted when the timer wraps around according to the
 *     periodic setting ATPER. The timer period value must be set before setting
 *     this bit. Not all devices contain the event signal output. See the chip
 *     configuration details.
 */
/*@{*/
/*! @brief Read current value of the ENET_ATCR_PEREN field. */
#define ENET_RD_ATCR_PEREN(base) ((ENET_ATCR_REG(base) & ENET_ATCR_PEREN_MASK) >> ENET_ATCR_PEREN_SHIFT)
#define ENET_BRD_ATCR_PEREN(base) (BME_UBFX32(&ENET_ATCR_REG(base), ENET_ATCR_PEREN_SHIFT, ENET_ATCR_PEREN_WIDTH))

/*! @brief Set the PEREN field to a new value. */
#define ENET_WR_ATCR_PEREN(base, value) (ENET_RMW_ATCR(base, ENET_ATCR_PEREN_MASK, ENET_ATCR_PEREN(value)))
#define ENET_BWR_ATCR_PEREN(base, value) (BME_BFI32(&ENET_ATCR_REG(base), ((uint32_t)(value) << ENET_ATCR_PEREN_SHIFT), ENET_ATCR_PEREN_SHIFT, ENET_ATCR_PEREN_WIDTH))
/*@}*/

/*!
 * @name Register ENET_ATCR, field PINPER[7] (RW)
 *
 * Enables event signal output assertion on period event. Not all devices
 * contain the event signal output. See the chip configuration details.
 *
 * Values:
 * - 0b0 - Disable.
 * - 0b1 - Enable.
 */
/*@{*/
/*! @brief Read current value of the ENET_ATCR_PINPER field. */
#define ENET_RD_ATCR_PINPER(base) ((ENET_ATCR_REG(base) & ENET_ATCR_PINPER_MASK) >> ENET_ATCR_PINPER_SHIFT)
#define ENET_BRD_ATCR_PINPER(base) (BME_UBFX32(&ENET_ATCR_REG(base), ENET_ATCR_PINPER_SHIFT, ENET_ATCR_PINPER_WIDTH))

/*! @brief Set the PINPER field to a new value. */
#define ENET_WR_ATCR_PINPER(base, value) (ENET_RMW_ATCR(base, ENET_ATCR_PINPER_MASK, ENET_ATCR_PINPER(value)))
#define ENET_BWR_ATCR_PINPER(base, value) (BME_BFI32(&ENET_ATCR_REG(base), ((uint32_t)(value) << ENET_ATCR_PINPER_SHIFT), ENET_ATCR_PINPER_SHIFT, ENET_ATCR_PINPER_WIDTH))
/*@}*/

/*!
 * @name Register ENET_ATCR, field RESTART[9] (RW)
 *
 * Resets the timer to zero. This has no effect on the counter enable. If the
 * counter is enabled when this field is set, the timer is reset to zero and starts
 * counting from there. When set, all other fields are ignored during a write.
 * This field automatically clears to 0 after the command completes. The Reset
 * Timer command requires at least 6 clock cycles of either the register clock or
 * the 1588/timestamp clock, whichever is greater, to complete.
 */
/*@{*/
/*! @brief Read current value of the ENET_ATCR_RESTART field. */
#define ENET_RD_ATCR_RESTART(base) ((ENET_ATCR_REG(base) & ENET_ATCR_RESTART_MASK) >> ENET_ATCR_RESTART_SHIFT)
#define ENET_BRD_ATCR_RESTART(base) (BME_UBFX32(&ENET_ATCR_REG(base), ENET_ATCR_RESTART_SHIFT, ENET_ATCR_RESTART_WIDTH))

/*! @brief Set the RESTART field to a new value. */
#define ENET_WR_ATCR_RESTART(base, value) (ENET_RMW_ATCR(base, ENET_ATCR_RESTART_MASK, ENET_ATCR_RESTART(value)))
#define ENET_BWR_ATCR_RESTART(base, value) (BME_BFI32(&ENET_ATCR_REG(base), ((uint32_t)(value) << ENET_ATCR_RESTART_SHIFT), ENET_ATCR_RESTART_SHIFT, ENET_ATCR_RESTART_WIDTH))
/*@}*/

/*!
 * @name Register ENET_ATCR, field CAPTURE[11] (RW)
 *
 * When this field is set, all other fields are ignored during a write. This
 * field automatically clears to 0 after the command completes. To ensure that the
 * correct time value is read from the ATVR register, a minimum amount of time
 * must elapse from issuing this command to reading the ATVR register. This minimum
 * time is defined by the greater of either six register clock cycles or six
 * 1588/timestamp clock cycles.
 *
 * Values:
 * - 0b0 - No effect.
 * - 0b1 - The current time is captured and can be read from the ATVR register.
 */
/*@{*/
/*! @brief Read current value of the ENET_ATCR_CAPTURE field. */
#define ENET_RD_ATCR_CAPTURE(base) ((ENET_ATCR_REG(base) & ENET_ATCR_CAPTURE_MASK) >> ENET_ATCR_CAPTURE_SHIFT)
#define ENET_BRD_ATCR_CAPTURE(base) (BME_UBFX32(&ENET_ATCR_REG(base), ENET_ATCR_CAPTURE_SHIFT, ENET_ATCR_CAPTURE_WIDTH))

/*! @brief Set the CAPTURE field to a new value. */
#define ENET_WR_ATCR_CAPTURE(base, value) (ENET_RMW_ATCR(base, ENET_ATCR_CAPTURE_MASK, ENET_ATCR_CAPTURE(value)))
#define ENET_BWR_ATCR_CAPTURE(base, value) (BME_BFI32(&ENET_ATCR_REG(base), ((uint32_t)(value) << ENET_ATCR_CAPTURE_SHIFT), ENET_ATCR_CAPTURE_SHIFT, ENET_ATCR_CAPTURE_WIDTH))
/*@}*/

/*!
 * @name Register ENET_ATCR, field SLAVE[13] (RW)
 *
 * Values:
 * - 0b0 - The timer is active and all configuration fields in this register are
 *     relevant.
 * - 0b1 - The internal timer is disabled and the externally provided timer
 *     value is used. All other fields, except CAPTURE, in this register have no
 *     effect. CAPTURE can still be used to capture the current timer value.
 */
/*@{*/
/*! @brief Read current value of the ENET_ATCR_SLAVE field. */
#define ENET_RD_ATCR_SLAVE(base) ((ENET_ATCR_REG(base) & ENET_ATCR_SLAVE_MASK) >> ENET_ATCR_SLAVE_SHIFT)
#define ENET_BRD_ATCR_SLAVE(base) (BME_UBFX32(&ENET_ATCR_REG(base), ENET_ATCR_SLAVE_SHIFT, ENET_ATCR_SLAVE_WIDTH))

