ErichStyger/mcuoneclipse/Examples/KDS/TWR-KV58F220M/TWR_KV58F220M_PEx_2_SDKv2/SDK/platform/devices/MKV58F24/include/MKV58F24_extension.h
/*******************************************************************************
 * EWM_CMPL - Compare Low Register
 ******************************************************************************/

/*!
 * @brief EWM_CMPL - Compare Low Register (RW)
 *
 * Reset value: 0x00U
 *
 * The CMPL register is reset to zero after a CPU reset. This provides no
 * minimum time for the CPU to refresh the EWM counter. This register can be written
 * only once after a CPU reset. Writing this register more than once generates a
 * bus transfer error.
 */
/*!
 * @name Constants and macros for entire EWM_CMPL register
 */
/*@{*/
#define EWM_RD_CMPL(base)        (EWM_CMPL_REG(base))
#define EWM_WR_CMPL(base, value) (EWM_CMPL_REG(base) = (value))
#define EWM_RMW_CMPL(base, mask, value) (EWM_WR_CMPL(base, (EWM_RD_CMPL(base) & ~(mask)) | (value)))
#define EWM_SET_CMPL(base, value) (BME_OR8(&EWM_CMPL_REG(base), (uint8_t)(value)))
#define EWM_CLR_CMPL(base, value) (BME_AND8(&EWM_CMPL_REG(base), (uint8_t)(~(value))))
#define EWM_TOG_CMPL(base, value) (BME_XOR8(&EWM_CMPL_REG(base), (uint8_t)(value)))
/*@}*/

/*******************************************************************************
 * EWM_CMPH - Compare High Register
 ******************************************************************************/

/*!
 * @brief EWM_CMPH - Compare High Register (RW)
 *
 * Reset value: 0xFFU
 *
 * The CMPH register is reset to 0xFF after a CPU reset. This provides a maximum
 * of 256 clocks time, for the CPU to refresh the EWM counter. This register can
 * be written only once after a CPU reset. Writing this register more than once
 * generates a bus transfer error. The valid values for CMPH are up to 0xFE
 * because the EWM counter never expires when CMPH = 0xFF. The expiration happens only
 * if EWM counter is greater than CMPH.
 */
/*!
 * @name Constants and macros for entire EWM_CMPH register
 */
/*@{*/
#define EWM_RD_CMPH(base)        (EWM_CMPH_REG(base))
#define EWM_WR_CMPH(base, value) (EWM_CMPH_REG(base) = (value))
#define EWM_RMW_CMPH(base, mask, value) (EWM_WR_CMPH(base, (EWM_RD_CMPH(base) & ~(mask)) | (value)))
#define EWM_SET_CMPH(base, value) (BME_OR8(&EWM_CMPH_REG(base), (uint8_t)(value)))
#define EWM_CLR_CMPH(base, value) (BME_AND8(&EWM_CMPH_REG(base), (uint8_t)(~(value))))
#define EWM_TOG_CMPH(base, value) (BME_XOR8(&EWM_CMPH_REG(base), (uint8_t)(value)))
/*@}*/

/*******************************************************************************
 * EWM_CLKCTRL - Clock Control Register
 ******************************************************************************/

/*!
 * @brief EWM_CLKCTRL - Clock Control Register (RW)
 *
 * Reset value: 0x00U
 *
 * This CLKCTRL register is reset to 0x00 after a CPU reset. This register can
 * be written only once after a CPU reset. Writing this register more than once
 * generates a bus transfer error. User should select the required low power clock
 * before enabling the EWM.
 */
/*!
 * @name Constants and macros for entire EWM_CLKCTRL register
 */
/*@{*/
#define EWM_RD_CLKCTRL(base)     (EWM_CLKCTRL_REG(base))
#define EWM_WR_CLKCTRL(base, value) (EWM_CLKCTRL_REG(base) = (value))
#define EWM_RMW_CLKCTRL(base, mask, value) (EWM_WR_CLKCTRL(base, (EWM_RD_CLKCTRL(base) & ~(mask)) | (value)))
#define EWM_SET_CLKCTRL(base, value) (BME_OR8(&EWM_CLKCTRL_REG(base), (uint8_t)(value)))
#define EWM_CLR_CLKCTRL(base, value) (BME_AND8(&EWM_CLKCTRL_REG(base), (uint8_t)(~(value))))
#define EWM_TOG_CLKCTRL(base, value) (BME_XOR8(&EWM_CLKCTRL_REG(base), (uint8_t)(value)))
/*@}*/

/*
 * Constants & macros for individual EWM_CLKCTRL bitfields
 */

/*!
 * @name Register EWM_CLKCTRL, field CLKSEL[1:0] (RW)
 *
 * EWM has 4 possible low power clock sources for running EWM counter. One of
 * the clock source can be selected by writing into this field. 00 - lpo_clk[0]
 * will be selected for running EWM counter. 01 - lpo_clk[1] will be selected for
 * running EWM counter. 10 - lpo_clk[2] will be selected for running EWM counter.
 * 11 - lpo_clk[3] will be selected for running EWM counter.
 */
/*@{*/
/*! @brief Read current value of the EWM_CLKCTRL_CLKSEL field. */
#define EWM_RD_CLKCTRL_CLKSEL(base) ((EWM_CLKCTRL_REG(base) & EWM_CLKCTRL_CLKSEL_MASK) >> EWM_CLKCTRL_CLKSEL_SHIFT)
#define EWM_BRD_CLKCTRL_CLKSEL(base) (BME_UBFX8(&EWM_CLKCTRL_REG(base), EWM_CLKCTRL_CLKSEL_SHIFT, EWM_CLKCTRL_CLKSEL_WIDTH))

/*! @brief Set the CLKSEL field to a new value. */
#define EWM_WR_CLKCTRL_CLKSEL(base, value) (EWM_RMW_CLKCTRL(base, EWM_CLKCTRL_CLKSEL_MASK, EWM_CLKCTRL_CLKSEL(value)))
#define EWM_BWR_CLKCTRL_CLKSEL(base, value) (BME_BFI8(&EWM_CLKCTRL_REG(base), ((uint8_t)(value) << EWM_CLKCTRL_CLKSEL_SHIFT), EWM_CLKCTRL_CLKSEL_SHIFT, EWM_CLKCTRL_CLKSEL_WIDTH))
/*@}*/

/*******************************************************************************
 * EWM_CLKPRESCALER - Clock Prescaler Register
 ******************************************************************************/

/*!
 * @brief EWM_CLKPRESCALER - Clock Prescaler Register (RW)
 *
 * Reset value: 0x00U
 *
 * This CLKPRESCALER register is reset to 0x00 after a CPU reset. This register
 * can be written only once after a CPU reset. Writing this register more than
 * once generates a bus transfer error. Write the required prescaler value before
 * enabling the EWM. The implementation of this register is chip-specific. See the
 * Chip Configuration details.
 */
/*!
 * @name Constants and macros for entire EWM_CLKPRESCALER register
 */
/*@{*/
#define EWM_RD_CLKPRESCALER(base) (EWM_CLKPRESCALER_REG(base))
#define EWM_WR_CLKPRESCALER(base, value) (EWM_CLKPRESCALER_REG(base) = (value))
#define EWM_RMW_CLKPRESCALER(base, mask, value) (EWM_WR_CLKPRESCALER(base, (EWM_RD_CLKPRESCALER(base) & ~(mask)) | (value)))
#define EWM_SET_CLKPRESCALER(base, value) (BME_OR8(&EWM_CLKPRESCALER_REG(base), (uint8_t)(value)))
#define EWM_CLR_CLKPRESCALER(base, value) (BME_AND8(&EWM_CLKPRESCALER_REG(base), (uint8_t)(~(value))))
#define EWM_TOG_CLKPRESCALER(base, value) (BME_XOR8(&EWM_CLKPRESCALER_REG(base), (uint8_t)(value)))
/*@}*/

