ErichStyger/mcuoneclipse/Examples/KDS/TWR-KV58F220M/TWR_KV58F220M_PEx_2_SDKv2/SDK/platform/devices/MKV58F24/include/MKV58F24_extension.h
/*******************************************************************************
 * FMC_PFB0CR - Flash Bank 0 Control Register
 ******************************************************************************/

/*!
 * @brief FMC_PFB0CR - Flash Bank 0 Control Register (RW)
 *
 * Reset value: 0x30060006U
 */
/*!
 * @name Constants and macros for entire FMC_PFB0CR register
 */
/*@{*/
#define FMC_RD_PFB0CR(base)      (FMC_PFB0CR_REG(base))
#define FMC_WR_PFB0CR(base, value) (FMC_PFB0CR_REG(base) = (value))
#define FMC_RMW_PFB0CR(base, mask, value) (FMC_WR_PFB0CR(base, (FMC_RD_PFB0CR(base) & ~(mask)) | (value)))
#define FMC_SET_PFB0CR(base, value) (BME_OR32(&FMC_PFB0CR_REG(base), (uint32_t)(value)))
#define FMC_CLR_PFB0CR(base, value) (BME_AND32(&FMC_PFB0CR_REG(base), (uint32_t)(~(value))))
#define FMC_TOG_PFB0CR(base, value) (BME_XOR32(&FMC_PFB0CR_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual FMC_PFB0CR bitfields
 */

/*!
 * @name Register FMC_PFB0CR, field B0IPE[1] (RW)
 *
 * This bit controls whether prefetches (or speculative accesses) are initiated
 * in response to instruction fetches.
 *
 * Values:
 * - 0b0 - Do not prefetch in response to instruction fetches.
 * - 0b1 - Enable prefetches in response to instruction fetches.
 */
/*@{*/
/*! @brief Read current value of the FMC_PFB0CR_B0IPE field. */
#define FMC_RD_PFB0CR_B0IPE(base) ((FMC_PFB0CR_REG(base) & FMC_PFB0CR_B0IPE_MASK) >> FMC_PFB0CR_B0IPE_SHIFT)
#define FMC_BRD_PFB0CR_B0IPE(base) (BME_UBFX32(&FMC_PFB0CR_REG(base), FMC_PFB0CR_B0IPE_SHIFT, FMC_PFB0CR_B0IPE_WIDTH))

/*! @brief Set the B0IPE field to a new value. */
#define FMC_WR_PFB0CR_B0IPE(base, value) (FMC_RMW_PFB0CR(base, FMC_PFB0CR_B0IPE_MASK, FMC_PFB0CR_B0IPE(value)))
#define FMC_BWR_PFB0CR_B0IPE(base, value) (BME_BFI32(&FMC_PFB0CR_REG(base), ((uint32_t)(value) << FMC_PFB0CR_B0IPE_SHIFT), FMC_PFB0CR_B0IPE_SHIFT, FMC_PFB0CR_B0IPE_WIDTH))
/*@}*/

/*!
 * @name Register FMC_PFB0CR, field B0DPE[2] (RW)
 *
 * This bit controls whether prefetches (or speculative accesses) are initiated
 * in response to data references.
 *
 * Values:
 * - 0b0 - Do not prefetch in response to data references.
 * - 0b1 - Enable prefetches in response to data references.
 */
/*@{*/
/*! @brief Read current value of the FMC_PFB0CR_B0DPE field. */
#define FMC_RD_PFB0CR_B0DPE(base) ((FMC_PFB0CR_REG(base) & FMC_PFB0CR_B0DPE_MASK) >> FMC_PFB0CR_B0DPE_SHIFT)
#define FMC_BRD_PFB0CR_B0DPE(base) (BME_UBFX32(&FMC_PFB0CR_REG(base), FMC_PFB0CR_B0DPE_SHIFT, FMC_PFB0CR_B0DPE_WIDTH))

/*! @brief Set the B0DPE field to a new value. */
#define FMC_WR_PFB0CR_B0DPE(base, value) (FMC_RMW_PFB0CR(base, FMC_PFB0CR_B0DPE_MASK, FMC_PFB0CR_B0DPE(value)))
#define FMC_BWR_PFB0CR_B0DPE(base, value) (BME_BFI32(&FMC_PFB0CR_REG(base), ((uint32_t)(value) << FMC_PFB0CR_B0DPE_SHIFT), FMC_PFB0CR_B0DPE_SHIFT, FMC_PFB0CR_B0DPE_WIDTH))
/*@}*/

/*!
 * @name Register FMC_PFB0CR, field B0MW[18:17] (RO)
 *
 * This read-only field defines the width of the bank 0 memory.
 *
 * Values:
 * - 0b00 - 32 bits
 * - 0b01 - 64 bits
 * - 0b10 - 128 bits
 * - 0b11 - 256 bits
 */
/*@{*/
/*! @brief Read current value of the FMC_PFB0CR_B0MW field. */
#define FMC_RD_PFB0CR_B0MW(base) ((FMC_PFB0CR_REG(base) & FMC_PFB0CR_B0MW_MASK) >> FMC_PFB0CR_B0MW_SHIFT)
#define FMC_BRD_PFB0CR_B0MW(base) (BME_UBFX32(&FMC_PFB0CR_REG(base), FMC_PFB0CR_B0MW_SHIFT, FMC_PFB0CR_B0MW_WIDTH))
/*@}*/

/*!
 * @name Register FMC_PFB0CR, field S_INV[19] (WORZ)
 *
 * S_INV bit determines if the FMC's prefetch speculation buffer is to be
 * invalidated (cleared). When S_INV bit is written, the prefetch speculation buffer is
 * immediately cleared. Whenever flash memory is modified, the prefetch
 * speculation buffer should be cleared. S_INV bit always reads as zero.
 *
 * Values:
 * - 0b0 - Speculation buffer is not affected.
 * - 0b1 - Invalidate (clear) the speculation buffer.
 */
/*@{*/
/*! @brief Set the S_INV field to a new value. */
#define FMC_WR_PFB0CR_S_INV(base, value) (FMC_RMW_PFB0CR(base, FMC_PFB0CR_S_INV_MASK, FMC_PFB0CR_S_INV(value)))
#define FMC_BWR_PFB0CR_S_INV(base, value) (BME_BFI32(&FMC_PFB0CR_REG(base), ((uint32_t)(value) << FMC_PFB0CR_S_INV_SHIFT), FMC_PFB0CR_S_INV_SHIFT, FMC_PFB0CR_S_INV_WIDTH))
/*@}*/

/*!
 * @name Register FMC_PFB0CR, field B0RWSC[31:28] (RO)
 *
 * This read-only field defines the number of wait states required to access the
 * bank 0 flash memory. The relationship between the read access time of the
 * flash array (expressed in system clock cycles) and RWSC is defined as: Access
 * time of flash array [system clocks] = RWSC + 1 The FMC automatically calculates
 * this value based on the ratio of the system clock speed to the flash clock
 * speed. For example, when this ratio is 4:1, the field's value is 3h.
 */
/*@{*/
/*! @brief Read current value of the FMC_PFB0CR_B0RWSC field. */
#define FMC_RD_PFB0CR_B0RWSC(base) ((FMC_PFB0CR_REG(base) & FMC_PFB0CR_B0RWSC_MASK) >> FMC_PFB0CR_B0RWSC_SHIFT)
#define FMC_BRD_PFB0CR_B0RWSC(base) (BME_UBFX32(&FMC_PFB0CR_REG(base), FMC_PFB0CR_B0RWSC_SHIFT, FMC_PFB0CR_B0RWSC_WIDTH))
/*@}*/

/*
 * MKV58F24 FTFE
 *
 * Flash Memory Interface
 *
 * Registers defined in this header file:
 * - FTFE_FSTAT - Flash Status Register
 * - FTFE_FCNFG - Flash Configuration Register
 * - FTFE_FSEC - Flash Security Register
 * - FTFE_FOPT - Flash Option Register
 * - FTFE_FCCOB3 - Flash Common Command Object Registers
 * - FTFE_FCCOB2 - Flash Common Command Object Registers
 * - FTFE_FCCOB1 - Flash Common Command Object Registers
 * - FTFE_FCCOB0 - Flash Common Command Object Registers
 * - FTFE_FCCOB7 - Flash Common Command Object Registers
 * - FTFE_FCCOB6 - Flash Common Command Object Registers
 * - FTFE_FCCOB5 - Flash Common Command Object Registers
 * - FTFE_FCCOB4 - Flash Common Command Object Registers
 * - FTFE_FCCOBB - Flash Common Command Object Registers
 * - FTFE_FCCOBA - Flash Common Command Object Registers
 * - FTFE_FCCOB9 - Flash Common Command Object Registers
 * - FTFE_FCCOB8 - Flash Common Command Object Registers
 * - FTFE_FPROT3 - Program Flash Protection Registers
 * - FTFE_FPROT2 - Program Flash Protection Registers
 * - FTFE_FPROT1 - Program Flash Protection Registers
 * - FTFE_FPROT0 - Program Flash Protection Registers
 */

#define FTFE_INSTANCE_COUNT (1U) /*!< Number of instances of the FTFE module. */
#define FTFE_IDX (0U) /*!< Instance number for FTFE. */

