ErichStyger/mcuoneclipse/Examples/KDS/TWR-KV58F220M/TWR_KV58F220M_PEx_2_SDKv2/SDK/platform/devices/MKV58F24/include/MKV58F24_extension.h
/*******************************************************************************
 * FTFE_FCCOB2 - Flash Common Command Object Registers
 ******************************************************************************/

/*!
 * @brief FTFE_FCCOB2 - Flash Common Command Object Registers (RW)
 *
 * Reset value: 0x00U
 *
 * The FCCOB register group provides 12 bytes for command codes and parameters.
 * The individual bytes within the set append a 0-B hex identifier to the FCCOB
 * register name: FCCOB0, FCCOB1, ..., FCCOBB.
 */
/*!
 * @name Constants and macros for entire FTFE_FCCOB2 register
 */
/*@{*/
#define FTFE_RD_FCCOB2(base)     (FTFE_FCCOB2_REG(base))
#define FTFE_WR_FCCOB2(base, value) (FTFE_FCCOB2_REG(base) = (value))
#define FTFE_RMW_FCCOB2(base, mask, value) (FTFE_WR_FCCOB2(base, (FTFE_RD_FCCOB2(base) & ~(mask)) | (value)))
#define FTFE_SET_FCCOB2(base, value) (BME_OR8(&FTFE_FCCOB2_REG(base), (uint8_t)(value)))
#define FTFE_CLR_FCCOB2(base, value) (BME_AND8(&FTFE_FCCOB2_REG(base), (uint8_t)(~(value))))
#define FTFE_TOG_FCCOB2(base, value) (BME_XOR8(&FTFE_FCCOB2_REG(base), (uint8_t)(value)))
/*@}*/

/*******************************************************************************
 * FTFE_FCCOB1 - Flash Common Command Object Registers
 ******************************************************************************/

/*!
 * @brief FTFE_FCCOB1 - Flash Common Command Object Registers (RW)
 *
 * Reset value: 0x00U
 *
 * The FCCOB register group provides 12 bytes for command codes and parameters.
 * The individual bytes within the set append a 0-B hex identifier to the FCCOB
 * register name: FCCOB0, FCCOB1, ..., FCCOBB.
 */
/*!
 * @name Constants and macros for entire FTFE_FCCOB1 register
 */
/*@{*/
#define FTFE_RD_FCCOB1(base)     (FTFE_FCCOB1_REG(base))
#define FTFE_WR_FCCOB1(base, value) (FTFE_FCCOB1_REG(base) = (value))
#define FTFE_RMW_FCCOB1(base, mask, value) (FTFE_WR_FCCOB1(base, (FTFE_RD_FCCOB1(base) & ~(mask)) | (value)))
#define FTFE_SET_FCCOB1(base, value) (BME_OR8(&FTFE_FCCOB1_REG(base), (uint8_t)(value)))
#define FTFE_CLR_FCCOB1(base, value) (BME_AND8(&FTFE_FCCOB1_REG(base), (uint8_t)(~(value))))
#define FTFE_TOG_FCCOB1(base, value) (BME_XOR8(&FTFE_FCCOB1_REG(base), (uint8_t)(value)))
/*@}*/

/*******************************************************************************
 * FTFE_FCCOB0 - Flash Common Command Object Registers
 ******************************************************************************/

/*!
 * @brief FTFE_FCCOB0 - Flash Common Command Object Registers (RW)
 *
 * Reset value: 0x00U
 *
 * The FCCOB register group provides 12 bytes for command codes and parameters.
 * The individual bytes within the set append a 0-B hex identifier to the FCCOB
 * register name: FCCOB0, FCCOB1, ..., FCCOBB.
 */
/*!
 * @name Constants and macros for entire FTFE_FCCOB0 register
 */
/*@{*/
#define FTFE_RD_FCCOB0(base)     (FTFE_FCCOB0_REG(base))
#define FTFE_WR_FCCOB0(base, value) (FTFE_FCCOB0_REG(base) = (value))
#define FTFE_RMW_FCCOB0(base, mask, value) (FTFE_WR_FCCOB0(base, (FTFE_RD_FCCOB0(base) & ~(mask)) | (value)))
#define FTFE_SET_FCCOB0(base, value) (BME_OR8(&FTFE_FCCOB0_REG(base), (uint8_t)(value)))
#define FTFE_CLR_FCCOB0(base, value) (BME_AND8(&FTFE_FCCOB0_REG(base), (uint8_t)(~(value))))
#define FTFE_TOG_FCCOB0(base, value) (BME_XOR8(&FTFE_FCCOB0_REG(base), (uint8_t)(value)))
/*@}*/

/*******************************************************************************
 * FTFE_FCCOB7 - Flash Common Command Object Registers
 ******************************************************************************/

/*!
 * @brief FTFE_FCCOB7 - Flash Common Command Object Registers (RW)
 *
 * Reset value: 0x00U
 *
 * The FCCOB register group provides 12 bytes for command codes and parameters.
 * The individual bytes within the set append a 0-B hex identifier to the FCCOB
 * register name: FCCOB0, FCCOB1, ..., FCCOBB.
 */
/*!
 * @name Constants and macros for entire FTFE_FCCOB7 register
 */
/*@{*/
#define FTFE_RD_FCCOB7(base)     (FTFE_FCCOB7_REG(base))
#define FTFE_WR_FCCOB7(base, value) (FTFE_FCCOB7_REG(base) = (value))
#define FTFE_RMW_FCCOB7(base, mask, value) (FTFE_WR_FCCOB7(base, (FTFE_RD_FCCOB7(base) & ~(mask)) | (value)))
#define FTFE_SET_FCCOB7(base, value) (BME_OR8(&FTFE_FCCOB7_REG(base), (uint8_t)(value)))
#define FTFE_CLR_FCCOB7(base, value) (BME_AND8(&FTFE_FCCOB7_REG(base), (uint8_t)(~(value))))
#define FTFE_TOG_FCCOB7(base, value) (BME_XOR8(&FTFE_FCCOB7_REG(base), (uint8_t)(value)))
/*@}*/

/*******************************************************************************
 * FTFE_FCCOB6 - Flash Common Command Object Registers
 ******************************************************************************/

/*!
 * @brief FTFE_FCCOB6 - Flash Common Command Object Registers (RW)
 *
 * Reset value: 0x00U
 *
 * The FCCOB register group provides 12 bytes for command codes and parameters.
 * The individual bytes within the set append a 0-B hex identifier to the FCCOB
 * register name: FCCOB0, FCCOB1, ..., FCCOBB.
 */
/*!
 * @name Constants and macros for entire FTFE_FCCOB6 register
 */
/*@{*/
#define FTFE_RD_FCCOB6(base)     (FTFE_FCCOB6_REG(base))
#define FTFE_WR_FCCOB6(base, value) (FTFE_FCCOB6_REG(base) = (value))
#define FTFE_RMW_FCCOB6(base, mask, value) (FTFE_WR_FCCOB6(base, (FTFE_RD_FCCOB6(base) & ~(mask)) | (value)))
#define FTFE_SET_FCCOB6(base, value) (BME_OR8(&FTFE_FCCOB6_REG(base), (uint8_t)(value)))
#define FTFE_CLR_FCCOB6(base, value) (BME_AND8(&FTFE_FCCOB6_REG(base), (uint8_t)(~(value))))
#define FTFE_TOG_FCCOB6(base, value) (BME_XOR8(&FTFE_FCCOB6_REG(base), (uint8_t)(value)))
/*@}*/

/*******************************************************************************
 * FTFE_FCCOB5 - Flash Common Command Object Registers
 ******************************************************************************/

/*!
 * @brief FTFE_FCCOB5 - Flash Common Command Object Registers (RW)
 *
 * Reset value: 0x00U
 *
 * The FCCOB register group provides 12 bytes for command codes and parameters.
 * The individual bytes within the set append a 0-B hex identifier to the FCCOB
 * register name: FCCOB0, FCCOB1, ..., FCCOBB.
 */
/*!
 * @name Constants and macros for entire FTFE_FCCOB5 register
 */
/*@{*/
#define FTFE_RD_FCCOB5(base)     (FTFE_FCCOB5_REG(base))
#define FTFE_WR_FCCOB5(base, value) (FTFE_FCCOB5_REG(base) = (value))
#define FTFE_RMW_FCCOB5(base, mask, value) (FTFE_WR_FCCOB5(base, (FTFE_RD_FCCOB5(base) & ~(mask)) | (value)))
#define FTFE_SET_FCCOB5(base, value) (BME_OR8(&FTFE_FCCOB5_REG(base), (uint8_t)(value)))
#define FTFE_CLR_FCCOB5(base, value) (BME_AND8(&FTFE_FCCOB5_REG(base), (uint8_t)(~(value))))
#define FTFE_TOG_FCCOB5(base, value) (BME_XOR8(&FTFE_FCCOB5_REG(base), (uint8_t)(value)))
/*@}*/

