ErichStyger/mcuoneclipse/Examples/KDS/TWR-KV58F220M/TWR_KV58F220M_PEx_2_SDKv2/SDK/platform/devices/MKV58F24/include/MKV58F24_extension.h
/*******************************************************************************
 * FTFE_FCCOB4 - Flash Common Command Object Registers
 ******************************************************************************/

/*!
 * @brief FTFE_FCCOB4 - Flash Common Command Object Registers (RW)
 *
 * Reset value: 0x00U
 *
 * The FCCOB register group provides 12 bytes for command codes and parameters.
 * The individual bytes within the set append a 0-B hex identifier to the FCCOB
 * register name: FCCOB0, FCCOB1, ..., FCCOBB.
 */
/*!
 * @name Constants and macros for entire FTFE_FCCOB4 register
 */
/*@{*/
#define FTFE_RD_FCCOB4(base)     (FTFE_FCCOB4_REG(base))
#define FTFE_WR_FCCOB4(base, value) (FTFE_FCCOB4_REG(base) = (value))
#define FTFE_RMW_FCCOB4(base, mask, value) (FTFE_WR_FCCOB4(base, (FTFE_RD_FCCOB4(base) & ~(mask)) | (value)))
#define FTFE_SET_FCCOB4(base, value) (BME_OR8(&FTFE_FCCOB4_REG(base), (uint8_t)(value)))
#define FTFE_CLR_FCCOB4(base, value) (BME_AND8(&FTFE_FCCOB4_REG(base), (uint8_t)(~(value))))
#define FTFE_TOG_FCCOB4(base, value) (BME_XOR8(&FTFE_FCCOB4_REG(base), (uint8_t)(value)))
/*@}*/

/*******************************************************************************
 * FTFE_FCCOBB - Flash Common Command Object Registers
 ******************************************************************************/

/*!
 * @brief FTFE_FCCOBB - Flash Common Command Object Registers (RW)
 *
 * Reset value: 0x00U
 *
 * The FCCOB register group provides 12 bytes for command codes and parameters.
 * The individual bytes within the set append a 0-B hex identifier to the FCCOB
 * register name: FCCOB0, FCCOB1, ..., FCCOBB.
 */
/*!
 * @name Constants and macros for entire FTFE_FCCOBB register
 */
/*@{*/
#define FTFE_RD_FCCOBB(base)     (FTFE_FCCOBB_REG(base))
#define FTFE_WR_FCCOBB(base, value) (FTFE_FCCOBB_REG(base) = (value))
#define FTFE_RMW_FCCOBB(base, mask, value) (FTFE_WR_FCCOBB(base, (FTFE_RD_FCCOBB(base) & ~(mask)) | (value)))
#define FTFE_SET_FCCOBB(base, value) (BME_OR8(&FTFE_FCCOBB_REG(base), (uint8_t)(value)))
#define FTFE_CLR_FCCOBB(base, value) (BME_AND8(&FTFE_FCCOBB_REG(base), (uint8_t)(~(value))))
#define FTFE_TOG_FCCOBB(base, value) (BME_XOR8(&FTFE_FCCOBB_REG(base), (uint8_t)(value)))
/*@}*/

/*******************************************************************************
 * FTFE_FCCOBA - Flash Common Command Object Registers
 ******************************************************************************/

/*!
 * @brief FTFE_FCCOBA - Flash Common Command Object Registers (RW)
 *
 * Reset value: 0x00U
 *
 * The FCCOB register group provides 12 bytes for command codes and parameters.
 * The individual bytes within the set append a 0-B hex identifier to the FCCOB
 * register name: FCCOB0, FCCOB1, ..., FCCOBB.
 */
/*!
 * @name Constants and macros for entire FTFE_FCCOBA register
 */
/*@{*/
#define FTFE_RD_FCCOBA(base)     (FTFE_FCCOBA_REG(base))
#define FTFE_WR_FCCOBA(base, value) (FTFE_FCCOBA_REG(base) = (value))
#define FTFE_RMW_FCCOBA(base, mask, value) (FTFE_WR_FCCOBA(base, (FTFE_RD_FCCOBA(base) & ~(mask)) | (value)))
#define FTFE_SET_FCCOBA(base, value) (BME_OR8(&FTFE_FCCOBA_REG(base), (uint8_t)(value)))
#define FTFE_CLR_FCCOBA(base, value) (BME_AND8(&FTFE_FCCOBA_REG(base), (uint8_t)(~(value))))
#define FTFE_TOG_FCCOBA(base, value) (BME_XOR8(&FTFE_FCCOBA_REG(base), (uint8_t)(value)))
/*@}*/

/*******************************************************************************
 * FTFE_FCCOB9 - Flash Common Command Object Registers
 ******************************************************************************/

/*!
 * @brief FTFE_FCCOB9 - Flash Common Command Object Registers (RW)
 *
 * Reset value: 0x00U
 *
 * The FCCOB register group provides 12 bytes for command codes and parameters.
 * The individual bytes within the set append a 0-B hex identifier to the FCCOB
 * register name: FCCOB0, FCCOB1, ..., FCCOBB.
 */
/*!
 * @name Constants and macros for entire FTFE_FCCOB9 register
 */
/*@{*/
#define FTFE_RD_FCCOB9(base)     (FTFE_FCCOB9_REG(base))
#define FTFE_WR_FCCOB9(base, value) (FTFE_FCCOB9_REG(base) = (value))
#define FTFE_RMW_FCCOB9(base, mask, value) (FTFE_WR_FCCOB9(base, (FTFE_RD_FCCOB9(base) & ~(mask)) | (value)))
#define FTFE_SET_FCCOB9(base, value) (BME_OR8(&FTFE_FCCOB9_REG(base), (uint8_t)(value)))
#define FTFE_CLR_FCCOB9(base, value) (BME_AND8(&FTFE_FCCOB9_REG(base), (uint8_t)(~(value))))
#define FTFE_TOG_FCCOB9(base, value) (BME_XOR8(&FTFE_FCCOB9_REG(base), (uint8_t)(value)))
/*@}*/

/*******************************************************************************
 * FTFE_FCCOB8 - Flash Common Command Object Registers
 ******************************************************************************/

/*!
 * @brief FTFE_FCCOB8 - Flash Common Command Object Registers (RW)
 *
 * Reset value: 0x00U
 *
 * The FCCOB register group provides 12 bytes for command codes and parameters.
 * The individual bytes within the set append a 0-B hex identifier to the FCCOB
 * register name: FCCOB0, FCCOB1, ..., FCCOBB.
 */
/*!
 * @name Constants and macros for entire FTFE_FCCOB8 register
 */
/*@{*/
#define FTFE_RD_FCCOB8(base)     (FTFE_FCCOB8_REG(base))
#define FTFE_WR_FCCOB8(base, value) (FTFE_FCCOB8_REG(base) = (value))
#define FTFE_RMW_FCCOB8(base, mask, value) (FTFE_WR_FCCOB8(base, (FTFE_RD_FCCOB8(base) & ~(mask)) | (value)))
#define FTFE_SET_FCCOB8(base, value) (BME_OR8(&FTFE_FCCOB8_REG(base), (uint8_t)(value)))
#define FTFE_CLR_FCCOB8(base, value) (BME_AND8(&FTFE_FCCOB8_REG(base), (uint8_t)(~(value))))
#define FTFE_TOG_FCCOB8(base, value) (BME_XOR8(&FTFE_FCCOB8_REG(base), (uint8_t)(value)))
/*@}*/

/*******************************************************************************
 * FTFE_FPROT3 - Program Flash Protection Registers
 ******************************************************************************/

/*!
 * @brief FTFE_FPROT3 - Program Flash Protection Registers (RW)
 *
 * Reset value: 0x00U
 *
 * The FPROT registers define which program flash regions are protected from
 * program and erase operations. Protected flash regions cannot have their content
 * changed; that is, these regions cannot be programmed and cannot be erased by
 * any FTFE command. Unprotected regions can be changed by program and erase
 * operations. The four FPROT registers allow up to 32 protectable regions of equal
 * memory size. Program flash protection register Program flash protection bits
 * FPROT0 PROT[31:24] FPROT1 PROT[23:16] FPROT2 PROT[15:8] FPROT3 PROT[7:0] During
 * the reset sequence, the FPROT registers are loaded with the contents of the
 * program flash protection bytes in the Flash Configuration Field as indicated in
 * the following table. Program flash protection register Flash Configuration Field
 * offset address FPROT0 0x000B FPROT1 0x000A FPROT2 0x0009 FPROT3 0x0008 To
 * change the program flash protection that is loaded during the reset sequence,
 * unprotect the sector of program flash memory that contains the Flash
 * Configuration Field. Then, reprogram the program flash protection byte.
 */
/*!
 * @name Constants and macros for entire FTFE_FPROT3 register
 */
/*@{*/
#define FTFE_RD_FPROT3(base)     (FTFE_FPROT3_REG(base))
#define FTFE_WR_FPROT3(base, value) (FTFE_FPROT3_REG(base) = (value))
#define FTFE_RMW_FPROT3(base, mask, value) (FTFE_WR_FPROT3(base, (FTFE_RD_FPROT3(base) & ~(mask)) | (value)))
#define FTFE_SET_FPROT3(base, value) (BME_OR8(&FTFE_FPROT3_REG(base), (uint8_t)(value)))
#define FTFE_CLR_FPROT3(base, value) (BME_AND8(&FTFE_FPROT3_REG(base), (uint8_t)(~(value))))
#define FTFE_TOG_FPROT3(base, value) (BME_XOR8(&FTFE_FPROT3_REG(base), (uint8_t)(value)))
/*@}*/

