ErichStyger/mcuoneclipse/Examples/KDS/TWR-KV58F220M/TWR_KV58F220M_PEx_2_SDKv2/SDK/platform/devices/MKV58F24/include/MKV58F24_extension.h
/*******************************************************************************
 * FTM_PWMLOAD - FTM PWM Load
 ******************************************************************************/

/*!
 * @brief FTM_PWMLOAD - FTM PWM Load (RW)
 *
 * Reset value: 0x00000000U
 *
 * Enables the loading of the MOD, CNTIN, C(n)V, and C(n+1)V registers with the
 * values of their write buffers when the FTM counter changes from the MOD
 * register value to its next value or when a channel (j) match occurs. A match occurs
 * for the channel (j) when FTM counter = C(j)V.
 */
/*!
 * @name Constants and macros for entire FTM_PWMLOAD register
 */
/*@{*/
#define FTM_RD_PWMLOAD(base)     (FTM_PWMLOAD_REG(base))
#define FTM_WR_PWMLOAD(base, value) (FTM_PWMLOAD_REG(base) = (value))
#define FTM_RMW_PWMLOAD(base, mask, value) (FTM_WR_PWMLOAD(base, (FTM_RD_PWMLOAD(base) & ~(mask)) | (value)))
#define FTM_SET_PWMLOAD(base, value) (BME_OR32(&FTM_PWMLOAD_REG(base), (uint32_t)(value)))
#define FTM_CLR_PWMLOAD(base, value) (BME_AND32(&FTM_PWMLOAD_REG(base), (uint32_t)(~(value))))
#define FTM_TOG_PWMLOAD(base, value) (BME_XOR32(&FTM_PWMLOAD_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual FTM_PWMLOAD bitfields
 */

/*!
 * @name Register FTM_PWMLOAD, field CH0SEL[0] (RW)
 *
 * Values:
 * - 0b0 - Do not include the channel in the matching process.
 * - 0b1 - Include the channel in the matching process.
 */
/*@{*/
/*! @brief Read current value of the FTM_PWMLOAD_CH0SEL field. */
#define FTM_RD_PWMLOAD_CH0SEL(base) ((FTM_PWMLOAD_REG(base) & FTM_PWMLOAD_CH0SEL_MASK) >> FTM_PWMLOAD_CH0SEL_SHIFT)
#define FTM_BRD_PWMLOAD_CH0SEL(base) (BME_UBFX32(&FTM_PWMLOAD_REG(base), FTM_PWMLOAD_CH0SEL_SHIFT, FTM_PWMLOAD_CH0SEL_WIDTH))

/*! @brief Set the CH0SEL field to a new value. */
#define FTM_WR_PWMLOAD_CH0SEL(base, value) (FTM_RMW_PWMLOAD(base, FTM_PWMLOAD_CH0SEL_MASK, FTM_PWMLOAD_CH0SEL(value)))
#define FTM_BWR_PWMLOAD_CH0SEL(base, value) (BME_BFI32(&FTM_PWMLOAD_REG(base), ((uint32_t)(value) << FTM_PWMLOAD_CH0SEL_SHIFT), FTM_PWMLOAD_CH0SEL_SHIFT, FTM_PWMLOAD_CH0SEL_WIDTH))
/*@}*/

/*!
 * @name Register FTM_PWMLOAD, field CH1SEL[1] (RW)
 *
 * Values:
 * - 0b0 - Do not include the channel in the matching process.
 * - 0b1 - Include the channel in the matching process.
 */
/*@{*/
/*! @brief Read current value of the FTM_PWMLOAD_CH1SEL field. */
#define FTM_RD_PWMLOAD_CH1SEL(base) ((FTM_PWMLOAD_REG(base) & FTM_PWMLOAD_CH1SEL_MASK) >> FTM_PWMLOAD_CH1SEL_SHIFT)
#define FTM_BRD_PWMLOAD_CH1SEL(base) (BME_UBFX32(&FTM_PWMLOAD_REG(base), FTM_PWMLOAD_CH1SEL_SHIFT, FTM_PWMLOAD_CH1SEL_WIDTH))

/*! @brief Set the CH1SEL field to a new value. */
#define FTM_WR_PWMLOAD_CH1SEL(base, value) (FTM_RMW_PWMLOAD(base, FTM_PWMLOAD_CH1SEL_MASK, FTM_PWMLOAD_CH1SEL(value)))
#define FTM_BWR_PWMLOAD_CH1SEL(base, value) (BME_BFI32(&FTM_PWMLOAD_REG(base), ((uint32_t)(value) << FTM_PWMLOAD_CH1SEL_SHIFT), FTM_PWMLOAD_CH1SEL_SHIFT, FTM_PWMLOAD_CH1SEL_WIDTH))
/*@}*/

/*!
 * @name Register FTM_PWMLOAD, field CH2SEL[2] (RW)
 *
 * Values:
 * - 0b0 - Do not include the channel in the matching process.
 * - 0b1 - Include the channel in the matching process.
 */
/*@{*/
/*! @brief Read current value of the FTM_PWMLOAD_CH2SEL field. */
#define FTM_RD_PWMLOAD_CH2SEL(base) ((FTM_PWMLOAD_REG(base) & FTM_PWMLOAD_CH2SEL_MASK) >> FTM_PWMLOAD_CH2SEL_SHIFT)
#define FTM_BRD_PWMLOAD_CH2SEL(base) (BME_UBFX32(&FTM_PWMLOAD_REG(base), FTM_PWMLOAD_CH2SEL_SHIFT, FTM_PWMLOAD_CH2SEL_WIDTH))

/*! @brief Set the CH2SEL field to a new value. */
#define FTM_WR_PWMLOAD_CH2SEL(base, value) (FTM_RMW_PWMLOAD(base, FTM_PWMLOAD_CH2SEL_MASK, FTM_PWMLOAD_CH2SEL(value)))
#define FTM_BWR_PWMLOAD_CH2SEL(base, value) (BME_BFI32(&FTM_PWMLOAD_REG(base), ((uint32_t)(value) << FTM_PWMLOAD_CH2SEL_SHIFT), FTM_PWMLOAD_CH2SEL_SHIFT, FTM_PWMLOAD_CH2SEL_WIDTH))
/*@}*/

/*!
 * @name Register FTM_PWMLOAD, field CH3SEL[3] (RW)
 *
 * Values:
 * - 0b0 - Do not include the channel in the matching process.
 * - 0b1 - Include the channel in the matching process.
 */
/*@{*/
/*! @brief Read current value of the FTM_PWMLOAD_CH3SEL field. */
#define FTM_RD_PWMLOAD_CH3SEL(base) ((FTM_PWMLOAD_REG(base) & FTM_PWMLOAD_CH3SEL_MASK) >> FTM_PWMLOAD_CH3SEL_SHIFT)
#define FTM_BRD_PWMLOAD_CH3SEL(base) (BME_UBFX32(&FTM_PWMLOAD_REG(base), FTM_PWMLOAD_CH3SEL_SHIFT, FTM_PWMLOAD_CH3SEL_WIDTH))

/*! @brief Set the CH3SEL field to a new value. */
#define FTM_WR_PWMLOAD_CH3SEL(base, value) (FTM_RMW_PWMLOAD(base, FTM_PWMLOAD_CH3SEL_MASK, FTM_PWMLOAD_CH3SEL(value)))
#define FTM_BWR_PWMLOAD_CH3SEL(base, value) (BME_BFI32(&FTM_PWMLOAD_REG(base), ((uint32_t)(value) << FTM_PWMLOAD_CH3SEL_SHIFT), FTM_PWMLOAD_CH3SEL_SHIFT, FTM_PWMLOAD_CH3SEL_WIDTH))
/*@}*/

/*!
 * @name Register FTM_PWMLOAD, field CH4SEL[4] (RW)
 *
 * Values:
 * - 0b0 - Do not include the channel in the matching process.
 * - 0b1 - Include the channel in the matching process.
 */
/*@{*/
/*! @brief Read current value of the FTM_PWMLOAD_CH4SEL field. */
#define FTM_RD_PWMLOAD_CH4SEL(base) ((FTM_PWMLOAD_REG(base) & FTM_PWMLOAD_CH4SEL_MASK) >> FTM_PWMLOAD_CH4SEL_SHIFT)
#define FTM_BRD_PWMLOAD_CH4SEL(base) (BME_UBFX32(&FTM_PWMLOAD_REG(base), FTM_PWMLOAD_CH4SEL_SHIFT, FTM_PWMLOAD_CH4SEL_WIDTH))

/*! @brief Set the CH4SEL field to a new value. */
#define FTM_WR_PWMLOAD_CH4SEL(base, value) (FTM_RMW_PWMLOAD(base, FTM_PWMLOAD_CH4SEL_MASK, FTM_PWMLOAD_CH4SEL(value)))
#define FTM_BWR_PWMLOAD_CH4SEL(base, value) (BME_BFI32(&FTM_PWMLOAD_REG(base), ((uint32_t)(value) << FTM_PWMLOAD_CH4SEL_SHIFT), FTM_PWMLOAD_CH4SEL_SHIFT, FTM_PWMLOAD_CH4SEL_WIDTH))
/*@}*/

/*!
 * @name Register FTM_PWMLOAD, field CH5SEL[5] (RW)
 *
 * Values:
 * - 0b0 - Do not include the channel in the matching process.
 * - 0b1 - Include the channel in the matching process.
 */
/*@{*/
/*! @brief Read current value of the FTM_PWMLOAD_CH5SEL field. */
#define FTM_RD_PWMLOAD_CH5SEL(base) ((FTM_PWMLOAD_REG(base) & FTM_PWMLOAD_CH5SEL_MASK) >> FTM_PWMLOAD_CH5SEL_SHIFT)
#define FTM_BRD_PWMLOAD_CH5SEL(base) (BME_UBFX32(&FTM_PWMLOAD_REG(base), FTM_PWMLOAD_CH5SEL_SHIFT, FTM_PWMLOAD_CH5SEL_WIDTH))

/*! @brief Set the CH5SEL field to a new value. */
#define FTM_WR_PWMLOAD_CH5SEL(base, value) (FTM_RMW_PWMLOAD(base, FTM_PWMLOAD_CH5SEL_MASK, FTM_PWMLOAD_CH5SEL(value)))
#define FTM_BWR_PWMLOAD_CH5SEL(base, value) (BME_BFI32(&FTM_PWMLOAD_REG(base), ((uint32_t)(value) << FTM_PWMLOAD_CH5SEL_SHIFT), FTM_PWMLOAD_CH5SEL_SHIFT, FTM_PWMLOAD_CH5SEL_WIDTH))
/*@}*/

/*!
 * @name Register FTM_PWMLOAD, field CH6SEL[6] (RW)
 *
 * Values:
 * - 0b0 - Do not include the channel in the matching process.
 * - 0b1 - Include the channel in the matching process.
 */
/*@{*/
/*! @brief Read current value of the FTM_PWMLOAD_CH6SEL field. */
#define FTM_RD_PWMLOAD_CH6SEL(base) ((FTM_PWMLOAD_REG(base) & FTM_PWMLOAD_CH6SEL_MASK) >> FTM_PWMLOAD_CH6SEL_SHIFT)
#define FTM_BRD_PWMLOAD_CH6SEL(base) (BME_UBFX32(&FTM_PWMLOAD_REG(base), FTM_PWMLOAD_CH6SEL_SHIFT, FTM_PWMLOAD_CH6SEL_WIDTH))

/*! @brief Set the CH6SEL field to a new value. */
#define FTM_WR_PWMLOAD_CH6SEL(base, value) (FTM_RMW_PWMLOAD(base, FTM_PWMLOAD_CH6SEL_MASK, FTM_PWMLOAD_CH6SEL(value)))
#define FTM_BWR_PWMLOAD_CH6SEL(base, value) (BME_BFI32(&FTM_PWMLOAD_REG(base), ((uint32_t)(value) << FTM_PWMLOAD_CH6SEL_SHIFT), FTM_PWMLOAD_CH6SEL_SHIFT, FTM_PWMLOAD_CH6SEL_WIDTH))
/*@}*/

/*!
 * @name Register FTM_PWMLOAD, field CH7SEL[7] (RW)
 *
 * Values:
 * - 0b0 - Do not include the channel in the matching process.
 * - 0b1 - Include the channel in the matching process.
 */
/*@{*/
/*! @brief Read current value of the FTM_PWMLOAD_CH7SEL field. */
#define FTM_RD_PWMLOAD_CH7SEL(base) ((FTM_PWMLOAD_REG(base) & FTM_PWMLOAD_CH7SEL_MASK) >> FTM_PWMLOAD_CH7SEL_SHIFT)
#define FTM_BRD_PWMLOAD_CH7SEL(base) (BME_UBFX32(&FTM_PWMLOAD_REG(base), FTM_PWMLOAD_CH7SEL_SHIFT, FTM_PWMLOAD_CH7SEL_WIDTH))

/*! @brief Set the CH7SEL field to a new value. */
#define FTM_WR_PWMLOAD_CH7SEL(base, value) (FTM_RMW_PWMLOAD(base, FTM_PWMLOAD_CH7SEL_MASK, FTM_PWMLOAD_CH7SEL(value)))
#define FTM_BWR_PWMLOAD_CH7SEL(base, value) (BME_BFI32(&FTM_PWMLOAD_REG(base), ((uint32_t)(value) << FTM_PWMLOAD_CH7SEL_SHIFT), FTM_PWMLOAD_CH7SEL_SHIFT, FTM_PWMLOAD_CH7SEL_WIDTH))
/*@}*/

/*!
 * @name Register FTM_PWMLOAD, field LDOK[9] (RW)
 *
 * Enables the loading of the MOD, CNTIN, and CV registers with the values of
 * their write buffers.
 *
 * Values:
 * - 0b0 - Loading updated values is disabled.
 * - 0b1 - Loading updated values is enabled.
 */
/*@{*/
/*! @brief Read current value of the FTM_PWMLOAD_LDOK field. */
#define FTM_RD_PWMLOAD_LDOK(base) ((FTM_PWMLOAD_REG(base) & FTM_PWMLOAD_LDOK_MASK) >> FTM_PWMLOAD_LDOK_SHIFT)
#define FTM_BRD_PWMLOAD_LDOK(base) (BME_UBFX32(&FTM_PWMLOAD_REG(base), FTM_PWMLOAD_LDOK_SHIFT, FTM_PWMLOAD_LDOK_WIDTH))

