ErichStyger/mcuoneclipse/Examples/KDS/TWR-KV58F220M/TWR_KV58F220M_PEx_2_SDKv2/SDK/platform/devices/MKV58F24/include/MKV58F24_extension.h
/*! @brief Set the HLMTIE field to a new value. */
#define HSADC_WR_CTRL1_HLMTIE(base, value) (HSADC_RMW_CTRL1(base, HSADC_CTRL1_HLMTIE_MASK, HSADC_CTRL1_HLMTIE(value)))
#define HSADC_BWR_CTRL1_HLMTIE(base, value) (BME_BFI16(&HSADC_CTRL1_REG(base), ((uint16_t)(value) << HSADC_CTRL1_HLMTIE_SHIFT), HSADC_CTRL1_HLMTIE_SHIFT, HSADC_CTRL1_HLMTIE_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_CTRL1, field LLMTIE[9] (RW)
 *
 * This bit enables the Low Limit exceeded interrupt when the current result
 * value is less than the low limit register value. The raw result value is compared
 * to LOLIM[LLMT] before the offset register value is subtracted.
 *
 * Values:
 * - 0b0 - Interrupt disabled
 * - 0b1 - Interrupt enabled
 */
/*@{*/
/*! @brief Read current value of the HSADC_CTRL1_LLMTIE field. */
#define HSADC_RD_CTRL1_LLMTIE(base) ((HSADC_CTRL1_REG(base) & HSADC_CTRL1_LLMTIE_MASK) >> HSADC_CTRL1_LLMTIE_SHIFT)
#define HSADC_BRD_CTRL1_LLMTIE(base) (BME_UBFX16(&HSADC_CTRL1_REG(base), HSADC_CTRL1_LLMTIE_SHIFT, HSADC_CTRL1_LLMTIE_WIDTH))

/*! @brief Set the LLMTIE field to a new value. */
#define HSADC_WR_CTRL1_LLMTIE(base, value) (HSADC_RMW_CTRL1(base, HSADC_CTRL1_LLMTIE_MASK, HSADC_CTRL1_LLMTIE(value)))
#define HSADC_BWR_CTRL1_LLMTIE(base, value) (BME_BFI16(&HSADC_CTRL1_REG(base), ((uint16_t)(value) << HSADC_CTRL1_LLMTIE_SHIFT), HSADC_CTRL1_LLMTIE_SHIFT, HSADC_CTRL1_LLMTIE_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_CTRL1, field ZCIE[10] (RW)
 *
 * This bit enables the zero crossing interrupt if the current result value has
 * a sign change from the previous result as configured by the ZXCTRL1 and
 * ZXCTRL2 registers.
 *
 * Values:
 * - 0b0 - Interrupt disabled
 * - 0b1 - Interrupt enabled
 */
/*@{*/
/*! @brief Read current value of the HSADC_CTRL1_ZCIE field. */
#define HSADC_RD_CTRL1_ZCIE(base) ((HSADC_CTRL1_REG(base) & HSADC_CTRL1_ZCIE_MASK) >> HSADC_CTRL1_ZCIE_SHIFT)
#define HSADC_BRD_CTRL1_ZCIE(base) (BME_UBFX16(&HSADC_CTRL1_REG(base), HSADC_CTRL1_ZCIE_SHIFT, HSADC_CTRL1_ZCIE_WIDTH))

/*! @brief Set the ZCIE field to a new value. */
#define HSADC_WR_CTRL1_ZCIE(base, value) (HSADC_RMW_CTRL1(base, HSADC_CTRL1_ZCIE_MASK, HSADC_CTRL1_ZCIE(value)))
#define HSADC_BWR_CTRL1_ZCIE(base, value) (BME_BFI16(&HSADC_CTRL1_REG(base), ((uint16_t)(value) << HSADC_CTRL1_ZCIE_SHIFT), HSADC_CTRL1_ZCIE_SHIFT, HSADC_CTRL1_ZCIE_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_CTRL1, field EOSIEA[11] (RW)
 *
 * This bit enables an EOSIA interrupt to be generated upon completion of the
 * scan. For looping scan modes, the interrupt will trigger after the completion of
 * each iteration of the loop.
 *
 * Values:
 * - 0b0 - Interrupt disabled
 * - 0b1 - Interrupt enabled
 */
/*@{*/
/*! @brief Read current value of the HSADC_CTRL1_EOSIEA field. */
#define HSADC_RD_CTRL1_EOSIEA(base) ((HSADC_CTRL1_REG(base) & HSADC_CTRL1_EOSIEA_MASK) >> HSADC_CTRL1_EOSIEA_SHIFT)
#define HSADC_BRD_CTRL1_EOSIEA(base) (BME_UBFX16(&HSADC_CTRL1_REG(base), HSADC_CTRL1_EOSIEA_SHIFT, HSADC_CTRL1_EOSIEA_WIDTH))

/*! @brief Set the EOSIEA field to a new value. */
#define HSADC_WR_CTRL1_EOSIEA(base, value) (HSADC_RMW_CTRL1(base, HSADC_CTRL1_EOSIEA_MASK, HSADC_CTRL1_EOSIEA(value)))
#define HSADC_BWR_CTRL1_EOSIEA(base, value) (BME_BFI16(&HSADC_CTRL1_REG(base), ((uint16_t)(value) << HSADC_CTRL1_EOSIEA_SHIFT), HSADC_CTRL1_EOSIEA_SHIFT, HSADC_CTRL1_EOSIEA_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_CTRL1, field SYNCA[12] (RW)
 *
 * A conversion may be initiated by asserting a positive edge on the SYNCA
 * input. Any subsequent SYNCA input pulses while the scan remains in process are
 * ignored unless the scan is awaiting further SYNC inputs due to the SCTRL[SCn]
 * bits. CTRL1[SYNCA] is cleared in ONCE mode, CTRL1[SMODE=000 or 001], when the
 * first SYNC input is detected. This prevents unintentionally starting a new scan
 * after the first scan has completed. The ADC must be in a stable power mode prior
 * to SYNCA input assertion. Refer to the functional description of power modes
 * for further details. In "once" scan modes, only a first SYNCA input pulse is
 * honored. CTRL1[SYNCA] is cleared in this mode when the first SYNC input is
 * detected. This prevents unintentionally starting a new scan after the first scan
 * has completed. CTRL1[SYNCA] can be set again at any time including while the
 * scan remains in process
 *
 * Values:
 * - 0b0 - Scan is initiated by a write to CTRL1[STARTA] only
 * - 0b1 - Use a SYNCA input pulse or CTRL1[STARTA] to initiate a scan
 */
/*@{*/
/*! @brief Read current value of the HSADC_CTRL1_SYNCA field. */
#define HSADC_RD_CTRL1_SYNCA(base) ((HSADC_CTRL1_REG(base) & HSADC_CTRL1_SYNCA_MASK) >> HSADC_CTRL1_SYNCA_SHIFT)
#define HSADC_BRD_CTRL1_SYNCA(base) (BME_UBFX16(&HSADC_CTRL1_REG(base), HSADC_CTRL1_SYNCA_SHIFT, HSADC_CTRL1_SYNCA_WIDTH))

/*! @brief Set the SYNCA field to a new value. */
#define HSADC_WR_CTRL1_SYNCA(base, value) (HSADC_RMW_CTRL1(base, HSADC_CTRL1_SYNCA_MASK, HSADC_CTRL1_SYNCA(value)))
#define HSADC_BWR_CTRL1_SYNCA(base, value) (BME_BFI16(&HSADC_CTRL1_REG(base), ((uint16_t)(value) << HSADC_CTRL1_SYNCA_SHIFT), HSADC_CTRL1_SYNCA_SHIFT, HSADC_CTRL1_SYNCA_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_CTRL1, field STARTA[13] (WORZ)
 *
 * A scan is started by writing 1 to this bit. This is a write only bit. Writing
 * 1 to it again while the scan remains in process, is ignored. The ADC must be
 * in a stable power configuration prior to writing the start bit. Refer to the
 * functional description of power modes for further details.
 *
 * Values:
 * - 0b0 - No action
 * - 0b1 - Start command is issued
 */
/*@{*/
/*! @brief Set the STARTA field to a new value. */
#define HSADC_WR_CTRL1_STARTA(base, value) (HSADC_RMW_CTRL1(base, HSADC_CTRL1_STARTA_MASK, HSADC_CTRL1_STARTA(value)))
#define HSADC_BWR_CTRL1_STARTA(base, value) (BME_BFI16(&HSADC_CTRL1_REG(base), ((uint16_t)(value) << HSADC_CTRL1_STARTA_SHIFT), HSADC_CTRL1_STARTA_SHIFT, HSADC_CTRL1_STARTA_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_CTRL1, field STOPA[14] (RW)
 *
 * When this bit is asserted, the current scan is stopped and no further scans
 * can start. Any further SYNCA input pulses (see CTRL1[SYNCA]) or writes to
 * CTRL1[STARTA] are ignored until this bit has been cleared. After the ADC is in stop
 * mode, the result registers can be modified by the processor. Any changes to
 * the result registers in stop mode are treated as if the analog core supplied
 * the data. Therefore, limit checking, zero crossing, and associated interrupts
 * can occur when authorized. This is not the same as the chip's STOP mode.
 *
 * Values:
 * - 0b0 - Normal operation
 * - 0b1 - Stop mode
 */
/*@{*/
/*! @brief Read current value of the HSADC_CTRL1_STOPA field. */
#define HSADC_RD_CTRL1_STOPA(base) ((HSADC_CTRL1_REG(base) & HSADC_CTRL1_STOPA_MASK) >> HSADC_CTRL1_STOPA_SHIFT)
#define HSADC_BRD_CTRL1_STOPA(base) (BME_UBFX16(&HSADC_CTRL1_REG(base), HSADC_CTRL1_STOPA_SHIFT, HSADC_CTRL1_STOPA_WIDTH))

