ErichStyger/mcuoneclipse/Examples/KDS/TWR-KV58F220M/TWR_KV58F220M_PEx_2_SDKv2/SDK/platform/devices/MKV58F24/include/MKV58F24_extension.h
/*! @brief Set the STOPA field to a new value. */
#define HSADC_WR_CTRL1_STOPA(base, value) (HSADC_RMW_CTRL1(base, HSADC_CTRL1_STOPA_MASK, HSADC_CTRL1_STOPA(value)))
#define HSADC_BWR_CTRL1_STOPA(base, value) (BME_BFI16(&HSADC_CTRL1_REG(base), ((uint16_t)(value) << HSADC_CTRL1_STOPA_SHIFT), HSADC_CTRL1_STOPA_SHIFT, HSADC_CTRL1_STOPA_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_CTRL1, field DMAENA[15] (RW)
 *
 * When this bit is asserted, the DMA source selected by CTRL3[DMASRC] causes
 * the conversion results to be transferred by the DMA controller.
 *
 * Values:
 * - 0b0 - DMA is not enabled.
 * - 0b1 - DMA is enabled.
 */
/*@{*/
/*! @brief Read current value of the HSADC_CTRL1_DMAENA field. */
#define HSADC_RD_CTRL1_DMAENA(base) ((HSADC_CTRL1_REG(base) & HSADC_CTRL1_DMAENA_MASK) >> HSADC_CTRL1_DMAENA_SHIFT)
#define HSADC_BRD_CTRL1_DMAENA(base) (BME_UBFX16(&HSADC_CTRL1_REG(base), HSADC_CTRL1_DMAENA_SHIFT, HSADC_CTRL1_DMAENA_WIDTH))

/*! @brief Set the DMAENA field to a new value. */
#define HSADC_WR_CTRL1_DMAENA(base, value) (HSADC_RMW_CTRL1(base, HSADC_CTRL1_DMAENA_MASK, HSADC_CTRL1_DMAENA(value)))
#define HSADC_BWR_CTRL1_DMAENA(base, value) (BME_BFI16(&HSADC_CTRL1_REG(base), ((uint16_t)(value) << HSADC_CTRL1_DMAENA_SHIFT), HSADC_CTRL1_DMAENA_SHIFT, HSADC_CTRL1_DMAENA_WIDTH))
/*@}*/

/*******************************************************************************
 * HSADC_CTRL2 - HSADC Control Register 2
 ******************************************************************************/

/*!
 * @brief HSADC_CTRL2 - HSADC Control Register 2 (RW)
 *
 * Reset value: 0x5044U
 */
/*!
 * @name Constants and macros for entire HSADC_CTRL2 register
 */
/*@{*/
#define HSADC_RD_CTRL2(base)     (HSADC_CTRL2_REG(base))
#define HSADC_WR_CTRL2(base, value) (HSADC_CTRL2_REG(base) = (value))
#define HSADC_RMW_CTRL2(base, mask, value) (HSADC_WR_CTRL2(base, (HSADC_RD_CTRL2(base) & ~(mask)) | (value)))
#define HSADC_SET_CTRL2(base, value) (BME_OR16(&HSADC_CTRL2_REG(base), (uint16_t)(value)))
#define HSADC_CLR_CTRL2(base, value) (BME_AND16(&HSADC_CTRL2_REG(base), (uint16_t)(~(value))))
#define HSADC_TOG_CTRL2(base, value) (BME_XOR16(&HSADC_CTRL2_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual HSADC_CTRL2 bitfields
 */

/*!
 * @name Register HSADC_CTRL2, field DIVA[5:0] (RW)
 *
 * The divider circuit generates the ADC clock by dividing the system clock:
 * When DIVA is 0, the divisor is 2. For all other DIVA values, the divisor is (DIVA
 * + 1). A DIVA value must be chosen so the ADC clock does not exceed the
 * maximum frequency (80 MHz). This clock divisor is used by ADCA during all scans and
 * is used by ADCB during sequential scan modes and during parallel simultaneous
 * scan modes. The following table shows the ADC clock frequency based on the
 * value of DIVA for some frequencies of the clock source. DIVA Divisor HSADC clock
 * input 160 MHz HSADC clock input 240 MHz 00_0000 2 80.0M - 00_0001 2 80.0M -
 * 00_0010 3 53.33M 80.0M 00_0011 4 40.0M 60.0M 00_0100 5 32.00M 48.0M 00_0101 6
 * 26.67M 40.0M - - - - 11_1111 64 2.5M 3.75M
 */
/*@{*/
/*! @brief Read current value of the HSADC_CTRL2_DIVA field. */
#define HSADC_RD_CTRL2_DIVA(base) ((HSADC_CTRL2_REG(base) & HSADC_CTRL2_DIVA_MASK) >> HSADC_CTRL2_DIVA_SHIFT)
#define HSADC_BRD_CTRL2_DIVA(base) (BME_UBFX16(&HSADC_CTRL2_REG(base), HSADC_CTRL2_DIVA_SHIFT, HSADC_CTRL2_DIVA_WIDTH))

/*! @brief Set the DIVA field to a new value. */
#define HSADC_WR_CTRL2_DIVA(base, value) (HSADC_RMW_CTRL2(base, HSADC_CTRL2_DIVA_MASK, HSADC_CTRL2_DIVA(value)))
#define HSADC_BWR_CTRL2_DIVA(base, value) (BME_BFI16(&HSADC_CTRL2_REG(base), ((uint16_t)(value) << HSADC_CTRL2_DIVA_SHIFT), HSADC_CTRL2_DIVA_SHIFT, HSADC_CTRL2_DIVA_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_CTRL2, field SIMULT[6] (RW)
 *
 * This bit only affects parallel scan modes. By default (CTRL2[SIMULT]=1)
 * parallel scans operate in simultaneous mode. The scans in the A and B converter
 * operate simultaneously and always result in pairs of simultaneous conversions in
 * the A and B converter. CTRL1[STOPA], CTRL1[SYNCA], and CTRL1[STARTA] control
 * bits and the SYNCA input are used to start and stop scans in both converters
 * simultaneously. A scan ends in both converters when either converter encounters
 * a disabled sample slot. When the parallel scan completes, the STAT[EOSIA]
 * triggers if CTRL1[EOSIEA] is set. The STAT[CIPA] status bit indicates that a
 * parallel scan is in process. When CTRL2[SIMULT]=0, parallel scans in the A and B
 * converters operate independently. The B converter has its own independent set of
 * the above controls (with a B suffix) which control its operation and report
 * its status. Each converter's scan continues until its sample list is exhausted
 * (8 samples) or a disabled sample IN ITS LIST is encountered. For looping
 * parallel scan mode, each converter starts its next iteration as soon as the
 * previous iteration in that converter is complete and continues until the CTRL*[STOP*]
 * bit for that converter is asserted.
 *
 * Values:
 * - 0b0 - Parallel scans done independently
 * - 0b1 - Parallel scans done simultaneously (default)
 */
/*@{*/
/*! @brief Read current value of the HSADC_CTRL2_SIMULT field. */
#define HSADC_RD_CTRL2_SIMULT(base) ((HSADC_CTRL2_REG(base) & HSADC_CTRL2_SIMULT_MASK) >> HSADC_CTRL2_SIMULT_SHIFT)
#define HSADC_BRD_CTRL2_SIMULT(base) (BME_UBFX16(&HSADC_CTRL2_REG(base), HSADC_CTRL2_SIMULT_SHIFT, HSADC_CTRL2_SIMULT_WIDTH))

/*! @brief Set the SIMULT field to a new value. */
#define HSADC_WR_CTRL2_SIMULT(base, value) (HSADC_RMW_CTRL2(base, HSADC_CTRL2_SIMULT_MASK, HSADC_CTRL2_SIMULT(value)))
#define HSADC_BWR_CTRL2_SIMULT(base, value) (BME_BFI16(&HSADC_CTRL2_REG(base), ((uint16_t)(value) << HSADC_CTRL2_SIMULT_SHIFT), HSADC_CTRL2_SIMULT_SHIFT, HSADC_CTRL2_SIMULT_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_CTRL2, field CHNCFG_H[10:7] (RW)
 *
 * The bits configure the analog inputs for either single ended or differential
 * conversions. Differential measurements return the max value ((2**12)-1) when
 * the + input is V REFH and the - input is V REFLO , return 0 when the + input is
 * at V REFLO and the - input is at V REFH , and scale linearly between based on
 * the voltage difference between the two signals. Single ended measurements
 * return the max value when the input is at V REFH , return 0 when the input is at
 * V REFLO , and scale linearly between based on the amount by which the input
 * exceeds V REFLO. See section Input Multiplex Function for details when using
 * ANA6/7 or ANB6/7.
 *
 * Values:
 * - 0bxxx1 - Inputs = ANA4-ANA5
 * - 0bxxx0 - Inputs = ANA4-ANA5
 * - 0bxx1x - Inputs = ANA6-ANA7
 * - 0bxx0x - Inputs = ANA6-ANA7
 * - 0bx1xx - Inputs = ANB4-ANB5
 * - 0bx0xx - Inputs = ANB4-ANB5
 * - 0b1xxx - Inputs = ANB6-ANB7
 */
/*@{*/
/*! @brief Read current value of the HSADC_CTRL2_CHNCFG_H field. */
#define HSADC_RD_CTRL2_CHNCFG_H(base) ((HSADC_CTRL2_REG(base) & HSADC_CTRL2_CHNCFG_H_MASK) >> HSADC_CTRL2_CHNCFG_H_SHIFT)
#define HSADC_BRD_CTRL2_CHNCFG_H(base) (BME_UBFX16(&HSADC_CTRL2_REG(base), HSADC_CTRL2_CHNCFG_H_SHIFT, HSADC_CTRL2_CHNCFG_H_WIDTH))

/*! @brief Set the CHNCFG_H field to a new value. */
#define HSADC_WR_CTRL2_CHNCFG_H(base, value) (HSADC_RMW_CTRL2(base, HSADC_CTRL2_CHNCFG_H_MASK, HSADC_CTRL2_CHNCFG_H(value)))
#define HSADC_BWR_CTRL2_CHNCFG_H(base, value) (BME_BFI16(&HSADC_CTRL2_REG(base), ((uint16_t)(value) << HSADC_CTRL2_CHNCFG_H_SHIFT), HSADC_CTRL2_CHNCFG_H_SHIFT, HSADC_CTRL2_CHNCFG_H_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_CTRL2, field EOSIEB[11] (RW)
 *
 * During parallel scan modes when SIMULT = 0, this bit enables interrupt
 * control for a B converter parallel scan. This bit enables an EOSIB interrupt to be
 * generated upon completion of the scan. For looping scan modes, the interrupt
 * will trigger after the completion of each iteration of the loop.
 *
 * Values:
 * - 0b0 - Interrupt disabled
 * - 0b1 - Interrupt enabled
 */
/*@{*/
/*! @brief Read current value of the HSADC_CTRL2_EOSIEB field. */
#define HSADC_RD_CTRL2_EOSIEB(base) ((HSADC_CTRL2_REG(base) & HSADC_CTRL2_EOSIEB_MASK) >> HSADC_CTRL2_EOSIEB_SHIFT)
#define HSADC_BRD_CTRL2_EOSIEB(base) (BME_UBFX16(&HSADC_CTRL2_REG(base), HSADC_CTRL2_EOSIEB_SHIFT, HSADC_CTRL2_EOSIEB_WIDTH))

/*! @brief Set the EOSIEB field to a new value. */
#define HSADC_WR_CTRL2_EOSIEB(base, value) (HSADC_RMW_CTRL2(base, HSADC_CTRL2_EOSIEB_MASK, HSADC_CTRL2_EOSIEB(value)))
#define HSADC_BWR_CTRL2_EOSIEB(base, value) (BME_BFI16(&HSADC_CTRL2_REG(base), ((uint16_t)(value) << HSADC_CTRL2_EOSIEB_SHIFT), HSADC_CTRL2_EOSIEB_SHIFT, HSADC_CTRL2_EOSIEB_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_CTRL2, field SYNCB[12] (RW)
 *
 * During parallel scan modes when CTRL2[SIMULT]=0, setting this bit to 1
 * permits a B converter parallel scan to be initiated by asserting the SYNCB input for
 * at least one ADC clock cycle. CTRL2[SYNCB] is cleared in ONCE mode,
 * CTRL1[SMODE=000 or 001], when the first SYNC input is detected. This prevents
 * unintentionally starting a new scan after the first scan has completed. The ADC must be
 * in a stable power mode prior to SYNCB input assertion. Refer to the
 * functional description of power modes for further details. In "once" scan modes, only a
 * first SYNCB input pulse is honored. CTRL2[SYNCB] is cleared in this mode when
 * the first SYNCB input is detected. This prevents unintentionally starting a
 * new scan after the first scan has completed. CTRL2[SYNCB] can be set again at
 * any time including while the scan remains in process.
 *
 * Values:
 * - 0b0 - B converter parallel scan is initiated by a write to CTRL2[STARTB]
 *     only
 * - 0b1 - Use a SYNCB input pulse or CTRL2[STARTB] to initiate a B converter
 *     parallel scan
 */
/*@{*/
/*! @brief Read current value of the HSADC_CTRL2_SYNCB field. */
#define HSADC_RD_CTRL2_SYNCB(base) ((HSADC_CTRL2_REG(base) & HSADC_CTRL2_SYNCB_MASK) >> HSADC_CTRL2_SYNCB_SHIFT)
#define HSADC_BRD_CTRL2_SYNCB(base) (BME_UBFX16(&HSADC_CTRL2_REG(base), HSADC_CTRL2_SYNCB_SHIFT, HSADC_CTRL2_SYNCB_WIDTH))

