ErichStyger/mcuoneclipse/Examples/KDS/TWR-KV58F220M/TWR_KV58F220M_PEx_2_SDKv2/SDK/platform/devices/MKV58F24/include/MKV58F24_extension.h
/*! @brief Set the SYNCB field to a new value. */
#define HSADC_WR_CTRL2_SYNCB(base, value) (HSADC_RMW_CTRL2(base, HSADC_CTRL2_SYNCB_MASK, HSADC_CTRL2_SYNCB(value)))
#define HSADC_BWR_CTRL2_SYNCB(base, value) (BME_BFI16(&HSADC_CTRL2_REG(base), ((uint16_t)(value) << HSADC_CTRL2_SYNCB_SHIFT), HSADC_CTRL2_SYNCB_SHIFT, HSADC_CTRL2_SYNCB_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_CTRL2, field STARTB[13] (WORZ)
 *
 * During parallel scan modes when SIMULT = 0, this bit enables start control of
 * a B converter parallel scan. A scan is started by writing 1 to this bit. This
 * is a write only bit. Writing 1 to it again while the scan remains in process,
 * is ignored. The ADC must be in a stable power configuration prior to writing
 * the start bit. Refer to the functional description of power modes for further
 * details.
 *
 * Values:
 * - 0b0 - No action
 * - 0b1 - Start command is issued
 */
/*@{*/
/*! @brief Set the STARTB field to a new value. */
#define HSADC_WR_CTRL2_STARTB(base, value) (HSADC_RMW_CTRL2(base, HSADC_CTRL2_STARTB_MASK, HSADC_CTRL2_STARTB(value)))
#define HSADC_BWR_CTRL2_STARTB(base, value) (BME_BFI16(&HSADC_CTRL2_REG(base), ((uint16_t)(value) << HSADC_CTRL2_STARTB_SHIFT), HSADC_CTRL2_STARTB_SHIFT, HSADC_CTRL2_STARTB_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_CTRL2, field STOPB[14] (RW)
 *
 * During parallel scan modes when SIMULT = 0, this bit enables stop control of
 * a B converter parallel scan. When this bit is asserted, the current scan is
 * stopped and no further scans can start. Any further SYNCB input pulses (see
 * CTRL2[SYNCB]) or writes to CTRL2[STARTB] are ignored until this bit has been
 * cleared. After the ADC is in stop mode, the result registers can be modified by the
 * processor. Any changes to the result registers in stop mode are treated as if
 * the analog core supplied the data. Therefore, limit checking, zero crossing,
 * and associated interrupts can occur when authorized. This is not the same as
 * the chip's STOP mode.
 *
 * Values:
 * - 0b0 - Normal operation
 * - 0b1 - Stop mode
 */
/*@{*/
/*! @brief Read current value of the HSADC_CTRL2_STOPB field. */
#define HSADC_RD_CTRL2_STOPB(base) ((HSADC_CTRL2_REG(base) & HSADC_CTRL2_STOPB_MASK) >> HSADC_CTRL2_STOPB_SHIFT)
#define HSADC_BRD_CTRL2_STOPB(base) (BME_UBFX16(&HSADC_CTRL2_REG(base), HSADC_CTRL2_STOPB_SHIFT, HSADC_CTRL2_STOPB_WIDTH))

/*! @brief Set the STOPB field to a new value. */
#define HSADC_WR_CTRL2_STOPB(base, value) (HSADC_RMW_CTRL2(base, HSADC_CTRL2_STOPB_MASK, HSADC_CTRL2_STOPB(value)))
#define HSADC_BWR_CTRL2_STOPB(base, value) (BME_BFI16(&HSADC_CTRL2_REG(base), ((uint16_t)(value) << HSADC_CTRL2_STOPB_SHIFT), HSADC_CTRL2_STOPB_SHIFT, HSADC_CTRL2_STOPB_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_CTRL2, field DMAENB[15] (RW)
 *
 * During parallel scan modes when SIMULT=0, this bit enables DMA for converter
 * B. When this bit is asserted, the DMA source selected by CTRL3[DMASRC] causes
 * the conversion results to be transferred by the DMA controller.
 *
 * Values:
 * - 0b0 - DMA is not enabled.
 * - 0b1 - DMA is enabled.
 */
/*@{*/
/*! @brief Read current value of the HSADC_CTRL2_DMAENB field. */
#define HSADC_RD_CTRL2_DMAENB(base) ((HSADC_CTRL2_REG(base) & HSADC_CTRL2_DMAENB_MASK) >> HSADC_CTRL2_DMAENB_SHIFT)
#define HSADC_BRD_CTRL2_DMAENB(base) (BME_UBFX16(&HSADC_CTRL2_REG(base), HSADC_CTRL2_DMAENB_SHIFT, HSADC_CTRL2_DMAENB_WIDTH))

/*! @brief Set the DMAENB field to a new value. */
#define HSADC_WR_CTRL2_DMAENB(base, value) (HSADC_RMW_CTRL2(base, HSADC_CTRL2_DMAENB_MASK, HSADC_CTRL2_DMAENB(value)))
#define HSADC_BWR_CTRL2_DMAENB(base, value) (BME_BFI16(&HSADC_CTRL2_REG(base), ((uint16_t)(value) << HSADC_CTRL2_DMAENB_SHIFT), HSADC_CTRL2_DMAENB_SHIFT, HSADC_CTRL2_DMAENB_WIDTH))
/*@}*/

/*******************************************************************************
 * HSADC_ZXCTRL1 - HSADC Zero Crossing Control 1 Register
 ******************************************************************************/

/*!
 * @brief HSADC_ZXCTRL1 - HSADC Zero Crossing Control 1 Register (RW)
 *
 * Reset value: 0x0000U
 *
 * The HSADC Zero crossing 1 register controls the zero cross feature for each
 * of the eight ADC conversions made on HSADC channels acquired by SAMPLE0 to
 * SAMPLE7 in the CLIST1 and CLIST2 registers. Each of the ZCEn fields corresponds to
 * the SAMPLEn channel selected. For example, ZCE7 field will enable/disable
 * zero cross detect on the HSADC channel selected by SAMPLE7 field in CLIST2
 * register.
 */
/*!
 * @name Constants and macros for entire HSADC_ZXCTRL1 register
 */
/*@{*/
#define HSADC_RD_ZXCTRL1(base)   (HSADC_ZXCTRL1_REG(base))
#define HSADC_WR_ZXCTRL1(base, value) (HSADC_ZXCTRL1_REG(base) = (value))
#define HSADC_RMW_ZXCTRL1(base, mask, value) (HSADC_WR_ZXCTRL1(base, (HSADC_RD_ZXCTRL1(base) & ~(mask)) | (value)))
#define HSADC_SET_ZXCTRL1(base, value) (BME_OR16(&HSADC_ZXCTRL1_REG(base), (uint16_t)(value)))
#define HSADC_CLR_ZXCTRL1(base, value) (BME_AND16(&HSADC_ZXCTRL1_REG(base), (uint16_t)(~(value))))
#define HSADC_TOG_ZXCTRL1(base, value) (BME_XOR16(&HSADC_ZXCTRL1_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual HSADC_ZXCTRL1 bitfields
 */

/*!
 * @name Register HSADC_ZXCTRL1, field ZCE0[1:0] (RW)
 *
 * Values:
 * - 0b00 - Zero Crossing disabled
 * - 0b01 - Zero Crossing enabled for positive to negative sign change
 * - 0b10 - Zero Crossing enabled for negative to positive sign change
 * - 0b11 - Zero Crossing enabled for any sign change
 */
/*@{*/
/*! @brief Read current value of the HSADC_ZXCTRL1_ZCE0 field. */
#define HSADC_RD_ZXCTRL1_ZCE0(base) ((HSADC_ZXCTRL1_REG(base) & HSADC_ZXCTRL1_ZCE0_MASK) >> HSADC_ZXCTRL1_ZCE0_SHIFT)
#define HSADC_BRD_ZXCTRL1_ZCE0(base) (BME_UBFX16(&HSADC_ZXCTRL1_REG(base), HSADC_ZXCTRL1_ZCE0_SHIFT, HSADC_ZXCTRL1_ZCE0_WIDTH))

/*! @brief Set the ZCE0 field to a new value. */
#define HSADC_WR_ZXCTRL1_ZCE0(base, value) (HSADC_RMW_ZXCTRL1(base, HSADC_ZXCTRL1_ZCE0_MASK, HSADC_ZXCTRL1_ZCE0(value)))
#define HSADC_BWR_ZXCTRL1_ZCE0(base, value) (BME_BFI16(&HSADC_ZXCTRL1_REG(base), ((uint16_t)(value) << HSADC_ZXCTRL1_ZCE0_SHIFT), HSADC_ZXCTRL1_ZCE0_SHIFT, HSADC_ZXCTRL1_ZCE0_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_ZXCTRL1, field ZCE1[3:2] (RW)
 *
 * Values:
 * - 0b00 - Zero Crossing disabled
 * - 0b01 - Zero Crossing enabled for positive to negative sign change
 * - 0b10 - Zero Crossing enabled for negative to positive sign change
 * - 0b11 - Zero Crossing enabled for any sign change
 */
/*@{*/
/*! @brief Read current value of the HSADC_ZXCTRL1_ZCE1 field. */
#define HSADC_RD_ZXCTRL1_ZCE1(base) ((HSADC_ZXCTRL1_REG(base) & HSADC_ZXCTRL1_ZCE1_MASK) >> HSADC_ZXCTRL1_ZCE1_SHIFT)
#define HSADC_BRD_ZXCTRL1_ZCE1(base) (BME_UBFX16(&HSADC_ZXCTRL1_REG(base), HSADC_ZXCTRL1_ZCE1_SHIFT, HSADC_ZXCTRL1_ZCE1_WIDTH))

/*! @brief Set the ZCE1 field to a new value. */
#define HSADC_WR_ZXCTRL1_ZCE1(base, value) (HSADC_RMW_ZXCTRL1(base, HSADC_ZXCTRL1_ZCE1_MASK, HSADC_ZXCTRL1_ZCE1(value)))
#define HSADC_BWR_ZXCTRL1_ZCE1(base, value) (BME_BFI16(&HSADC_ZXCTRL1_REG(base), ((uint16_t)(value) << HSADC_ZXCTRL1_ZCE1_SHIFT), HSADC_ZXCTRL1_ZCE1_SHIFT, HSADC_ZXCTRL1_ZCE1_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_ZXCTRL1, field ZCE2[5:4] (RW)
 *
 * Values:
 * - 0b00 - Zero Crossing disabled
 * - 0b01 - Zero Crossing enabled for positive to negative sign change
 * - 0b10 - Zero Crossing enabled for negative to positive sign change
 * - 0b11 - Zero Crossing enabled for any sign change
 */
/*@{*/
/*! @brief Read current value of the HSADC_ZXCTRL1_ZCE2 field. */
#define HSADC_RD_ZXCTRL1_ZCE2(base) ((HSADC_ZXCTRL1_REG(base) & HSADC_ZXCTRL1_ZCE2_MASK) >> HSADC_ZXCTRL1_ZCE2_SHIFT)
#define HSADC_BRD_ZXCTRL1_ZCE2(base) (BME_UBFX16(&HSADC_ZXCTRL1_REG(base), HSADC_ZXCTRL1_ZCE2_SHIFT, HSADC_ZXCTRL1_ZCE2_WIDTH))

/*! @brief Set the ZCE2 field to a new value. */
#define HSADC_WR_ZXCTRL1_ZCE2(base, value) (HSADC_RMW_ZXCTRL1(base, HSADC_ZXCTRL1_ZCE2_MASK, HSADC_ZXCTRL1_ZCE2(value)))
#define HSADC_BWR_ZXCTRL1_ZCE2(base, value) (BME_BFI16(&HSADC_ZXCTRL1_REG(base), ((uint16_t)(value) << HSADC_ZXCTRL1_ZCE2_SHIFT), HSADC_ZXCTRL1_ZCE2_SHIFT, HSADC_ZXCTRL1_ZCE2_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_ZXCTRL1, field ZCE3[7:6] (RW)
 *
 * Values:
 * - 0b00 - Zero Crossing disabled
 * - 0b01 - Zero Crossing enabled for positive to negative sign change
 * - 0b10 - Zero Crossing enabled for negative to positive sign change
 * - 0b11 - Zero Crossing enabled for any sign change
 */
/*@{*/
/*! @brief Read current value of the HSADC_ZXCTRL1_ZCE3 field. */
#define HSADC_RD_ZXCTRL1_ZCE3(base) ((HSADC_ZXCTRL1_REG(base) & HSADC_ZXCTRL1_ZCE3_MASK) >> HSADC_ZXCTRL1_ZCE3_SHIFT)
#define HSADC_BRD_ZXCTRL1_ZCE3(base) (BME_UBFX16(&HSADC_ZXCTRL1_REG(base), HSADC_ZXCTRL1_ZCE3_SHIFT, HSADC_ZXCTRL1_ZCE3_WIDTH))

/*! @brief Set the ZCE3 field to a new value. */
#define HSADC_WR_ZXCTRL1_ZCE3(base, value) (HSADC_RMW_ZXCTRL1(base, HSADC_ZXCTRL1_ZCE3_MASK, HSADC_ZXCTRL1_ZCE3(value)))
#define HSADC_BWR_ZXCTRL1_ZCE3(base, value) (BME_BFI16(&HSADC_ZXCTRL1_REG(base), ((uint16_t)(value) << HSADC_ZXCTRL1_ZCE3_SHIFT), HSADC_ZXCTRL1_ZCE3_SHIFT, HSADC_ZXCTRL1_ZCE3_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_ZXCTRL1, field ZCE4[9:8] (RW)
 *
 * Values:
 * - 0b00 - Zero Crossing disabled
 * - 0b01 - Zero Crossing enabled for positive to negative sign change
 * - 0b10 - Zero Crossing enabled for negative to positive sign change
 * - 0b11 - Zero Crossing enabled for any sign change
 */
/*@{*/
/*! @brief Read current value of the HSADC_ZXCTRL1_ZCE4 field. */
#define HSADC_RD_ZXCTRL1_ZCE4(base) ((HSADC_ZXCTRL1_REG(base) & HSADC_ZXCTRL1_ZCE4_MASK) >> HSADC_ZXCTRL1_ZCE4_SHIFT)
#define HSADC_BRD_ZXCTRL1_ZCE4(base) (BME_UBFX16(&HSADC_ZXCTRL1_REG(base), HSADC_ZXCTRL1_ZCE4_SHIFT, HSADC_ZXCTRL1_ZCE4_WIDTH))

/*! @brief Set the ZCE4 field to a new value. */
#define HSADC_WR_ZXCTRL1_ZCE4(base, value) (HSADC_RMW_ZXCTRL1(base, HSADC_ZXCTRL1_ZCE4_MASK, HSADC_ZXCTRL1_ZCE4(value)))
#define HSADC_BWR_ZXCTRL1_ZCE4(base, value) (BME_BFI16(&HSADC_ZXCTRL1_REG(base), ((uint16_t)(value) << HSADC_ZXCTRL1_ZCE4_SHIFT), HSADC_ZXCTRL1_ZCE4_SHIFT, HSADC_ZXCTRL1_ZCE4_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_ZXCTRL1, field ZCE5[11:10] (RW)
 *
 * Values:
 * - 0b00 - Zero Crossing disabled
 * - 0b01 - Zero Crossing enabled for positive to negative sign change
 * - 0b10 - Zero Crossing enabled for negative to positive sign change
 * - 0b11 - Zero Crossing enabled for any sign change
 */
/*@{*/
/*! @brief Read current value of the HSADC_ZXCTRL1_ZCE5 field. */
#define HSADC_RD_ZXCTRL1_ZCE5(base) ((HSADC_ZXCTRL1_REG(base) & HSADC_ZXCTRL1_ZCE5_MASK) >> HSADC_ZXCTRL1_ZCE5_SHIFT)
#define HSADC_BRD_ZXCTRL1_ZCE5(base) (BME_UBFX16(&HSADC_ZXCTRL1_REG(base), HSADC_ZXCTRL1_ZCE5_SHIFT, HSADC_ZXCTRL1_ZCE5_WIDTH))

