ErichStyger/mcuoneclipse/Examples/KDS/TWR-KV58F220M/TWR_KV58F220M_PEx_2_SDKv2/SDK/platform/devices/MKV58F24/include/MKV58F24_extension.h
/*! @brief Set the ZCE5 field to a new value. */
#define HSADC_WR_ZXCTRL1_ZCE5(base, value) (HSADC_RMW_ZXCTRL1(base, HSADC_ZXCTRL1_ZCE5_MASK, HSADC_ZXCTRL1_ZCE5(value)))
#define HSADC_BWR_ZXCTRL1_ZCE5(base, value) (BME_BFI16(&HSADC_ZXCTRL1_REG(base), ((uint16_t)(value) << HSADC_ZXCTRL1_ZCE5_SHIFT), HSADC_ZXCTRL1_ZCE5_SHIFT, HSADC_ZXCTRL1_ZCE5_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_ZXCTRL1, field ZCE6[13:12] (RW)
 *
 * Values:
 * - 0b00 - Zero Crossing disabled
 * - 0b01 - Zero Crossing enabled for positive to negative sign change
 * - 0b10 - Zero Crossing enabled for negative to positive sign change
 * - 0b11 - Zero Crossing enabled for any sign change
 */
/*@{*/
/*! @brief Read current value of the HSADC_ZXCTRL1_ZCE6 field. */
#define HSADC_RD_ZXCTRL1_ZCE6(base) ((HSADC_ZXCTRL1_REG(base) & HSADC_ZXCTRL1_ZCE6_MASK) >> HSADC_ZXCTRL1_ZCE6_SHIFT)
#define HSADC_BRD_ZXCTRL1_ZCE6(base) (BME_UBFX16(&HSADC_ZXCTRL1_REG(base), HSADC_ZXCTRL1_ZCE6_SHIFT, HSADC_ZXCTRL1_ZCE6_WIDTH))

/*! @brief Set the ZCE6 field to a new value. */
#define HSADC_WR_ZXCTRL1_ZCE6(base, value) (HSADC_RMW_ZXCTRL1(base, HSADC_ZXCTRL1_ZCE6_MASK, HSADC_ZXCTRL1_ZCE6(value)))
#define HSADC_BWR_ZXCTRL1_ZCE6(base, value) (BME_BFI16(&HSADC_ZXCTRL1_REG(base), ((uint16_t)(value) << HSADC_ZXCTRL1_ZCE6_SHIFT), HSADC_ZXCTRL1_ZCE6_SHIFT, HSADC_ZXCTRL1_ZCE6_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_ZXCTRL1, field ZCE7[15:14] (RW)
 *
 * Values:
 * - 0b00 - Zero Crossing disabled
 * - 0b01 - Zero Crossing enabled for positive to negative sign change
 * - 0b10 - Zero Crossing enabled for negative to positive sign change
 * - 0b11 - Zero Crossing enabled for any sign change
 */
/*@{*/
/*! @brief Read current value of the HSADC_ZXCTRL1_ZCE7 field. */
#define HSADC_RD_ZXCTRL1_ZCE7(base) ((HSADC_ZXCTRL1_REG(base) & HSADC_ZXCTRL1_ZCE7_MASK) >> HSADC_ZXCTRL1_ZCE7_SHIFT)
#define HSADC_BRD_ZXCTRL1_ZCE7(base) (BME_UBFX16(&HSADC_ZXCTRL1_REG(base), HSADC_ZXCTRL1_ZCE7_SHIFT, HSADC_ZXCTRL1_ZCE7_WIDTH))

/*! @brief Set the ZCE7 field to a new value. */
#define HSADC_WR_ZXCTRL1_ZCE7(base, value) (HSADC_RMW_ZXCTRL1(base, HSADC_ZXCTRL1_ZCE7_MASK, HSADC_ZXCTRL1_ZCE7(value)))
#define HSADC_BWR_ZXCTRL1_ZCE7(base, value) (BME_BFI16(&HSADC_ZXCTRL1_REG(base), ((uint16_t)(value) << HSADC_ZXCTRL1_ZCE7_SHIFT), HSADC_ZXCTRL1_ZCE7_SHIFT, HSADC_ZXCTRL1_ZCE7_WIDTH))
/*@}*/

/*******************************************************************************
 * HSADC_ZXCTRL2 - HSADC Zero Crossing Control 2 Register
 ******************************************************************************/

/*!
 * @brief HSADC_ZXCTRL2 - HSADC Zero Crossing Control 2 Register (RW)
 *
 * Reset value: 0x0000U
 *
 * The HSADC Zero Crossing Control 2 register controls the zero cross feature
 * for each of the eight ADC conversions made on HSADC channels acquired by SAMPLE8
 * to SAMPLE15 in the CLIST3 and CLIST4 registers. Each of the ZCEn fields
 * corresponds to the SAMPLEn channel selected. For example, ZCE15 field will
 * enable/disable zero cross detect on the HSADC channel selected by SAMPLE15 field in
 * CLIST4 register.
 */
/*!
 * @name Constants and macros for entire HSADC_ZXCTRL2 register
 */
/*@{*/
#define HSADC_RD_ZXCTRL2(base)   (HSADC_ZXCTRL2_REG(base))
#define HSADC_WR_ZXCTRL2(base, value) (HSADC_ZXCTRL2_REG(base) = (value))
#define HSADC_RMW_ZXCTRL2(base, mask, value) (HSADC_WR_ZXCTRL2(base, (HSADC_RD_ZXCTRL2(base) & ~(mask)) | (value)))
#define HSADC_SET_ZXCTRL2(base, value) (BME_OR16(&HSADC_ZXCTRL2_REG(base), (uint16_t)(value)))
#define HSADC_CLR_ZXCTRL2(base, value) (BME_AND16(&HSADC_ZXCTRL2_REG(base), (uint16_t)(~(value))))
#define HSADC_TOG_ZXCTRL2(base, value) (BME_XOR16(&HSADC_ZXCTRL2_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual HSADC_ZXCTRL2 bitfields
 */

/*!
 * @name Register HSADC_ZXCTRL2, field ZCE8[1:0] (RW)
 *
 * Values:
 * - 0b00 - Zero Crossing disabled
 * - 0b01 - Zero Crossing enabled for positive to negative sign change
 * - 0b10 - Zero Crossing enabled for negative to positive sign change
 * - 0b11 - Zero Crossing enabled for any sign change
 */
/*@{*/
/*! @brief Read current value of the HSADC_ZXCTRL2_ZCE8 field. */
#define HSADC_RD_ZXCTRL2_ZCE8(base) ((HSADC_ZXCTRL2_REG(base) & HSADC_ZXCTRL2_ZCE8_MASK) >> HSADC_ZXCTRL2_ZCE8_SHIFT)
#define HSADC_BRD_ZXCTRL2_ZCE8(base) (BME_UBFX16(&HSADC_ZXCTRL2_REG(base), HSADC_ZXCTRL2_ZCE8_SHIFT, HSADC_ZXCTRL2_ZCE8_WIDTH))

/*! @brief Set the ZCE8 field to a new value. */
#define HSADC_WR_ZXCTRL2_ZCE8(base, value) (HSADC_RMW_ZXCTRL2(base, HSADC_ZXCTRL2_ZCE8_MASK, HSADC_ZXCTRL2_ZCE8(value)))
#define HSADC_BWR_ZXCTRL2_ZCE8(base, value) (BME_BFI16(&HSADC_ZXCTRL2_REG(base), ((uint16_t)(value) << HSADC_ZXCTRL2_ZCE8_SHIFT), HSADC_ZXCTRL2_ZCE8_SHIFT, HSADC_ZXCTRL2_ZCE8_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_ZXCTRL2, field ZCE9[3:2] (RW)
 *
 * Values:
 * - 0b00 - Zero Crossing disabled
 * - 0b01 - Zero Crossing enabled for positive to negative sign change
 * - 0b10 - Zero Crossing enabled for negative to positive sign change
 * - 0b11 - Zero Crossing enabled for any sign change
 */
/*@{*/
/*! @brief Read current value of the HSADC_ZXCTRL2_ZCE9 field. */
#define HSADC_RD_ZXCTRL2_ZCE9(base) ((HSADC_ZXCTRL2_REG(base) & HSADC_ZXCTRL2_ZCE9_MASK) >> HSADC_ZXCTRL2_ZCE9_SHIFT)
#define HSADC_BRD_ZXCTRL2_ZCE9(base) (BME_UBFX16(&HSADC_ZXCTRL2_REG(base), HSADC_ZXCTRL2_ZCE9_SHIFT, HSADC_ZXCTRL2_ZCE9_WIDTH))

/*! @brief Set the ZCE9 field to a new value. */
#define HSADC_WR_ZXCTRL2_ZCE9(base, value) (HSADC_RMW_ZXCTRL2(base, HSADC_ZXCTRL2_ZCE9_MASK, HSADC_ZXCTRL2_ZCE9(value)))
#define HSADC_BWR_ZXCTRL2_ZCE9(base, value) (BME_BFI16(&HSADC_ZXCTRL2_REG(base), ((uint16_t)(value) << HSADC_ZXCTRL2_ZCE9_SHIFT), HSADC_ZXCTRL2_ZCE9_SHIFT, HSADC_ZXCTRL2_ZCE9_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_ZXCTRL2, field ZCE10[5:4] (RW)
 *
 * Values:
 * - 0b00 - Zero Crossing disabled
 * - 0b01 - Zero Crossing enabled for positive to negative sign change
 * - 0b10 - Zero Crossing enabled for negative to positive sign change
 * - 0b11 - Zero Crossing enabled for any sign change
 */
/*@{*/
/*! @brief Read current value of the HSADC_ZXCTRL2_ZCE10 field. */
#define HSADC_RD_ZXCTRL2_ZCE10(base) ((HSADC_ZXCTRL2_REG(base) & HSADC_ZXCTRL2_ZCE10_MASK) >> HSADC_ZXCTRL2_ZCE10_SHIFT)
#define HSADC_BRD_ZXCTRL2_ZCE10(base) (BME_UBFX16(&HSADC_ZXCTRL2_REG(base), HSADC_ZXCTRL2_ZCE10_SHIFT, HSADC_ZXCTRL2_ZCE10_WIDTH))

