ErichStyger/mcuoneclipse/Examples/KDS/TWR-KV58F220M/TWR_KV58F220M_PEx_2_SDKv2/SDK/platform/devices/MKV58F24/include/MKV58F24_extension.h
/*! @brief Set the ZCE10 field to a new value. */
#define HSADC_WR_ZXCTRL2_ZCE10(base, value) (HSADC_RMW_ZXCTRL2(base, HSADC_ZXCTRL2_ZCE10_MASK, HSADC_ZXCTRL2_ZCE10(value)))
#define HSADC_BWR_ZXCTRL2_ZCE10(base, value) (BME_BFI16(&HSADC_ZXCTRL2_REG(base), ((uint16_t)(value) << HSADC_ZXCTRL2_ZCE10_SHIFT), HSADC_ZXCTRL2_ZCE10_SHIFT, HSADC_ZXCTRL2_ZCE10_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_ZXCTRL2, field ZCE11[7:6] (RW)
 *
 * Values:
 * - 0b00 - Zero Crossing disabled
 * - 0b01 - Zero Crossing enabled for positive to negative sign change
 * - 0b10 - Zero Crossing enabled for negative to positive sign change
 * - 0b11 - Zero Crossing enabled for any sign change
 */
/*@{*/
/*! @brief Read current value of the HSADC_ZXCTRL2_ZCE11 field. */
#define HSADC_RD_ZXCTRL2_ZCE11(base) ((HSADC_ZXCTRL2_REG(base) & HSADC_ZXCTRL2_ZCE11_MASK) >> HSADC_ZXCTRL2_ZCE11_SHIFT)
#define HSADC_BRD_ZXCTRL2_ZCE11(base) (BME_UBFX16(&HSADC_ZXCTRL2_REG(base), HSADC_ZXCTRL2_ZCE11_SHIFT, HSADC_ZXCTRL2_ZCE11_WIDTH))

/*! @brief Set the ZCE11 field to a new value. */
#define HSADC_WR_ZXCTRL2_ZCE11(base, value) (HSADC_RMW_ZXCTRL2(base, HSADC_ZXCTRL2_ZCE11_MASK, HSADC_ZXCTRL2_ZCE11(value)))
#define HSADC_BWR_ZXCTRL2_ZCE11(base, value) (BME_BFI16(&HSADC_ZXCTRL2_REG(base), ((uint16_t)(value) << HSADC_ZXCTRL2_ZCE11_SHIFT), HSADC_ZXCTRL2_ZCE11_SHIFT, HSADC_ZXCTRL2_ZCE11_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_ZXCTRL2, field ZCE12[9:8] (RW)
 *
 * Values:
 * - 0b00 - Zero Crossing disabled
 * - 0b01 - Zero Crossing enabled for positive to negative sign change
 * - 0b10 - Zero Crossing enabled for negative to positive sign change
 * - 0b11 - Zero Crossing enabled for any sign change
 */
/*@{*/
/*! @brief Read current value of the HSADC_ZXCTRL2_ZCE12 field. */
#define HSADC_RD_ZXCTRL2_ZCE12(base) ((HSADC_ZXCTRL2_REG(base) & HSADC_ZXCTRL2_ZCE12_MASK) >> HSADC_ZXCTRL2_ZCE12_SHIFT)
#define HSADC_BRD_ZXCTRL2_ZCE12(base) (BME_UBFX16(&HSADC_ZXCTRL2_REG(base), HSADC_ZXCTRL2_ZCE12_SHIFT, HSADC_ZXCTRL2_ZCE12_WIDTH))

/*! @brief Set the ZCE12 field to a new value. */
#define HSADC_WR_ZXCTRL2_ZCE12(base, value) (HSADC_RMW_ZXCTRL2(base, HSADC_ZXCTRL2_ZCE12_MASK, HSADC_ZXCTRL2_ZCE12(value)))
#define HSADC_BWR_ZXCTRL2_ZCE12(base, value) (BME_BFI16(&HSADC_ZXCTRL2_REG(base), ((uint16_t)(value) << HSADC_ZXCTRL2_ZCE12_SHIFT), HSADC_ZXCTRL2_ZCE12_SHIFT, HSADC_ZXCTRL2_ZCE12_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_ZXCTRL2, field ZCE13[11:10] (RW)
 *
 * Values:
 * - 0b00 - Zero Crossing disabled
 * - 0b01 - Zero Crossing enabled for positive to negative sign change
 * - 0b10 - Zero Crossing enabled for negative to positive sign change
 * - 0b11 - Zero Crossing enabled for any sign change
 */
/*@{*/
/*! @brief Read current value of the HSADC_ZXCTRL2_ZCE13 field. */
#define HSADC_RD_ZXCTRL2_ZCE13(base) ((HSADC_ZXCTRL2_REG(base) & HSADC_ZXCTRL2_ZCE13_MASK) >> HSADC_ZXCTRL2_ZCE13_SHIFT)
#define HSADC_BRD_ZXCTRL2_ZCE13(base) (BME_UBFX16(&HSADC_ZXCTRL2_REG(base), HSADC_ZXCTRL2_ZCE13_SHIFT, HSADC_ZXCTRL2_ZCE13_WIDTH))

/*! @brief Set the ZCE13 field to a new value. */
#define HSADC_WR_ZXCTRL2_ZCE13(base, value) (HSADC_RMW_ZXCTRL2(base, HSADC_ZXCTRL2_ZCE13_MASK, HSADC_ZXCTRL2_ZCE13(value)))
#define HSADC_BWR_ZXCTRL2_ZCE13(base, value) (BME_BFI16(&HSADC_ZXCTRL2_REG(base), ((uint16_t)(value) << HSADC_ZXCTRL2_ZCE13_SHIFT), HSADC_ZXCTRL2_ZCE13_SHIFT, HSADC_ZXCTRL2_ZCE13_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_ZXCTRL2, field ZCE14[13:12] (RW)
 *
 * Values:
 * - 0b00 - Zero Crossing disabled
 * - 0b01 - Zero Crossing enabled for positive to negative sign change
 * - 0b10 - Zero Crossing enabled for negative to positive sign change
 * - 0b11 - Zero Crossing enabled for any sign change
 */
/*@{*/
/*! @brief Read current value of the HSADC_ZXCTRL2_ZCE14 field. */
#define HSADC_RD_ZXCTRL2_ZCE14(base) ((HSADC_ZXCTRL2_REG(base) & HSADC_ZXCTRL2_ZCE14_MASK) >> HSADC_ZXCTRL2_ZCE14_SHIFT)
#define HSADC_BRD_ZXCTRL2_ZCE14(base) (BME_UBFX16(&HSADC_ZXCTRL2_REG(base), HSADC_ZXCTRL2_ZCE14_SHIFT, HSADC_ZXCTRL2_ZCE14_WIDTH))

/*! @brief Set the ZCE14 field to a new value. */
#define HSADC_WR_ZXCTRL2_ZCE14(base, value) (HSADC_RMW_ZXCTRL2(base, HSADC_ZXCTRL2_ZCE14_MASK, HSADC_ZXCTRL2_ZCE14(value)))
#define HSADC_BWR_ZXCTRL2_ZCE14(base, value) (BME_BFI16(&HSADC_ZXCTRL2_REG(base), ((uint16_t)(value) << HSADC_ZXCTRL2_ZCE14_SHIFT), HSADC_ZXCTRL2_ZCE14_SHIFT, HSADC_ZXCTRL2_ZCE14_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_ZXCTRL2, field ZCE15[15:14] (RW)
 *
 * Values:
 * - 0b00 - Zero Crossing disabled
 * - 0b01 - Zero Crossing enabled for positive to negative sign change
 * - 0b10 - Zero Crossing enabled for negative to positive sign change
 * - 0b11 - Zero Crossing enabled for any sign change
 */
/*@{*/
/*! @brief Read current value of the HSADC_ZXCTRL2_ZCE15 field. */
#define HSADC_RD_ZXCTRL2_ZCE15(base) ((HSADC_ZXCTRL2_REG(base) & HSADC_ZXCTRL2_ZCE15_MASK) >> HSADC_ZXCTRL2_ZCE15_SHIFT)
#define HSADC_BRD_ZXCTRL2_ZCE15(base) (BME_UBFX16(&HSADC_ZXCTRL2_REG(base), HSADC_ZXCTRL2_ZCE15_SHIFT, HSADC_ZXCTRL2_ZCE15_WIDTH))

/*! @brief Set the ZCE15 field to a new value. */
#define HSADC_WR_ZXCTRL2_ZCE15(base, value) (HSADC_RMW_ZXCTRL2(base, HSADC_ZXCTRL2_ZCE15_MASK, HSADC_ZXCTRL2_ZCE15(value)))
#define HSADC_BWR_ZXCTRL2_ZCE15(base, value) (BME_BFI16(&HSADC_ZXCTRL2_REG(base), ((uint16_t)(value) << HSADC_ZXCTRL2_ZCE15_SHIFT), HSADC_ZXCTRL2_ZCE15_SHIFT, HSADC_ZXCTRL2_ZCE15_WIDTH))
/*@}*/

/*******************************************************************************
 * HSADC_CLIST1 - HSADC Channel List Register 1
 ******************************************************************************/

/*!
 * @brief HSADC_CLIST1 - HSADC Channel List Register 1 (RW)
 *
 * Reset value: 0x3210U
 *
 * This register configures the analog inputs to be sampled. For ANx6 and ANx7,
 * see Input Multiplex Function for more details.
 */
/*!
 * @name Constants and macros for entire HSADC_CLIST1 register
 */
/*@{*/
#define HSADC_RD_CLIST1(base)    (HSADC_CLIST1_REG(base))
#define HSADC_WR_CLIST1(base, value) (HSADC_CLIST1_REG(base) = (value))
#define HSADC_RMW_CLIST1(base, mask, value) (HSADC_WR_CLIST1(base, (HSADC_RD_CLIST1(base) & ~(mask)) | (value)))
#define HSADC_SET_CLIST1(base, value) (BME_OR16(&HSADC_CLIST1_REG(base), (uint16_t)(value)))
#define HSADC_CLR_CLIST1(base, value) (BME_AND16(&HSADC_CLIST1_REG(base), (uint16_t)(~(value))))
#define HSADC_TOG_CLIST1(base, value) (BME_XOR16(&HSADC_CLIST1_REG(base), (uint16_t)(value)))
/*@}*/

