ErichStyger/mcuoneclipse/Examples/KDS/TWR-KV58F220M/TWR_KV58F220M_PEx_2_SDKv2/SDK/platform/devices/MKV58F24/include/MKV58F24_extension.h
/*
 * Constants & macros for individual HSADC_CLIST1 bitfields
 */

/*!
 * @name Register HSADC_CLIST1, field SAMPLE0[3:0] (RW)
 *
 * This sample and all subsequent samples can be disabled by setting SDIS[0].
 *
 * Values:
 * - 0b0000 - Single Ended: ANA0, Differential: ANA0+, ANA1-
 * - 0b0001 - Single Ended: ANA1, Differential: ANA0+, ANA1-
 * - 0b0010 - Single Ended: ANA2, Differential: ANA2+, ANA3-
 * - 0b0011 - Single Ended: ANA3, Differential: ANA2+, ANA3-
 * - 0b0100 - Single Ended: ANA4, Differential: ANA4+, ANA5-
 * - 0b0101 - Single Ended: ANA5, Differential: ANA4+, ANA5-
 * - 0b0110 - Single Ended: ANA6, Differential: ANA6+, ANA7-
 * - 0b0111 - Single Ended: ANA7, Differential: ANA6+, ANA7-
 * - 0b1000 - Single Ended: ANB0, Differential: ANB0+, ANB1-
 * - 0b1001 - Single Ended: ANB1, Differential: ANB0+, ANB1-
 * - 0b1010 - Single Ended: ANB2, Differential: ANB2+, ANB3-
 * - 0b1011 - Single Ended: ANB3, Differential: ANB2+, ANB3-
 * - 0b1100 - Single Ended: ANB4, Differential: ANB4+, ANB5-
 * - 0b1101 - Single Ended: ANB5, Differential: ANB4+, ANB5-
 * - 0b1110 - Single Ended: ANB6, Differential: ANB6+, ANB7-
 * - 0b1111 - Single Ended: ANB7, Differential: ANB6+, ANB7-
 */
/*@{*/
/*! @brief Read current value of the HSADC_CLIST1_SAMPLE0 field. */
#define HSADC_RD_CLIST1_SAMPLE0(base) ((HSADC_CLIST1_REG(base) & HSADC_CLIST1_SAMPLE0_MASK) >> HSADC_CLIST1_SAMPLE0_SHIFT)
#define HSADC_BRD_CLIST1_SAMPLE0(base) (BME_UBFX16(&HSADC_CLIST1_REG(base), HSADC_CLIST1_SAMPLE0_SHIFT, HSADC_CLIST1_SAMPLE0_WIDTH))

/*! @brief Set the SAMPLE0 field to a new value. */
#define HSADC_WR_CLIST1_SAMPLE0(base, value) (HSADC_RMW_CLIST1(base, HSADC_CLIST1_SAMPLE0_MASK, HSADC_CLIST1_SAMPLE0(value)))
#define HSADC_BWR_CLIST1_SAMPLE0(base, value) (BME_BFI16(&HSADC_CLIST1_REG(base), ((uint16_t)(value) << HSADC_CLIST1_SAMPLE0_SHIFT), HSADC_CLIST1_SAMPLE0_SHIFT, HSADC_CLIST1_SAMPLE0_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_CLIST1, field SAMPLE1[7:4] (RW)
 *
 * This sample and all subsequent samples can be disabled by setting SDIS[1].
 *
 * Values:
 * - 0b0000 - Single Ended: ANA0, Differential: ANA0+, ANA1-
 * - 0b0001 - Single Ended: ANA1, Differential: ANA0+, ANA1-
 * - 0b0010 - Single Ended: ANA2, Differential: ANA2+, ANA3-
 * - 0b0011 - Single Ended: ANA3, Differential: ANA2+, ANA3-
 * - 0b0100 - Single Ended: ANA4, Differential: ANA4+, ANA5-
 * - 0b0101 - Single Ended: ANA5, Differential: ANA4+, ANA5-
 * - 0b0110 - Single Ended: ANA6, Differential: ANA6+, ANA7-
 * - 0b0111 - Single Ended: ANA7, Differential: ANA6+, ANA7-
 * - 0b1000 - Single Ended: ANB0, Differential: ANB0+, ANB1-
 * - 0b1001 - Single Ended: ANB1, Differential: ANB0+, ANB1-
 * - 0b1010 - Single Ended: ANB2, Differential: ANB2+, ANB3-
 * - 0b1011 - Single Ended: ANB3, Differential: ANB2+, ANB3-
 * - 0b1100 - Single Ended: ANB4, Differential: ANB4+, ANB5-
 * - 0b1101 - Single Ended: ANB5, Differential: ANB4+, ANB5-
 * - 0b1110 - Single Ended: ANB6, Differential: ANB6+, ANB7-
 * - 0b1111 - Single Ended: ANB7, Differential: ANB6+, ANB7-
 */
/*@{*/
/*! @brief Read current value of the HSADC_CLIST1_SAMPLE1 field. */
#define HSADC_RD_CLIST1_SAMPLE1(base) ((HSADC_CLIST1_REG(base) & HSADC_CLIST1_SAMPLE1_MASK) >> HSADC_CLIST1_SAMPLE1_SHIFT)
#define HSADC_BRD_CLIST1_SAMPLE1(base) (BME_UBFX16(&HSADC_CLIST1_REG(base), HSADC_CLIST1_SAMPLE1_SHIFT, HSADC_CLIST1_SAMPLE1_WIDTH))

/*! @brief Set the SAMPLE1 field to a new value. */
#define HSADC_WR_CLIST1_SAMPLE1(base, value) (HSADC_RMW_CLIST1(base, HSADC_CLIST1_SAMPLE1_MASK, HSADC_CLIST1_SAMPLE1(value)))
#define HSADC_BWR_CLIST1_SAMPLE1(base, value) (BME_BFI16(&HSADC_CLIST1_REG(base), ((uint16_t)(value) << HSADC_CLIST1_SAMPLE1_SHIFT), HSADC_CLIST1_SAMPLE1_SHIFT, HSADC_CLIST1_SAMPLE1_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_CLIST1, field SAMPLE2[11:8] (RW)
 *
 * This sample and all subsequent samples can be disabled by setting SDIS[2].
 *
 * Values:
 * - 0b0000 - Single Ended: ANA0, Differential: ANA0+, ANA1-
 * - 0b0001 - Single Ended: ANA1, Differential: ANA0+, ANA1-
 * - 0b0010 - Single Ended: ANA2, Differential: ANA2+, ANA3-
 * - 0b0011 - Single Ended: ANA3, Differential: ANA2+, ANA3-
 * - 0b0100 - Single Ended: ANA4, Differential: ANA4+, ANA5-
 * - 0b0101 - Single Ended: ANA5, Differential: ANA4+, ANA5-
 * - 0b0110 - Single Ended: ANA6, Differential: ANA6+, ANA7-
 * - 0b0111 - Single Ended: ANA7, Differential: ANA6+, ANA7-
 * - 0b1000 - Single Ended: ANB0, Differential: ANB0+, ANB1-
 * - 0b1001 - Single Ended: ANB1, Differential: ANB0+, ANB1-
 * - 0b1010 - Single Ended: ANB2, Differential: ANB2+, ANB3-
 * - 0b1011 - Single Ended: ANB3, Differential: ANB2+, ANB3-
 * - 0b1100 - Single Ended: ANB4, Differential: ANB4+, ANB5-
 * - 0b1101 - Single Ended: ANB5, Differential: ANB4+, ANB5-
 * - 0b1110 - Single Ended: ANB6, Differential: ANB6+, ANB7-
 * - 0b1111 - Single Ended: ANB7, Differential: ANB6+, ANB7-
 */
/*@{*/
/*! @brief Read current value of the HSADC_CLIST1_SAMPLE2 field. */
#define HSADC_RD_CLIST1_SAMPLE2(base) ((HSADC_CLIST1_REG(base) & HSADC_CLIST1_SAMPLE2_MASK) >> HSADC_CLIST1_SAMPLE2_SHIFT)
#define HSADC_BRD_CLIST1_SAMPLE2(base) (BME_UBFX16(&HSADC_CLIST1_REG(base), HSADC_CLIST1_SAMPLE2_SHIFT, HSADC_CLIST1_SAMPLE2_WIDTH))

/*! @brief Set the SAMPLE2 field to a new value. */
#define HSADC_WR_CLIST1_SAMPLE2(base, value) (HSADC_RMW_CLIST1(base, HSADC_CLIST1_SAMPLE2_MASK, HSADC_CLIST1_SAMPLE2(value)))
#define HSADC_BWR_CLIST1_SAMPLE2(base, value) (BME_BFI16(&HSADC_CLIST1_REG(base), ((uint16_t)(value) << HSADC_CLIST1_SAMPLE2_SHIFT), HSADC_CLIST1_SAMPLE2_SHIFT, HSADC_CLIST1_SAMPLE2_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_CLIST1, field SAMPLE3[15:12] (RW)
 *
 * This sample and all subsequent samples can be disabled by setting SDIS[DS3].
 *
 * Values:
 * - 0b0000 - Single Ended: ANA0, Differential: ANA0+, ANA1-
 * - 0b0001 - Single Ended: ANA1, Differential: ANA0+, ANA1-
 * - 0b0010 - Single Ended: ANA2, Differential: ANA2+, ANA3-
 * - 0b0011 - Single Ended: ANA3, Differential: ANA2+, ANA3-
 * - 0b0100 - Single Ended: ANA4, Differential: ANA4+, ANA5-
 * - 0b0101 - Single Ended: ANA5, Differential: ANA4+, ANA5-
 * - 0b0110 - Single Ended: ANA6, Differential: ANA6+, ANA7-
 * - 0b0111 - Single Ended: ANA7, Differential: ANA6+, ANA7-
 * - 0b1000 - Single Ended: ANB0, Differential: ANB0+, ANB1-
 * - 0b1001 - Single Ended: ANB1, Differential: ANB0+, ANB1-
 * - 0b1010 - Single Ended: ANB2, Differential: ANB2+, ANB3-
 * - 0b1011 - Single Ended: ANB3, Differential: ANB2+, ANB3-
 * - 0b1100 - Single Ended: ANB4, Differential: ANB4+, ANB5-
 * - 0b1101 - Single Ended: ANB5, Differential: ANB4+, ANB5-
 * - 0b1110 - Single Ended: ANB6, Differential: ANB6+, ANB7-
 * - 0b1111 - Single Ended: ANB7, Differential: ANB6+, ANB7-
 */
/*@{*/
/*! @brief Read current value of the HSADC_CLIST1_SAMPLE3 field. */
#define HSADC_RD_CLIST1_SAMPLE3(base) ((HSADC_CLIST1_REG(base) & HSADC_CLIST1_SAMPLE3_MASK) >> HSADC_CLIST1_SAMPLE3_SHIFT)
#define HSADC_BRD_CLIST1_SAMPLE3(base) (BME_UBFX16(&HSADC_CLIST1_REG(base), HSADC_CLIST1_SAMPLE3_SHIFT, HSADC_CLIST1_SAMPLE3_WIDTH))

/*! @brief Set the SAMPLE3 field to a new value. */
#define HSADC_WR_CLIST1_SAMPLE3(base, value) (HSADC_RMW_CLIST1(base, HSADC_CLIST1_SAMPLE3_MASK, HSADC_CLIST1_SAMPLE3(value)))
#define HSADC_BWR_CLIST1_SAMPLE3(base, value) (BME_BFI16(&HSADC_CLIST1_REG(base), ((uint16_t)(value) << HSADC_CLIST1_SAMPLE3_SHIFT), HSADC_CLIST1_SAMPLE3_SHIFT, HSADC_CLIST1_SAMPLE3_WIDTH))
/*@}*/

