ErichStyger/mcuoneclipse/Examples/KDS/TWR-KV58F220M/TWR_KV58F220M_PEx_2_SDKv2/SDK/platform/devices/MKV58F24/include/MKV58F24_extension.h
/*
 * Constants & macros for individual HSADC_STAT bitfields
 */

/*!
 * @name Register HSADC_STAT, field CALONA[0] (RO)
 *
 * Values:
 * - 0b0 - Calibration is not running
 * - 0b1 - ADCA is running calibration conversions
 */
/*@{*/
/*! @brief Read current value of the HSADC_STAT_CALONA field. */
#define HSADC_RD_STAT_CALONA(base) ((HSADC_STAT_REG(base) & HSADC_STAT_CALONA_MASK) >> HSADC_STAT_CALONA_SHIFT)
#define HSADC_BRD_STAT_CALONA(base) (BME_UBFX16(&HSADC_STAT_REG(base), HSADC_STAT_CALONA_SHIFT, HSADC_STAT_CALONA_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_STAT, field CALONB[1] (RO)
 *
 * Values:
 * - 0b0 - Calibration is not running
 * - 0b1 - ADCB is running calibration conversions
 */
/*@{*/
/*! @brief Read current value of the HSADC_STAT_CALONB field. */
#define HSADC_RD_STAT_CALONB(base) ((HSADC_STAT_REG(base) & HSADC_STAT_CALONB_MASK) >> HSADC_STAT_CALONB_SHIFT)
#define HSADC_BRD_STAT_CALONB(base) (BME_UBFX16(&HSADC_STAT_REG(base), HSADC_STAT_CALONB_SHIFT, HSADC_STAT_CALONB_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_STAT, field DUMMYA[2] (RO)
 *
 * Values:
 * - 0b0 - Dummy conversion is not running
 * - 0b1 - Dummy conversion is running on ADCA
 */
/*@{*/
/*! @brief Read current value of the HSADC_STAT_DUMMYA field. */
#define HSADC_RD_STAT_DUMMYA(base) ((HSADC_STAT_REG(base) & HSADC_STAT_DUMMYA_MASK) >> HSADC_STAT_DUMMYA_SHIFT)
#define HSADC_BRD_STAT_DUMMYA(base) (BME_UBFX16(&HSADC_STAT_REG(base), HSADC_STAT_DUMMYA_SHIFT, HSADC_STAT_DUMMYA_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_STAT, field DUMMYB[3] (RO)
 *
 * Values:
 * - 0b0 - Dummy conversion is not running
 * - 0b1 - Dummy conversion is running on ADCB
 */
/*@{*/
/*! @brief Read current value of the HSADC_STAT_DUMMYB field. */
#define HSADC_RD_STAT_DUMMYB(base) ((HSADC_STAT_REG(base) & HSADC_STAT_DUMMYB_MASK) >> HSADC_STAT_DUMMYB_SHIFT)
#define HSADC_BRD_STAT_DUMMYB(base) (BME_UBFX16(&HSADC_STAT_REG(base), HSADC_STAT_DUMMYB_SHIFT, HSADC_STAT_DUMMYB_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_STAT, field EOCALIA[4] (W1C)
 *
 * It is asserted when requested calibrations (single, differential) are ended.
 * If just one type is requested then this flag is asserted at the end of that
 * calibration. It is cleared by writing 1 in the field.
 *
 * Values:
 * - 0b0 - Calibration is not finished.
 * - 0b1 - Calibration is finished on ADCA. The IRQ occurs if CALIB[EOCALIEA] is
 *     asserted.
 */
/*@{*/
/*! @brief Read current value of the HSADC_STAT_EOCALIA field. */
#define HSADC_RD_STAT_EOCALIA(base) ((HSADC_STAT_REG(base) & HSADC_STAT_EOCALIA_MASK) >> HSADC_STAT_EOCALIA_SHIFT)
#define HSADC_BRD_STAT_EOCALIA(base) (BME_UBFX16(&HSADC_STAT_REG(base), HSADC_STAT_EOCALIA_SHIFT, HSADC_STAT_EOCALIA_WIDTH))

/*! @brief Set the EOCALIA field to a new value. */
#define HSADC_WR_STAT_EOCALIA(base, value) (HSADC_RMW_STAT(base, (HSADC_STAT_EOCALIA_MASK | HSADC_STAT_EOCALIB_MASK | HSADC_STAT_EOSIA_MASK | HSADC_STAT_EOSIB_MASK), HSADC_STAT_EOCALIA(value)))
#define HSADC_BWR_STAT_EOCALIA(base, value) (BME_BFI16(&HSADC_STAT_REG(base), ((uint16_t)(value) << HSADC_STAT_EOCALIA_SHIFT), HSADC_STAT_EOCALIA_SHIFT, HSADC_STAT_EOCALIA_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_STAT, field EOCALIB[5] (W1C)
 *
 * It is asserted when requested calibrations (single, differential) are ended.
 * If just one type is requested then this flag is asserted at the end of that
 * calibration. It is cleared by writing 1 in the field.
 *
 * Values:
 * - 0b0 - Calibration is not finished.
 * - 0b1 - Calibration is finished on ADCB. The IRQ occurs if CALIB[EOCALIEB] is
 *     asserted.
 */
/*@{*/
/*! @brief Read current value of the HSADC_STAT_EOCALIB field. */
#define HSADC_RD_STAT_EOCALIB(base) ((HSADC_STAT_REG(base) & HSADC_STAT_EOCALIB_MASK) >> HSADC_STAT_EOCALIB_SHIFT)
#define HSADC_BRD_STAT_EOCALIB(base) (BME_UBFX16(&HSADC_STAT_REG(base), HSADC_STAT_EOCALIB_SHIFT, HSADC_STAT_EOCALIB_WIDTH))

/*! @brief Set the EOCALIB field to a new value. */
#define HSADC_WR_STAT_EOCALIB(base, value) (HSADC_RMW_STAT(base, (HSADC_STAT_EOCALIB_MASK | HSADC_STAT_EOCALIA_MASK | HSADC_STAT_EOSIA_MASK | HSADC_STAT_EOSIB_MASK), HSADC_STAT_EOCALIB(value)))
#define HSADC_BWR_STAT_EOCALIB(base, value) (BME_BFI16(&HSADC_STAT_REG(base), ((uint16_t)(value) << HSADC_STAT_EOCALIB_SHIFT), HSADC_STAT_EOCALIB_SHIFT, HSADC_STAT_EOCALIB_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_STAT, field HLMTI[8] (RO)
 *
 * If the respective high limit register is enabled by having a value other than
 * 7FF8h, high limit checking is enabled. This interrupt asserts at the
 * completion of an individual conversion which may or may not be the end of a scan. This
 * bit is cleared by writing a "1" to all active HILIMSTAT[HLS] bits.
 *
 * Values:
 * - 0b0 - No high limit interrupt request
 * - 0b1 - High limit exceeded, IRQ pending if CTRL1[HLMTIE] is set
 */
/*@{*/
/*! @brief Read current value of the HSADC_STAT_HLMTI field. */
#define HSADC_RD_STAT_HLMTI(base) ((HSADC_STAT_REG(base) & HSADC_STAT_HLMTI_MASK) >> HSADC_STAT_HLMTI_SHIFT)
#define HSADC_BRD_STAT_HLMTI(base) (BME_UBFX16(&HSADC_STAT_REG(base), HSADC_STAT_HLMTI_SHIFT, HSADC_STAT_HLMTI_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_STAT, field LLMTI[9] (RO)
 *
 * If the respective low limit register is enabled by having a value other than
 * 0000h, low limit checking is enabled. This interrupt asserts at the completion
 * of an individual conversion which may or may not be the end of a scan. This
 * bit is cleared by writing a "1" to all active LOLIMSTAT[LLS] bits.
 *
 * Values:
 * - 0b0 - No low limit interrupt request
 * - 0b1 - Low limit exceeded, IRQ pending if CTRL1[LLMTIE] is set
 */
/*@{*/
/*! @brief Read current value of the HSADC_STAT_LLMTI field. */
#define HSADC_RD_STAT_LLMTI(base) ((HSADC_STAT_REG(base) & HSADC_STAT_LLMTI_MASK) >> HSADC_STAT_LLMTI_SHIFT)
#define HSADC_BRD_STAT_LLMTI(base) (BME_UBFX16(&HSADC_STAT_REG(base), HSADC_STAT_LLMTI_SHIFT, HSADC_STAT_LLMTI_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_STAT, field ZCI[10] (RO)
 *
 * If the respective offset register is configured by having a value greater
 * than 0000h, zero crossing checking is enabled. If the offset register is
 * programmed with 7FF8h, the result will always be less than or equal to zero. On the
 * other hand, if 0000h is programmed into the offset register, the result will
 * always be greater than or equal to zero, and no zero crossing can occur because
 * the sign of the result will not change. This interrupt asserts at the
 * completion of an individual conversion which may or may not be the end of a scan. This
 * bit is cleared by writing a "1" to all active ZXSTAT[ZCS] bits.
 *
 * Values:
 * - 0b0 - No zero crossing interrupt request
 * - 0b1 - Zero crossing encountered, IRQ pending if CTRL1[ZCIE] is set
 */
/*@{*/
/*! @brief Read current value of the HSADC_STAT_ZCI field. */
#define HSADC_RD_STAT_ZCI(base) ((HSADC_STAT_REG(base) & HSADC_STAT_ZCI_MASK) >> HSADC_STAT_ZCI_SHIFT)
#define HSADC_BRD_STAT_ZCI(base) (BME_UBFX16(&HSADC_STAT_REG(base), HSADC_STAT_ZCI_SHIFT, HSADC_STAT_ZCI_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_STAT, field EOSIA[11] (W1C)
 *
 * This bit indicates whether a scan of analog inputs have been completed since
 * the last read of the status register or since a reset. This bit is cleared by
 * writing a one to it. This bit cannot be set by software. STAT[EOSIA] is the
 * preferred bit to poll for scan completion if interrupts are not enabled. In
 * looping scan modes, this interrupt is triggered at the completion of each
 * iteration of the loop. This interrupt is triggered upon the completion of any scan
 * except for the completion of a B converter scan in non-simultaneous parallel scan
 * modes.
 *
 * Values:
 * - 0b0 - A scan cycle has not been completed, no end of scan IRQ pending
 * - 0b1 - A scan cycle has been completed, end of scan IRQ pending
 */
/*@{*/
/*! @brief Read current value of the HSADC_STAT_EOSIA field. */
#define HSADC_RD_STAT_EOSIA(base) ((HSADC_STAT_REG(base) & HSADC_STAT_EOSIA_MASK) >> HSADC_STAT_EOSIA_SHIFT)
#define HSADC_BRD_STAT_EOSIA(base) (BME_UBFX16(&HSADC_STAT_REG(base), HSADC_STAT_EOSIA_SHIFT, HSADC_STAT_EOSIA_WIDTH))

/*! @brief Set the EOSIA field to a new value. */
#define HSADC_WR_STAT_EOSIA(base, value) (HSADC_RMW_STAT(base, (HSADC_STAT_EOSIA_MASK | HSADC_STAT_EOCALIA_MASK | HSADC_STAT_EOCALIB_MASK | HSADC_STAT_EOSIB_MASK), HSADC_STAT_EOSIA(value)))
#define HSADC_BWR_STAT_EOSIA(base, value) (BME_BFI16(&HSADC_STAT_REG(base), ((uint16_t)(value) << HSADC_STAT_EOSIA_SHIFT), HSADC_STAT_EOSIA_SHIFT, HSADC_STAT_EOSIA_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_STAT, field EOSIB[12] (W1C)
 *
 * This bit indicates whether a scan of analog inputs have been completed since
 * the last read of the status register or since a reset. This bit is cleared by
 * writing a one to it. This bit cannot be set by software. In looping scan
 * modes, this interrupt is triggered at the completion of each iteration of the loop.
 * This interrupt is triggered only by the completion of a B converter scan in
 * non-simultaneous parallel scan modes.
 *
 * Values:
 * - 0b0 - A scan cycle has not been completed, no end of scan IRQ pending
 * - 0b1 - A scan cycle has been completed, end of scan IRQ pending
 */
/*@{*/
/*! @brief Read current value of the HSADC_STAT_EOSIB field. */
#define HSADC_RD_STAT_EOSIB(base) ((HSADC_STAT_REG(base) & HSADC_STAT_EOSIB_MASK) >> HSADC_STAT_EOSIB_SHIFT)
#define HSADC_BRD_STAT_EOSIB(base) (BME_UBFX16(&HSADC_STAT_REG(base), HSADC_STAT_EOSIB_SHIFT, HSADC_STAT_EOSIB_WIDTH))

/*! @brief Set the EOSIB field to a new value. */
#define HSADC_WR_STAT_EOSIB(base, value) (HSADC_RMW_STAT(base, (HSADC_STAT_EOSIB_MASK | HSADC_STAT_EOCALIA_MASK | HSADC_STAT_EOCALIB_MASK | HSADC_STAT_EOSIA_MASK), HSADC_STAT_EOSIB(value)))
#define HSADC_BWR_STAT_EOSIB(base, value) (BME_BFI16(&HSADC_STAT_REG(base), ((uint16_t)(value) << HSADC_STAT_EOSIB_SHIFT), HSADC_STAT_EOSIB_SHIFT, HSADC_STAT_EOSIB_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_STAT, field CIPB[14] (RO)
 *
 * This bit indicates whether a scan is in progress. It also indicates if the
 * HSADC is running a dummy conversion or it is running a calibration procedure.
 * This refers only to a B converter scan / activity in non-simultaneous parallel
 * scan modes.
 *
 * Values:
 * - 0b0 - Idle state
 * - 0b1 - A scan cycle is in progress. The HSADC will ignore all sync pulses or
 *     start commands
 */
/*@{*/
/*! @brief Read current value of the HSADC_STAT_CIPB field. */
#define HSADC_RD_STAT_CIPB(base) ((HSADC_STAT_REG(base) & HSADC_STAT_CIPB_MASK) >> HSADC_STAT_CIPB_SHIFT)
#define HSADC_BRD_STAT_CIPB(base) (BME_UBFX16(&HSADC_STAT_REG(base), HSADC_STAT_CIPB_SHIFT, HSADC_STAT_CIPB_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_STAT, field CIPA[15] (RO)
 *
 * This bit indicates whether a scan is in progress. It also indicates if the
 * HSADC is running a dummy conversion or it is running a calibration procedure.
 * This refers to any scan / activity except a B converter scan in non-simultaneous
 * parallel scan modes.
 *
 * Values:
 * - 0b0 - Idle state
 * - 0b1 - A scan cycle is in progress. The HSADC will ignore all sync pulses or
 *     start commands
 */
/*@{*/
/*! @brief Read current value of the HSADC_STAT_CIPA field. */
#define HSADC_RD_STAT_CIPA(base) ((HSADC_STAT_REG(base) & HSADC_STAT_CIPA_MASK) >> HSADC_STAT_CIPA_SHIFT)
#define HSADC_BRD_STAT_CIPA(base) (BME_UBFX16(&HSADC_STAT_REG(base), HSADC_STAT_CIPA_SHIFT, HSADC_STAT_CIPA_WIDTH))
/*@}*/

