ErichStyger/mcuoneclipse/Examples/KDS/TWR-KV58F220M/TWR_KV58F220M_PEx_2_SDKv2/SDK/platform/devices/MKV58F24/include/MKV58F24_extension.h
/*******************************************************************************
 * HSADC_OFFST - HSADC Offset Register
 ******************************************************************************/

/*!
 * @brief HSADC_OFFST - HSADC Offset Register (RW)
 *
 * Reset value: 0x0000U
 *
 * The value of the OFFSTn register is used to correct the ADC result before it
 * is stored in the RSLTn register. The offset value is subtracted from the raw
 * ADC result. To obtain unsigned results, program the respective offset register
 * with a value of $0000, thus giving a result range of $0000 to $7FF8.
 */
/*!
 * @name Constants and macros for entire HSADC_OFFST register
 */
/*@{*/
#define HSADC_RD_OFFST(base, index) (HSADC_OFFST_REG(base, index))
#define HSADC_WR_OFFST(base, index, value) (HSADC_OFFST_REG(base, index) = (value))
#define HSADC_RMW_OFFST(base, index, mask, value) (HSADC_WR_OFFST(base, index, (HSADC_RD_OFFST(base, index) & ~(mask)) | (value)))
#define HSADC_SET_OFFST(base, index, value) (BME_OR16(&HSADC_OFFST_REG(base, index), (uint16_t)(value)))
#define HSADC_CLR_OFFST(base, index, value) (BME_AND16(&HSADC_OFFST_REG(base, index), (uint16_t)(~(value))))
#define HSADC_TOG_OFFST(base, index, value) (BME_XOR16(&HSADC_OFFST_REG(base, index), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual HSADC_OFFST bitfields
 */

/*!
 * @name Register HSADC_OFFST, field OFFSET[14:3] (RW)
 */
/*@{*/
/*! @brief Read current value of the HSADC_OFFST_OFFSET field. */
#define HSADC_RD_OFFST_OFFSET(base, index) ((HSADC_OFFST_REG(base, index) & HSADC_OFFST_OFFSET_MASK) >> HSADC_OFFST_OFFSET_SHIFT)
#define HSADC_BRD_OFFST_OFFSET(base, index) (HSADC_RD_OFFST_OFFSET(base, index))

/*! @brief Set the OFFSET field to a new value. */
#define HSADC_WR_OFFST_OFFSET(base, index, value) (HSADC_RMW_OFFST(base, index, HSADC_OFFST_OFFSET_MASK, HSADC_OFFST_OFFSET(value)))
#define HSADC_BWR_OFFST_OFFSET(base, index, value) (HSADC_WR_OFFST_OFFSET(base, index, value))
/*@}*/

/*******************************************************************************
 * HSADC_PWR - HSADC Power Control Register
 ******************************************************************************/

/*!
 * @brief HSADC_PWR - HSADC Power Control Register (RW)
 *
 * Reset value: 0x1D27U
 *
 * This register controls the power management features of the HSADC module.
 * There are individual manual power down controls for the two ADC converters and
 * their internal voltage reference generators. There are also five distinct power
 * modes. The following terms are used to describe power modes and their related
 * controls. Power down state Each converter and voltage reference generator can
 * individually be put into a power down state. When powered down, the unit
 * consumes no power. Results of scans referencing a powered down converter are
 * undefined. At least one converter must be powered up to use the HSADC module. Manual
 * power down controls Each converter and voltage reference generator have a
 * manual power control bit capable of putting that component into the power down
 * state. Converters have other mechanisms that can automatically put them into the
 * power down state. Idle state The HSADC module is idle when neither of the two
 * converters has a scan in process. Active state The HSADC module is active
 * when at least one of the two converters has a scan in process. Startup delay
 * Auto-powerdown and auto-standby power modes cause a startup delay when the HSADC
 * module goes between the power down and active states to allow time to power up
 * the internal ADC LDO. Dummy conversion or calibration delay Auto-powerdown and
 * auto-standby power modes cause a dummy conversion execution delay or a
 * calibration execution delay after the HSADC module is powered up.
 */
/*!
 * @name Constants and macros for entire HSADC_PWR register
 */
/*@{*/
#define HSADC_RD_PWR(base)       (HSADC_PWR_REG(base))
#define HSADC_WR_PWR(base, value) (HSADC_PWR_REG(base) = (value))
#define HSADC_RMW_PWR(base, mask, value) (HSADC_WR_PWR(base, (HSADC_RD_PWR(base) & ~(mask)) | (value)))
#define HSADC_SET_PWR(base, value) (BME_OR16(&HSADC_PWR_REG(base), (uint16_t)(value)))
#define HSADC_CLR_PWR(base, value) (BME_AND16(&HSADC_PWR_REG(base), (uint16_t)(~(value))))
#define HSADC_TOG_PWR(base, value) (BME_XOR16(&HSADC_PWR_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual HSADC_PWR bitfields
 */

/*!
 * @name Register HSADC_PWR, field PDA[0] (RW)
 *
 * This bit forces ADC converter A to power down. Asserting this bit powers down
 * converter A immediately, except when it is in power-up phase. The results of
 * a scan using converter A will be invalid while PWR[PDA] is asserted. When
 * PWR[PDA] is cleared, converter A is either continuously powered up (PWR[APD] = 0)
 * or automatically powered up when needed (PWR[APD]=1). When clearing this bit
 * in any power mode except auto-powerdown (PWR[APD]=1) or auto-standby
 * (PWR[ASB]=1), wait (PWR[PUDELAY] x 32) ADC clock cycles before initiating a scan to
 * stabilize power levels within the converter. PWR[PSTSA] can be polled to determine
 * when the (PWR[PUDELAY] x 32) time has elapsed. Failure to follow this
 * procedure can result in loss of accuracy of the calibration procedure and of the
 * initial samples. During power-up delay phase if the stop request (STOPA) is set,
 * the power-down request is only recognized at the end of this phase, after the
 * ADC reset is applied (two ADC clock cycles).
 *
 * Values:
 * - 0b0 - Power Up ADC converter A
 * - 0b1 - Power Down ADC converter A
 */
/*@{*/
/*! @brief Read current value of the HSADC_PWR_PDA field. */
#define HSADC_RD_PWR_PDA(base) ((HSADC_PWR_REG(base) & HSADC_PWR_PDA_MASK) >> HSADC_PWR_PDA_SHIFT)
#define HSADC_BRD_PWR_PDA(base) (BME_UBFX16(&HSADC_PWR_REG(base), HSADC_PWR_PDA_SHIFT, HSADC_PWR_PDA_WIDTH))

/*! @brief Set the PDA field to a new value. */
#define HSADC_WR_PWR_PDA(base, value) (HSADC_RMW_PWR(base, HSADC_PWR_PDA_MASK, HSADC_PWR_PDA(value)))
#define HSADC_BWR_PWR_PDA(base, value) (BME_BFI16(&HSADC_PWR_REG(base), ((uint16_t)(value) << HSADC_PWR_PDA_SHIFT), HSADC_PWR_PDA_SHIFT, HSADC_PWR_PDA_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_PWR, field PDB[1] (RW)
 *
 * This bit forces ADC converter B to power down. Asserting this bit powers down
 * converter B immediately, except when it is in power-up phase. The results of
 * a scan using converter B will be invalid while PWR[PDB] is asserted. When
 * PWR[PDB] is cleared, converter B is either continuously powered up (PWR[APD] = 0)
 * or automatically powered up when needed (PWR[APD]=1). When clearing this bit
 * in any power mode except auto-powerdown (PWR[APD]=1) or auto-standby
 * (PWR[ASB]=1), wait (PWR[PUDELAY] x 32) ADC clock cycles before initiating a scan to
 * stabilize power levels within the converter. PWR[PSTSB] can be polled to determine
 * when the (PWR[PUDELAY] x 32) time has elapsed. Failure to follow this
 * procedure can result in loss of accuracy of the calibration procedure and of the
 * initial samples. During power-up delay phase if the stop request (STOPB) is set,
 * the power-down request is only recognized at the end of this phase, after the
 * ADC reset is applied (two ADC clock cycles).
 *
 * Values:
 * - 0b0 - Power Up ADC converter B
 * - 0b1 - Power Down ADC converter B
 */
/*@{*/
/*! @brief Read current value of the HSADC_PWR_PDB field. */
#define HSADC_RD_PWR_PDB(base) ((HSADC_PWR_REG(base) & HSADC_PWR_PDB_MASK) >> HSADC_PWR_PDB_SHIFT)
#define HSADC_BRD_PWR_PDB(base) (BME_UBFX16(&HSADC_PWR_REG(base), HSADC_PWR_PDB_SHIFT, HSADC_PWR_PDB_WIDTH))

/*! @brief Set the PDB field to a new value. */
#define HSADC_WR_PWR_PDB(base, value) (HSADC_RMW_PWR(base, HSADC_PWR_PDB_MASK, HSADC_PWR_PDB(value)))
#define HSADC_BWR_PWR_PDB(base, value) (BME_BFI16(&HSADC_PWR_REG(base), ((uint16_t)(value) << HSADC_PWR_PDB_SHIFT), HSADC_PWR_PDB_SHIFT, HSADC_PWR_PDB_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_PWR, field APD[3] (RW)
 *
 * Auto-powerdown mode powers down converters when not in use for a scan.
 * PWR[APD] takes precedence over PWR[ASB]. When a scan is started in PWR[APD] mode, a
 * delay of (PWR[PUDELAY] x 32) ADC clock cycles is imposed during which the
 * needed converter(s) are powered up. The HSADC then initiates a scan equivalent to
 * that done when PWR[APD] is not active. When the scan is completed, the
 * converter(s) are powered down again. If PWR[ASB] or PWR[APD] are asserted while a
 * scan is in progress, that scan is unaffected and the HSADC waits to enter its low
 * power state until after all conversions are complete and both ADCs are idle
 * (for sequential or parallel simultaneous scan modes). PWR[ASB] and PWR[APD] are
 * not useful in looping modes. The continuous nature of scanning means that the
 * low power state can never be entered.
 *
 * Values:
 * - 0b0 - Auto Powerdown Mode is not active
 * - 0b1 - Auto Powerdown Mode is active
 */
/*@{*/
/*! @brief Read current value of the HSADC_PWR_APD field. */
#define HSADC_RD_PWR_APD(base) ((HSADC_PWR_REG(base) & HSADC_PWR_APD_MASK) >> HSADC_PWR_APD_SHIFT)
#define HSADC_BRD_PWR_APD(base) (BME_UBFX16(&HSADC_PWR_REG(base), HSADC_PWR_APD_SHIFT, HSADC_PWR_APD_WIDTH))

/*! @brief Set the APD field to a new value. */
#define HSADC_WR_PWR_APD(base, value) (HSADC_RMW_PWR(base, HSADC_PWR_APD_MASK, HSADC_PWR_APD(value)))
#define HSADC_BWR_PWR_APD(base, value) (BME_BFI16(&HSADC_PWR_REG(base), ((uint16_t)(value) << HSADC_PWR_APD_SHIFT), HSADC_PWR_APD_SHIFT, HSADC_PWR_APD_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_PWR, field PUDELAY[9:4] (RW)
 *
 * This 6-bit field multiplied by 32 determines the number of ADC clocks
 * provided to power up an ADC converter (after setting PWR[PDA] and PWR[PDB] to 0)
 * before allowing a scan to start. It also determines the number of ADC clocks of
 * delay provided in auto-powerdown (APD) and auto-standby (ASB) modes between when
 * the ADC goes from the idle to active state and when the scan is allowed to
 * start. The default value is 18 that means a power-up time of about 18x32 ADC
 * clocks. Accuracy of the initial conversions in a scan will be degraded if
 * PWR[PUDELAY] is set to a too small value. PWR[PUDELAY] defaults to a value that is
 * typically sufficient for any power mode. The latency of a scan can be reduced by
 * reducing PWR[PUDELAY] to the lowest value for which accuracy is not degraded.
 * Refer to the data sheet for further details.
 */
/*@{*/
/*! @brief Read current value of the HSADC_PWR_PUDELAY field. */
#define HSADC_RD_PWR_PUDELAY(base) ((HSADC_PWR_REG(base) & HSADC_PWR_PUDELAY_MASK) >> HSADC_PWR_PUDELAY_SHIFT)
#define HSADC_BRD_PWR_PUDELAY(base) (BME_UBFX16(&HSADC_PWR_REG(base), HSADC_PWR_PUDELAY_SHIFT, HSADC_PWR_PUDELAY_WIDTH))

/*! @brief Set the PUDELAY field to a new value. */
#define HSADC_WR_PWR_PUDELAY(base, value) (HSADC_RMW_PWR(base, HSADC_PWR_PUDELAY_MASK, HSADC_PWR_PUDELAY(value)))
#define HSADC_BWR_PWR_PUDELAY(base, value) (BME_BFI16(&HSADC_PWR_REG(base), ((uint16_t)(value) << HSADC_PWR_PUDELAY_SHIFT), HSADC_PWR_PUDELAY_SHIFT, HSADC_PWR_PUDELAY_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_PWR, field PSTSA[10] (RO)
 *
 * This bit is asserted immediately following a write of "1" to PWR[PDA]. It is
 * de-asserted (PWR[PUDELAY] x 32) ADC clock cycles after a write of "0" to
 * PWR[PDA] if PWR[APD] is "0". This bit can be read as a status bit to determine when
 * the ADC is ready for operation. During auto-powerdown mode, this bit
 * indicates the current powered state of converter A.
 *
 * Values:
 * - 0b0 - ADC Converter A is currently powered up
 * - 0b1 - ADC Converter A is currently powered down
 */
/*@{*/
/*! @brief Read current value of the HSADC_PWR_PSTSA field. */
#define HSADC_RD_PWR_PSTSA(base) ((HSADC_PWR_REG(base) & HSADC_PWR_PSTSA_MASK) >> HSADC_PWR_PSTSA_SHIFT)
#define HSADC_BRD_PWR_PSTSA(base) (BME_UBFX16(&HSADC_PWR_REG(base), HSADC_PWR_PSTSA_SHIFT, HSADC_PWR_PSTSA_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_PWR, field PSTSB[11] (RO)
 *
 * This bit is asserted immediately following a write of "1" to PWR[PDB]. It is
 * de-asserted (PWR[PUDELAY] x 32) ADC clock cycles after a write of "0" to
 * PWR[PDB] if PWR[APD] is "0". This bit can be read as a status bit to determine when
 * the ADC is ready for operation. During auto-powerdown mode, this bit
 * indicates the current powered state of converter B.
 *
 * Values:
 * - 0b0 - ADC Converter B is currently powered up
 * - 0b1 - ADC Converter B is currently powered down
 */
/*@{*/
/*! @brief Read current value of the HSADC_PWR_PSTSB field. */
#define HSADC_RD_PWR_PSTSB(base) ((HSADC_PWR_REG(base) & HSADC_PWR_PSTSB_MASK) >> HSADC_PWR_PSTSB_SHIFT)
#define HSADC_BRD_PWR_PSTSB(base) (BME_UBFX16(&HSADC_PWR_REG(base), HSADC_PWR_PSTSB_SHIFT, HSADC_PWR_PSTSB_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_PWR, field ASB[15] (RW)
 *
 * This bit selects auto-standby mode. PWR[ASB] is ignored if PWR[APD] is 1.
 * When the HSADC is idle, auto-standby mode selects the auto-standby clock as the
 * HSADC clock source and puts the converters into standby mode. At the start of
 * any scan, the conversion clock is selected as the ADC clock and then a delay of
 * (PWR[PUDELAY] x32) ADC clock cycles and one ADC dummy conversion or the
 * calibration cycle are imposed for ADC levels to stabilize. After this delay, the
 * HSADC initiates the scan. When the HSADC returns to the idle state, the standby
 * clock is again selected and the converters revert to the standby state.
 * PWR[ASB] can be set at the same time or prior to clearing PWR[PDB/A]. Otherwise the
 * high speed conversion clock is used in the power-up delay counting before
 * going to standby idle state.
 *
 * Values:
 * - 0b0 - Auto standby mode disabled
 * - 0b1 - Auto standby mode enabled
 */
/*@{*/
/*! @brief Read current value of the HSADC_PWR_ASB field. */
#define HSADC_RD_PWR_ASB(base) ((HSADC_PWR_REG(base) & HSADC_PWR_ASB_MASK) >> HSADC_PWR_ASB_SHIFT)
#define HSADC_BRD_PWR_ASB(base) (BME_UBFX16(&HSADC_PWR_REG(base), HSADC_PWR_ASB_SHIFT, HSADC_PWR_ASB_WIDTH))

/*! @brief Set the ASB field to a new value. */
#define HSADC_WR_PWR_ASB(base, value) (HSADC_RMW_PWR(base, HSADC_PWR_ASB_MASK, HSADC_PWR_ASB(value)))
#define HSADC_BWR_PWR_ASB(base, value) (BME_BFI16(&HSADC_PWR_REG(base), ((uint16_t)(value) << HSADC_PWR_ASB_SHIFT), HSADC_PWR_ASB_SHIFT, HSADC_PWR_ASB_WIDTH))
/*@}*/

