ErichStyger/mcuoneclipse/Examples/KDS/TWR-KV58F220M/TWR_KV58F220M_PEx_2_SDKv2/SDK/platform/devices/MKV58F24/include/MKV58F24_extension.h
/*******************************************************************************
 * HSADC_CALVAL_A - Calibration Values for ADCA Register
 ******************************************************************************/

/*!
 * @brief HSADC_CALVAL_A - Calibration Values for ADCA Register (RW)
 *
 * Reset value: 0x0000U
 *
 * This register is used to store the calibration values for ADCA. When the ADCA
 * calibration is requested (single or differential), the ADCA calibration
 * result is written into this register.
 */
/*!
 * @name Constants and macros for entire HSADC_CALVAL_A register
 */
/*@{*/
#define HSADC_RD_CALVAL_A(base)  (HSADC_CALVAL_A_REG(base))
#define HSADC_WR_CALVAL_A(base, value) (HSADC_CALVAL_A_REG(base) = (value))
#define HSADC_RMW_CALVAL_A(base, mask, value) (HSADC_WR_CALVAL_A(base, (HSADC_RD_CALVAL_A(base) & ~(mask)) | (value)))
#define HSADC_SET_CALVAL_A(base, value) (BME_OR16(&HSADC_CALVAL_A_REG(base), (uint16_t)(value)))
#define HSADC_CLR_CALVAL_A(base, value) (BME_AND16(&HSADC_CALVAL_A_REG(base), (uint16_t)(~(value))))
#define HSADC_TOG_CALVAL_A(base, value) (BME_XOR16(&HSADC_CALVAL_A_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual HSADC_CALVAL_A bitfields
 */

/*!
 * @name Register HSADC_CALVAL_A, field CALVSING[6:0] (RW)
 *
 * This field is used to store the calibration value to be used in the
 * single-ended conversions. When the ADC calibration process ends, the calibration value
 * is written in this field for single-ended input mode.
 */
/*@{*/
/*! @brief Read current value of the HSADC_CALVAL_A_CALVSING field. */
#define HSADC_RD_CALVAL_A_CALVSING(base) ((HSADC_CALVAL_A_REG(base) & HSADC_CALVAL_A_CALVSING_MASK) >> HSADC_CALVAL_A_CALVSING_SHIFT)
#define HSADC_BRD_CALVAL_A_CALVSING(base) (BME_UBFX16(&HSADC_CALVAL_A_REG(base), HSADC_CALVAL_A_CALVSING_SHIFT, HSADC_CALVAL_A_CALVSING_WIDTH))

/*! @brief Set the CALVSING field to a new value. */
#define HSADC_WR_CALVAL_A_CALVSING(base, value) (HSADC_RMW_CALVAL_A(base, HSADC_CALVAL_A_CALVSING_MASK, HSADC_CALVAL_A_CALVSING(value)))
#define HSADC_BWR_CALVAL_A_CALVSING(base, value) (BME_BFI16(&HSADC_CALVAL_A_REG(base), ((uint16_t)(value) << HSADC_CALVAL_A_CALVSING_SHIFT), HSADC_CALVAL_A_CALVSING_SHIFT, HSADC_CALVAL_A_CALVSING_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_CALVAL_A, field CALVDIF[14:8] (RW)
 *
 * This field is used to store the calibration value to be used in the
 * differential conversions. When the ADC calibration process ends, the calibration result
 * is written into this field if differential mode is selected.
 */
/*@{*/
/*! @brief Read current value of the HSADC_CALVAL_A_CALVDIF field. */
#define HSADC_RD_CALVAL_A_CALVDIF(base) ((HSADC_CALVAL_A_REG(base) & HSADC_CALVAL_A_CALVDIF_MASK) >> HSADC_CALVAL_A_CALVDIF_SHIFT)
#define HSADC_BRD_CALVAL_A_CALVDIF(base) (BME_UBFX16(&HSADC_CALVAL_A_REG(base), HSADC_CALVAL_A_CALVDIF_SHIFT, HSADC_CALVAL_A_CALVDIF_WIDTH))

/*! @brief Set the CALVDIF field to a new value. */
#define HSADC_WR_CALVAL_A_CALVDIF(base, value) (HSADC_RMW_CALVAL_A(base, HSADC_CALVAL_A_CALVDIF_MASK, HSADC_CALVAL_A_CALVDIF(value)))
#define HSADC_BWR_CALVAL_A_CALVDIF(base, value) (BME_BFI16(&HSADC_CALVAL_A_REG(base), ((uint16_t)(value) << HSADC_CALVAL_A_CALVDIF_SHIFT), HSADC_CALVAL_A_CALVDIF_SHIFT, HSADC_CALVAL_A_CALVDIF_WIDTH))
/*@}*/

/*******************************************************************************
 * HSADC_CALVAL_B - Calibration Values for ADCB Register
 ******************************************************************************/

/*!
 * @brief HSADC_CALVAL_B - Calibration Values for ADCB Register (RW)
 *
 * Reset value: 0x0000U
 *
 * This register is used to store the calibration values for ADCB. When the ADCB
 * calibration is requested (single or differential), the ADCB calibration
 * result is written into this register.
 */
/*!
 * @name Constants and macros for entire HSADC_CALVAL_B register
 */
/*@{*/
#define HSADC_RD_CALVAL_B(base)  (HSADC_CALVAL_B_REG(base))
#define HSADC_WR_CALVAL_B(base, value) (HSADC_CALVAL_B_REG(base) = (value))
#define HSADC_RMW_CALVAL_B(base, mask, value) (HSADC_WR_CALVAL_B(base, (HSADC_RD_CALVAL_B(base) & ~(mask)) | (value)))
#define HSADC_SET_CALVAL_B(base, value) (BME_OR16(&HSADC_CALVAL_B_REG(base), (uint16_t)(value)))
#define HSADC_CLR_CALVAL_B(base, value) (BME_AND16(&HSADC_CALVAL_B_REG(base), (uint16_t)(~(value))))
#define HSADC_TOG_CALVAL_B(base, value) (BME_XOR16(&HSADC_CALVAL_B_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual HSADC_CALVAL_B bitfields
 */

/*!
 * @name Register HSADC_CALVAL_B, field CALVSING[6:0] (RW)
 *
 * This field is used to store the calibration value to be used in the
 * single-ended conversions. When the ADC calibration process ends, the calibration value
 * is written into this field for single-ended input mode.
 */
/*@{*/
/*! @brief Read current value of the HSADC_CALVAL_B_CALVSING field. */
#define HSADC_RD_CALVAL_B_CALVSING(base) ((HSADC_CALVAL_B_REG(base) & HSADC_CALVAL_B_CALVSING_MASK) >> HSADC_CALVAL_B_CALVSING_SHIFT)
#define HSADC_BRD_CALVAL_B_CALVSING(base) (BME_UBFX16(&HSADC_CALVAL_B_REG(base), HSADC_CALVAL_B_CALVSING_SHIFT, HSADC_CALVAL_B_CALVSING_WIDTH))

/*! @brief Set the CALVSING field to a new value. */
#define HSADC_WR_CALVAL_B_CALVSING(base, value) (HSADC_RMW_CALVAL_B(base, HSADC_CALVAL_B_CALVSING_MASK, HSADC_CALVAL_B_CALVSING(value)))
#define HSADC_BWR_CALVAL_B_CALVSING(base, value) (BME_BFI16(&HSADC_CALVAL_B_REG(base), ((uint16_t)(value) << HSADC_CALVAL_B_CALVSING_SHIFT), HSADC_CALVAL_B_CALVSING_SHIFT, HSADC_CALVAL_B_CALVSING_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_CALVAL_B, field CALVDIF[14:8] (RW)
 *
 * This field is used to store the calibration value to be used in the
 * differential conversions. When the ADC calibration process ends, the calibration value
 * is written into this field if differential mode is selected.
 */
/*@{*/
/*! @brief Read current value of the HSADC_CALVAL_B_CALVDIF field. */
#define HSADC_RD_CALVAL_B_CALVDIF(base) ((HSADC_CALVAL_B_REG(base) & HSADC_CALVAL_B_CALVDIF_MASK) >> HSADC_CALVAL_B_CALVDIF_SHIFT)
#define HSADC_BRD_CALVAL_B_CALVDIF(base) (BME_UBFX16(&HSADC_CALVAL_B_REG(base), HSADC_CALVAL_B_CALVDIF_SHIFT, HSADC_CALVAL_B_CALVDIF_WIDTH))

/*! @brief Set the CALVDIF field to a new value. */
#define HSADC_WR_CALVAL_B_CALVDIF(base, value) (HSADC_RMW_CALVAL_B(base, HSADC_CALVAL_B_CALVDIF_MASK, HSADC_CALVAL_B_CALVDIF(value)))
#define HSADC_BWR_CALVAL_B_CALVDIF(base, value) (BME_BFI16(&HSADC_CALVAL_B_REG(base), ((uint16_t)(value) << HSADC_CALVAL_B_CALVDIF_SHIFT), HSADC_CALVAL_B_CALVDIF_SHIFT, HSADC_CALVAL_B_CALVDIF_WIDTH))
/*@}*/

