ErichStyger/mcuoneclipse/Examples/KDS/TWR-KV58F220M/TWR_KV58F220M_PEx_2_SDKv2/SDK/platform/devices/MKV58F24/include/MKV58F24_extension.h
/*
 * Constants & macros for individual MCM_PCT bitfields
 */

/*!
 * @name Register MCM_PCT, field PLREV[15:0] (RO)
 */
/*@{*/
/*! @brief Read current value of the MCM_PCT_PLREV field. */
#define MCM_RD_PCT_PLREV(base) ((MCM_PCT_REG(base) & MCM_PCT_PLREV_MASK) >> MCM_PCT_PLREV_SHIFT)
#define MCM_BRD_PCT_PLREV(base) (MCM_RD_PCT_PLREV(base))
/*@}*/

/*!
 * @name Register MCM_PCT, field PCT[31:16] (RO)
 */
/*@{*/
/*! @brief Read current value of the MCM_PCT_PCT field. */
#define MCM_RD_PCT_PCT(base) ((MCM_PCT_REG(base) & MCM_PCT_PCT_MASK) >> MCM_PCT_PCT_SHIFT)
#define MCM_BRD_PCT_PCT(base) (MCM_RD_PCT_PCT(base))
/*@}*/

/*******************************************************************************
 * MCM_CR - Control Register
 ******************************************************************************/

/*!
 * @brief MCM_CR - Control Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * CR defines the interface priority for the TCM (Tightly Coupled Memory) RAM
 * arrays.
 */
/*!
 * @name Constants and macros for entire MCM_CR register
 */
/*@{*/
#define MCM_RD_CR(base)          (MCM_CR_REG(base))
#define MCM_WR_CR(base, value)   (MCM_CR_REG(base) = (value))
#define MCM_RMW_CR(base, mask, value) (MCM_WR_CR(base, (MCM_RD_CR(base) & ~(mask)) | (value)))
#define MCM_SET_CR(base, value)  (MCM_WR_CR(base, MCM_RD_CR(base) |  (value)))
#define MCM_CLR_CR(base, value)  (MCM_WR_CR(base, MCM_RD_CR(base) & ~(value)))
#define MCM_TOG_CR(base, value)  (MCM_WR_CR(base, MCM_RD_CR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual MCM_CR bitfields
 */

/*!
 * @name Register MCM_CR, field AHBSPRI[27] (RW)
 *
 * Setting the ARM AHBSCR (Cortex-M7 AHBS Prioritization Control Register)
 * bits[1:0] to x3 enables AHBSPRI to control AHBS priority boost modes. Once the ARM
 * AHBSCR[1:0] has been written to x3, AHBSPRI controls the AHBS Interface
 * priority.
 *
 * Values:
 * - 0b0 - SW accesses take priority over AHBS accesses
 * - 0b1 - AHBS accesses take priority over SW accesses
 */
/*@{*/
/*! @brief Read current value of the MCM_CR_AHBSPRI field. */
#define MCM_RD_CR_AHBSPRI(base) ((MCM_CR_REG(base) & MCM_CR_AHBSPRI_MASK) >> MCM_CR_AHBSPRI_SHIFT)
#define MCM_BRD_CR_AHBSPRI(base) (MCM_RD_CR_AHBSPRI(base))

/*! @brief Set the AHBSPRI field to a new value. */
#define MCM_WR_CR_AHBSPRI(base, value) (MCM_RMW_CR(base, MCM_CR_AHBSPRI_MASK, MCM_CR_AHBSPRI(value)))
#define MCM_BWR_CR_AHBSPRI(base, value) (MCM_WR_CR_AHBSPRI(base, value))
/*@}*/

/*******************************************************************************
 * MCM_ISCR - Interrupt Status and Control Register
 ******************************************************************************/

/*!
 * @brief MCM_ISCR - Interrupt Status and Control Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The MCM_ISCR register defines the configuration and reports status for a
 * number of core-related interrupt exception conditions. The MCM_ISCR register
 * includes the enable and status bits associated with the core's floating-point
 * exceptions. The individual event indicators are first qualified with their
 * exception enables and then logically summed to form an interrupt request sent to the
 * core's NVIC.Bits 15-8 are read-only indicator flags based on the processor's
 * FPSCR register. Attempted writes to these bits are ignored. Once set, the flags
 * remain asserted until software clears the corresponding FPSCR bit.
 */
/*!
 * @name Constants and macros for entire MCM_ISCR register
 */
/*@{*/
#define MCM_RD_ISCR(base)        (MCM_ISCR_REG(base))
#define MCM_WR_ISCR(base, value) (MCM_ISCR_REG(base) = (value))
#define MCM_RMW_ISCR(base, mask, value) (MCM_WR_ISCR(base, (MCM_RD_ISCR(base) & ~(mask)) | (value)))
#define MCM_SET_ISCR(base, value) (MCM_WR_ISCR(base, MCM_RD_ISCR(base) |  (value)))
#define MCM_CLR_ISCR(base, value) (MCM_WR_ISCR(base, MCM_RD_ISCR(base) & ~(value)))
#define MCM_TOG_ISCR(base, value) (MCM_WR_ISCR(base, MCM_RD_ISCR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual MCM_ISCR bitfields
 */

/*!
 * @name Register MCM_ISCR, field FIOC[8] (RO)
 *
 * Values:
 * - 0b0 - No interrupt
 * - 0b1 - Interrupt has occurred
 */
/*@{*/
/*! @brief Read current value of the MCM_ISCR_FIOC field. */
#define MCM_RD_ISCR_FIOC(base) ((MCM_ISCR_REG(base) & MCM_ISCR_FIOC_MASK) >> MCM_ISCR_FIOC_SHIFT)
#define MCM_BRD_ISCR_FIOC(base) (MCM_RD_ISCR_FIOC(base))
/*@}*/

/*!
 * @name Register MCM_ISCR, field FDZC[9] (RO)
 *
 * Values:
 * - 0b0 - No interrupt
 * - 0b1 - Interrupt has occurred
 */
/*@{*/
/*! @brief Read current value of the MCM_ISCR_FDZC field. */
#define MCM_RD_ISCR_FDZC(base) ((MCM_ISCR_REG(base) & MCM_ISCR_FDZC_MASK) >> MCM_ISCR_FDZC_SHIFT)
#define MCM_BRD_ISCR_FDZC(base) (MCM_RD_ISCR_FDZC(base))
/*@}*/

/*!
 * @name Register MCM_ISCR, field FOFC[10] (RO)
 *
 * Values:
 * - 0b0 - No interrupt
 * - 0b1 - Interrupt has occurred
 */
/*@{*/
/*! @brief Read current value of the MCM_ISCR_FOFC field. */
#define MCM_RD_ISCR_FOFC(base) ((MCM_ISCR_REG(base) & MCM_ISCR_FOFC_MASK) >> MCM_ISCR_FOFC_SHIFT)
#define MCM_BRD_ISCR_FOFC(base) (MCM_RD_ISCR_FOFC(base))
/*@}*/

/*!
 * @name Register MCM_ISCR, field FUFC[11] (RO)
 *
 * Values:
 * - 0b0 - No interrupt
 * - 0b1 - Interrupt has occurred
 */
/*@{*/
/*! @brief Read current value of the MCM_ISCR_FUFC field. */
#define MCM_RD_ISCR_FUFC(base) ((MCM_ISCR_REG(base) & MCM_ISCR_FUFC_MASK) >> MCM_ISCR_FUFC_SHIFT)
#define MCM_BRD_ISCR_FUFC(base) (MCM_RD_ISCR_FUFC(base))
/*@}*/

/*!
 * @name Register MCM_ISCR, field FIXC[12] (RO)
 *
 * Values:
 * - 0b0 - No interrupt
 * - 0b1 - Interrupt has occured
 */
/*@{*/
/*! @brief Read current value of the MCM_ISCR_FIXC field. */
#define MCM_RD_ISCR_FIXC(base) ((MCM_ISCR_REG(base) & MCM_ISCR_FIXC_MASK) >> MCM_ISCR_FIXC_SHIFT)
#define MCM_BRD_ISCR_FIXC(base) (MCM_RD_ISCR_FIXC(base))
/*@}*/

/*!
 * @name Register MCM_ISCR, field FIDC[15] (RO)
 *
 * Values:
 * - 0b0 - No interrupt
 * - 0b1 - Interrupt has occured
 */
/*@{*/
/*! @brief Read current value of the MCM_ISCR_FIDC field. */
#define MCM_RD_ISCR_FIDC(base) ((MCM_ISCR_REG(base) & MCM_ISCR_FIDC_MASK) >> MCM_ISCR_FIDC_SHIFT)
#define MCM_BRD_ISCR_FIDC(base) (MCM_RD_ISCR_FIDC(base))
/*@}*/

/*!
 * @name Register MCM_ISCR, field FIOCE[24] (RW)
 *
 * Values:
 * - 0b0 - Disable interrupt
 * - 0b1 - Enable interrupt
 */
/*@{*/
/*! @brief Read current value of the MCM_ISCR_FIOCE field. */
#define MCM_RD_ISCR_FIOCE(base) ((MCM_ISCR_REG(base) & MCM_ISCR_FIOCE_MASK) >> MCM_ISCR_FIOCE_SHIFT)
#define MCM_BRD_ISCR_FIOCE(base) (MCM_RD_ISCR_FIOCE(base))

