ErichStyger/mcuoneclipse/Examples/KDS/TWR-KV58F220M/TWR_KV58F220M_PEx_2_SDKv2/SDK/platform/devices/MKV58F24/include/MKV58F24_extension.h
/*! @brief Set the FIOCE field to a new value. */
#define MCM_WR_ISCR_FIOCE(base, value) (MCM_RMW_ISCR(base, MCM_ISCR_FIOCE_MASK, MCM_ISCR_FIOCE(value)))
#define MCM_BWR_ISCR_FIOCE(base, value) (MCM_WR_ISCR_FIOCE(base, value))
/*@}*/

/*!
 * @name Register MCM_ISCR, field FDZCE[25] (RW)
 *
 * Values:
 * - 0b0 - Disable interrupt
 * - 0b1 - Enable interrupt
 */
/*@{*/
/*! @brief Read current value of the MCM_ISCR_FDZCE field. */
#define MCM_RD_ISCR_FDZCE(base) ((MCM_ISCR_REG(base) & MCM_ISCR_FDZCE_MASK) >> MCM_ISCR_FDZCE_SHIFT)
#define MCM_BRD_ISCR_FDZCE(base) (MCM_RD_ISCR_FDZCE(base))

/*! @brief Set the FDZCE field to a new value. */
#define MCM_WR_ISCR_FDZCE(base, value) (MCM_RMW_ISCR(base, MCM_ISCR_FDZCE_MASK, MCM_ISCR_FDZCE(value)))
#define MCM_BWR_ISCR_FDZCE(base, value) (MCM_WR_ISCR_FDZCE(base, value))
/*@}*/

/*!
 * @name Register MCM_ISCR, field FOFCE[26] (RW)
 *
 * Values:
 * - 0b0 - Disable interrupt
 * - 0b1 - Enable interrupt
 */
/*@{*/
/*! @brief Read current value of the MCM_ISCR_FOFCE field. */
#define MCM_RD_ISCR_FOFCE(base) ((MCM_ISCR_REG(base) & MCM_ISCR_FOFCE_MASK) >> MCM_ISCR_FOFCE_SHIFT)
#define MCM_BRD_ISCR_FOFCE(base) (MCM_RD_ISCR_FOFCE(base))

/*! @brief Set the FOFCE field to a new value. */
#define MCM_WR_ISCR_FOFCE(base, value) (MCM_RMW_ISCR(base, MCM_ISCR_FOFCE_MASK, MCM_ISCR_FOFCE(value)))
#define MCM_BWR_ISCR_FOFCE(base, value) (MCM_WR_ISCR_FOFCE(base, value))
/*@}*/

/*!
 * @name Register MCM_ISCR, field FUFCE[27] (RW)
 *
 * Values:
 * - 0b0 - Disable interrupt
 * - 0b1 - Enable interrupt
 */
/*@{*/
/*! @brief Read current value of the MCM_ISCR_FUFCE field. */
#define MCM_RD_ISCR_FUFCE(base) ((MCM_ISCR_REG(base) & MCM_ISCR_FUFCE_MASK) >> MCM_ISCR_FUFCE_SHIFT)
#define MCM_BRD_ISCR_FUFCE(base) (MCM_RD_ISCR_FUFCE(base))

/*! @brief Set the FUFCE field to a new value. */
#define MCM_WR_ISCR_FUFCE(base, value) (MCM_RMW_ISCR(base, MCM_ISCR_FUFCE_MASK, MCM_ISCR_FUFCE(value)))
#define MCM_BWR_ISCR_FUFCE(base, value) (MCM_WR_ISCR_FUFCE(base, value))
/*@}*/

/*!
 * @name Register MCM_ISCR, field FIXCE[28] (RW)
 *
 * Values:
 * - 0b0 - Disable interrupt
 * - 0b1 - Enable interrupt
 */
/*@{*/
/*! @brief Read current value of the MCM_ISCR_FIXCE field. */
#define MCM_RD_ISCR_FIXCE(base) ((MCM_ISCR_REG(base) & MCM_ISCR_FIXCE_MASK) >> MCM_ISCR_FIXCE_SHIFT)
#define MCM_BRD_ISCR_FIXCE(base) (MCM_RD_ISCR_FIXCE(base))

/*! @brief Set the FIXCE field to a new value. */
#define MCM_WR_ISCR_FIXCE(base, value) (MCM_RMW_ISCR(base, MCM_ISCR_FIXCE_MASK, MCM_ISCR_FIXCE(value)))
#define MCM_BWR_ISCR_FIXCE(base, value) (MCM_WR_ISCR_FIXCE(base, value))
/*@}*/

/*!
 * @name Register MCM_ISCR, field FIDCE[31] (RW)
 *
 * Values:
 * - 0b0 - Disable interrupt
 * - 0b1 - Enable interrupt
 */
/*@{*/
/*! @brief Read current value of the MCM_ISCR_FIDCE field. */
#define MCM_RD_ISCR_FIDCE(base) ((MCM_ISCR_REG(base) & MCM_ISCR_FIDCE_MASK) >> MCM_ISCR_FIDCE_SHIFT)
#define MCM_BRD_ISCR_FIDCE(base) (MCM_RD_ISCR_FIDCE(base))

/*! @brief Set the FIDCE field to a new value. */
#define MCM_WR_ISCR_FIDCE(base, value) (MCM_RMW_ISCR(base, MCM_ISCR_FIDCE_MASK, MCM_ISCR_FIDCE(value)))
#define MCM_BWR_ISCR_FIDCE(base, value) (MCM_WR_ISCR_FIDCE(base, value))
/*@}*/

/*******************************************************************************
 * MCM_CPO - Compute Only Operation Control Register
 ******************************************************************************/

/*!
 * @brief MCM_CPO - Compute Only Operation Control Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register controls the Compute Only Operation.
 */
/*!
 * @name Constants and macros for entire MCM_CPO register
 */
/*@{*/
#define MCM_RD_CPO(base)         (MCM_CPO_REG(base))
#define MCM_WR_CPO(base, value)  (MCM_CPO_REG(base) = (value))
#define MCM_RMW_CPO(base, mask, value) (MCM_WR_CPO(base, (MCM_RD_CPO(base) & ~(mask)) | (value)))
#define MCM_SET_CPO(base, value) (MCM_WR_CPO(base, MCM_RD_CPO(base) |  (value)))
#define MCM_CLR_CPO(base, value) (MCM_WR_CPO(base, MCM_RD_CPO(base) & ~(value)))
#define MCM_TOG_CPO(base, value) (MCM_WR_CPO(base, MCM_RD_CPO(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual MCM_CPO bitfields
 */

/*!
 * @name Register MCM_CPO, field CPOREQ[0] (RW)
 *
 * This field must be cleared to exit Compute Only Operation mode.
 *
 * Values:
 * - 0b0 - Request is cleared.
 * - 0b1 - Request Compute Only Operation.
 */
/*@{*/
/*! @brief Read current value of the MCM_CPO_CPOREQ field. */
#define MCM_RD_CPO_CPOREQ(base) ((MCM_CPO_REG(base) & MCM_CPO_CPOREQ_MASK) >> MCM_CPO_CPOREQ_SHIFT)
#define MCM_BRD_CPO_CPOREQ(base) (MCM_RD_CPO_CPOREQ(base))

/*! @brief Set the CPOREQ field to a new value. */
#define MCM_WR_CPO_CPOREQ(base, value) (MCM_RMW_CPO(base, MCM_CPO_CPOREQ_MASK, MCM_CPO_CPOREQ(value)))
#define MCM_BWR_CPO_CPOREQ(base, value) (MCM_WR_CPO_CPOREQ(base, value))
/*@}*/

/*!
 * @name Register MCM_CPO, field CPOACK[1] (RO)
 *
 * Values:
 * - 0b0 - Compute only operation entry has not completed or compute only
 *     operation exit has completed.
 * - 0b1 - Compute only operation entry has completed or compute only operation
 *     exit has not completed.
 */
/*@{*/
/*! @brief Read current value of the MCM_CPO_CPOACK field. */
#define MCM_RD_CPO_CPOACK(base) ((MCM_CPO_REG(base) & MCM_CPO_CPOACK_MASK) >> MCM_CPO_CPOACK_SHIFT)
#define MCM_BRD_CPO_CPOACK(base) (MCM_RD_CPO_CPOACK(base))
/*@}*/

/*******************************************************************************
 * MCM_LMEM - Local Memory General Descriptor Register
 ******************************************************************************/

/*!
 * @brief MCM_LMEM - Local Memory General Descriptor Register (RO)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire MCM_LMEM register
 */
/*@{*/
#define MCM_RD_LMEM(base, index) (MCM_LMEM_REG(base, index))
/*@}*/

/*
 * Constants & macros for individual MCM_LMEM bitfields
 */

/*!
 * @name Register MCM_LMEM, field LMEM_Type[15:13] (RO)
 *
 * Defines the type of local memory
 *
 * Values:
 * - 0b000 - ITCM (Instruction Tightly Coupled Memory)
 * - 0b001 - DTCM (Data Tightly Coupled Memory)
 * - 0b010 - Instruction Cache
 * - 0b011 - Data Cache
 */
/*@{*/
/*! @brief Read current value of the MCM_LMEM_LMEM_Type field. */
#define MCM_RD_LMEM_LMEM_Type(base, index) ((MCM_LMEM_REG(base, index) & MCM_LMEM_LMEM_Type_MASK) >> MCM_LMEM_LMEM_Type_SHIFT)
#define MCM_BRD_LMEM_LMEM_Type(base, index) (MCM_RD_LMEM_LMEM_Type(base, index))
/*@}*/

/*!
 * @name Register MCM_LMEM, field LMEM_Width[19:17] (RO)
 *
 * Defines the local memory bit width
 *
 * Values:
 * - 0b010 - 32-bits
 * - 0b011 - 64-bits
 */
/*@{*/
/*! @brief Read current value of the MCM_LMEM_LMEM_Width field. */
#define MCM_RD_LMEM_LMEM_Width(base, index) ((MCM_LMEM_REG(base, index) & MCM_LMEM_LMEM_Width_MASK) >> MCM_LMEM_LMEM_Width_SHIFT)
#define MCM_BRD_LMEM_LMEM_Width(base, index) (MCM_RD_LMEM_LMEM_Width(base, index))
/*@}*/

/*!
 * @name Register MCM_LMEM, field LMEM_Ways[23:20] (RO)
 *
 * Defines the ways of set associative
 *
 * Values:
 * - 0b0000 - Reserved (not applicable)
 * - 0b0010 - 2-way set associative
 * - 0b0100 - 4-way set associative
 */
/*@{*/
/*! @brief Read current value of the MCM_LMEM_LMEM_Ways field. */
#define MCM_RD_LMEM_LMEM_Ways(base, index) ((MCM_LMEM_REG(base, index) & MCM_LMEM_LMEM_Ways_MASK) >> MCM_LMEM_LMEM_Ways_SHIFT)
#define MCM_BRD_LMEM_LMEM_Ways(base, index) (MCM_RD_LMEM_LMEM_Ways(base, index))
/*@}*/

/*!
 * @name Register MCM_LMEM, field LMEM_Size[27:24] (RO)
 *
 * Defines the local memory size
 *
 * Values:
 * - 0b0100 - 8KB
 * - 0b0101 - 16KB
 * - 0b0111 - 64KB
 */
/*@{*/
/*! @brief Read current value of the MCM_LMEM_LMEM_Size field. */
#define MCM_RD_LMEM_LMEM_Size(base, index) ((MCM_LMEM_REG(base, index) & MCM_LMEM_LMEM_Size_MASK) >> MCM_LMEM_LMEM_Size_SHIFT)
#define MCM_BRD_LMEM_LMEM_Size(base, index) (MCM_RD_LMEM_LMEM_Size(base, index))
/*@}*/

/*!
 * @name Register MCM_LMEM, field LMEM_Valid[31] (RO)
 *
 * Defines whether the local memory is present
 *
 * Values:
 * - 0b0 - Local memory not present
 * - 0b1 - Local memory present
 */
/*@{*/
/*! @brief Read current value of the MCM_LMEM_LMEM_Valid field. */
#define MCM_RD_LMEM_LMEM_Valid(base, index) ((MCM_LMEM_REG(base, index) & MCM_LMEM_LMEM_Valid_MASK) >> MCM_LMEM_LMEM_Valid_SHIFT)
#define MCM_BRD_LMEM_LMEM_Valid(base, index) (MCM_RD_LMEM_LMEM_Valid(base, index))
/*@}*/

