ErichStyger/mcuoneclipse/Examples/KDS/TWR-KV58F220M/TWR_KV58F220M_PEx_2_SDKv2/SDK/platform/devices/MKV58F24/include/MKV58F24_extension.h
/*! @brief Set the M6RE field to a new value. */
#define MPU_WR_RGDAAC_M6RE(base, index, value) (MPU_RMW_RGDAAC(base, index, MPU_RGDAAC_M6RE_MASK, MPU_RGDAAC_M6RE(value)))
#define MPU_BWR_RGDAAC_M6RE(base, index, value) (BME_BFI32(&MPU_RGDAAC_REG(base, index), ((uint32_t)(value) << MPU_RGDAAC_M6RE_SHIFT), MPU_RGDAAC_M6RE_SHIFT, MPU_RGDAAC_M6RE_WIDTH))
/*@}*/

/*!
 * @name Register MPU_RGDAAC, field M7WE[30] (RW)
 *
 * Values:
 * - 0b0 - Bus master 7 writes terminate with an access error and the write is
 *     not performed
 * - 0b1 - Bus master 7 writes allowed
 */
/*@{*/
/*! @brief Read current value of the MPU_RGDAAC_M7WE field. */
#define MPU_RD_RGDAAC_M7WE(base, index) ((MPU_RGDAAC_REG(base, index) & MPU_RGDAAC_M7WE_MASK) >> MPU_RGDAAC_M7WE_SHIFT)
#define MPU_BRD_RGDAAC_M7WE(base, index) (BME_UBFX32(&MPU_RGDAAC_REG(base, index), MPU_RGDAAC_M7WE_SHIFT, MPU_RGDAAC_M7WE_WIDTH))

/*! @brief Set the M7WE field to a new value. */
#define MPU_WR_RGDAAC_M7WE(base, index, value) (MPU_RMW_RGDAAC(base, index, MPU_RGDAAC_M7WE_MASK, MPU_RGDAAC_M7WE(value)))
#define MPU_BWR_RGDAAC_M7WE(base, index, value) (BME_BFI32(&MPU_RGDAAC_REG(base, index), ((uint32_t)(value) << MPU_RGDAAC_M7WE_SHIFT), MPU_RGDAAC_M7WE_SHIFT, MPU_RGDAAC_M7WE_WIDTH))
/*@}*/

/*!
 * @name Register MPU_RGDAAC, field M7RE[31] (RW)
 *
 * Values:
 * - 0b0 - Bus master 7 reads terminate with an access error and the read is not
 *     performed
 * - 0b1 - Bus master 7 reads allowed
 */
/*@{*/
/*! @brief Read current value of the MPU_RGDAAC_M7RE field. */
#define MPU_RD_RGDAAC_M7RE(base, index) ((MPU_RGDAAC_REG(base, index) & MPU_RGDAAC_M7RE_MASK) >> MPU_RGDAAC_M7RE_SHIFT)
#define MPU_BRD_RGDAAC_M7RE(base, index) (BME_UBFX32(&MPU_RGDAAC_REG(base, index), MPU_RGDAAC_M7RE_SHIFT, MPU_RGDAAC_M7RE_WIDTH))

/*! @brief Set the M7RE field to a new value. */
#define MPU_WR_RGDAAC_M7RE(base, index, value) (MPU_RMW_RGDAAC(base, index, MPU_RGDAAC_M7RE_MASK, MPU_RGDAAC_M7RE(value)))
#define MPU_BWR_RGDAAC_M7RE(base, index, value) (BME_BFI32(&MPU_RGDAAC_REG(base, index), ((uint32_t)(value) << MPU_RGDAAC_M7RE_SHIFT), MPU_RGDAAC_M7RE_SHIFT, MPU_RGDAAC_M7RE_WIDTH))
/*@}*/

/*
 * MKV58F24 MSCM
 *
 * MSCM
 *
 * Registers defined in this header file:
 * - MSCM_TYPE - Processor X Type Register
 * - MSCM_NUM - Processor X Number Register
 * - MSCM_MASTER - Processor X Master Register
 * - MSCM_COUNT - Processor X Count Register
 * - MSCM_CFG1 - Processor X Configuration 1 Register
 * - MSCM_CFG3 - Processor X Configuration 3 Register
 * - MSCM_OCMDR - On-Chip Memory Descriptor Register
 */

#define MSCM_INSTANCE_COUNT (1U) /*!< Number of instances of the MSCM module. */
#define MSCM_IDX (0U) /*!< Instance number for MSCM. */

/*******************************************************************************
 * MSCM_TYPE - Processor X Type Register
 ******************************************************************************/

/*!
 * @brief MSCM_TYPE - Processor X Type Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The register provides a CPU-specific response indicating the personality of
 * the core making the access. The 32 bit response includes 3 ASCII characters
 * defining the CPU type along with a byte defining the logical revision number. The
 * logical revision number follows ARM's rYpZ nomenclature.
 */
/*!
 * @name Constants and macros for entire MSCM_TYPE register
 */
/*@{*/
#define MSCM_RD_TYPE(base, index) (MSCM_TYPE_REG(base, index))
/*@}*/

/*
 * Constants & macros for individual MSCM_TYPE bitfields
 */

/*!
 * @name Register MSCM_TYPE, field RYPZ[7:0] (RO)
 *
 * This field defines the processor revision for CPx: 0x00 corresponds to the
 * r0p0 core release. 0x01 corresponds to the r0p1 core release. ...
 */
/*@{*/
/*! @brief Read current value of the MSCM_TYPE_RYPZ field. */
#define MSCM_RD_TYPE_RYPZ(base, index) ((MSCM_TYPE_REG(base, index) & MSCM_TYPE_RYPZ_MASK) >> MSCM_TYPE_RYPZ_SHIFT)
#define MSCM_BRD_TYPE_RYPZ(base, index) (BME_UBFX32(&MSCM_TYPE_REG(base, index), MSCM_TYPE_RYPZ_SHIFT, MSCM_TYPE_RYPZ_WIDTH))
/*@}*/

/*!
 * @name Register MSCM_TYPE, field PERSONALITY[31:8] (RO)
 *
 * This field defines the processor personality for CPx if CPx = Cortex-M7, then
 * PERSONALITY = 0x43_4D_37 ("CM7").
 */
/*@{*/
/*! @brief Read current value of the MSCM_TYPE_PERSONALITY field. */
#define MSCM_RD_TYPE_PERSONALITY(base, index) ((MSCM_TYPE_REG(base, index) & MSCM_TYPE_PERSONALITY_MASK) >> MSCM_TYPE_PERSONALITY_SHIFT)
#define MSCM_BRD_TYPE_PERSONALITY(base, index) (MSCM_RD_TYPE_PERSONALITY(base, index))
/*@}*/

/*******************************************************************************
 * MSCM_NUM - Processor X Number Register
 ******************************************************************************/

/*!
 * @brief MSCM_NUM - Processor X Number Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The register provides a CPU-specific response indicating the logical
 * processor number of the core making the access. In single processor configurations,
 * the logical processor number is always zero; in dual core configurations, the
 * boot (or primary) core is assigned number 0 while the secondary core is defined
 * as number 1.
 */
/*!
 * @name Constants and macros for entire MSCM_NUM register
 */
/*@{*/
#define MSCM_RD_NUM(base, index) (MSCM_NUM_REG(base, index))
/*@}*/

/*
 * Constants & macros for individual MSCM_NUM bitfields
 */

/*!
 * @name Register MSCM_NUM, field CPN[0] (RO)
 *
 * This zero-filled word defines the logical processor number for CPx If single
 * core configuration, then CPN = 0 If dual core configuration and boot (primary)
 * core, then CPN = 0 For secondary core, CPN = 1
 */
/*@{*/
/*! @brief Read current value of the MSCM_NUM_CPN field. */
#define MSCM_RD_NUM_CPN(base, index) ((MSCM_NUM_REG(base, index) & MSCM_NUM_CPN_MASK) >> MSCM_NUM_CPN_SHIFT)
#define MSCM_BRD_NUM_CPN(base, index) (BME_UBFX32(&MSCM_NUM_REG(base, index), MSCM_NUM_CPN_SHIFT, MSCM_NUM_CPN_WIDTH))
/*@}*/

/*******************************************************************************
 * MSCM_MASTER - Processor X Master Register
 ******************************************************************************/

/*!
 * @brief MSCM_MASTER - Processor X Master Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The register provides a CPU-specific response indicating the physical bus
 * master number of the core making the access. The 32 bit response defines the
 * physical master number for processor x. A privileged read from the CM7 returns the
 * appropriate processor information. Reads from any other bus master return all
 * zeroes. Attempted user mode or write accesses are terminated with an error.
 */
/*!
 * @name Constants and macros for entire MSCM_MASTER register
 */
/*@{*/
#define MSCM_RD_MASTER(base, index) (MSCM_MASTER_REG(base, index))
/*@}*/

