ErichStyger/mcuoneclipse/Examples/KDS/TWR-KV58F220M/TWR_KV58F220M_PEx_2_SDKv2/SDK/platform/devices/MKV58F24/include/MKV58F24_extension.h
/*
 * Constants & macros for individual MSCM_MASTER bitfields
 */

/*!
 * @name Register MSCM_MASTER, field PPN[5:0] (RO)
 *
 * This field defines the physical port number for CPUx. For CPU0, PPN = 0x00
 * For CPU1, PPN = 0x24
 */
/*@{*/
/*! @brief Read current value of the MSCM_MASTER_PPN field. */
#define MSCM_RD_MASTER_PPN(base, index) ((MSCM_MASTER_REG(base, index) & MSCM_MASTER_PPN_MASK) >> MSCM_MASTER_PPN_SHIFT)
#define MSCM_BRD_MASTER_PPN(base, index) (BME_UBFX32(&MSCM_MASTER_REG(base, index), MSCM_MASTER_PPN_SHIFT, MSCM_MASTER_PPN_WIDTH))
/*@}*/

/*******************************************************************************
 * MSCM_COUNT - Processor X Count Register
 ******************************************************************************/

/*!
 * @brief MSCM_COUNT - Processor X Count Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The register provides a CPU-specific response indicating the total number of
 * processor cores in the chip configuration.
 */
/*!
 * @name Constants and macros for entire MSCM_COUNT register
 */
/*@{*/
#define MSCM_RD_COUNT(base, index) (MSCM_COUNT_REG(base, index))
/*@}*/

/*
 * Constants & macros for individual MSCM_COUNT bitfields
 */

/*!
 * @name Register MSCM_COUNT, field PCNT[1:0] (RO)
 *
 * This field defines the processor count for the chip configuration: If single
 * core configuration, then PCNT = 00 If dual core configuration, then PCNT = 01
 */
/*@{*/
/*! @brief Read current value of the MSCM_COUNT_PCNT field. */
#define MSCM_RD_COUNT_PCNT(base, index) ((MSCM_COUNT_REG(base, index) & MSCM_COUNT_PCNT_MASK) >> MSCM_COUNT_PCNT_SHIFT)
#define MSCM_BRD_COUNT_PCNT(base, index) (BME_UBFX32(&MSCM_COUNT_REG(base, index), MSCM_COUNT_PCNT_SHIFT, MSCM_COUNT_PCNT_WIDTH))
/*@}*/

/*******************************************************************************
 * MSCM_CFG1 - Processor X Configuration 1 Register
 ******************************************************************************/

/*!
 * @brief MSCM_CFG1 - Processor X Configuration 1 Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The register provides a CPU-specific response detailing configuration
 * information, in this case, information on a Level 2 cache (if present).
 */
/*!
 * @name Constants and macros for entire MSCM_CFG1 register
 */
/*@{*/
#define MSCM_RD_CFG1(base, index) (MSCM_CFG1_REG(base, index))
/*@}*/

/*
 * Constants & macros for individual MSCM_CFG1 bitfields
 */

/*!
 * @name Register MSCM_CFG1, field L2WY[23:16] (RO)
 *
 * This field provides the number of cache ways for the Level 2 Cache.
 */
/*@{*/
/*! @brief Read current value of the MSCM_CFG1_L2WY field. */
#define MSCM_RD_CFG1_L2WY(base, index) ((MSCM_CFG1_REG(base, index) & MSCM_CFG1_L2WY_MASK) >> MSCM_CFG1_L2WY_SHIFT)
#define MSCM_BRD_CFG1_L2WY(base, index) (BME_UBFX32(&MSCM_CFG1_REG(base, index), MSCM_CFG1_L2WY_SHIFT, MSCM_CFG1_L2WY_WIDTH))
/*@}*/

/*!
 * @name Register MSCM_CFG1, field L2SZ[31:24] (RO)
 *
 * This field provides an encoded value of the Level 2 Cache size. The capacity
 * of the memory is expressed as Size [bytes] = 2(8+SZ) where SZ is non-zero; SZ
 * = 0 indicates the memory is not present. If no Level 2 Cache, then L2SZ = 0x00
 * If a 4 Kbyte Level 2 Cache, then L2SZ = 0x04 If an 8 Kbyte Level 2 Cache,
 * then L2SZ = 0x05 If a 16 Kbyte Level 2 Cache, then L2SZ = 0x06 If a 32 Kbyte
 * Level 2 Cache, then L2SZ = 0x07 If a 64 Kbyte Level 2 Cache, then L2SZ = 0x08 If a
 * 128 Kbyte Level 2 Cache, then L2SZ = 0x09 If a 256 Kbyte Level 2 Cache, then
 * L2SZ = 0x0A If a 512 Kbyte Level 2 Cache, then L2SZ = 0x0B
 */
/*@{*/
/*! @brief Read current value of the MSCM_CFG1_L2SZ field. */
#define MSCM_RD_CFG1_L2SZ(base, index) ((MSCM_CFG1_REG(base, index) & MSCM_CFG1_L2SZ_MASK) >> MSCM_CFG1_L2SZ_SHIFT)
#define MSCM_BRD_CFG1_L2SZ(base, index) (BME_UBFX32(&MSCM_CFG1_REG(base, index), MSCM_CFG1_L2SZ_SHIFT, MSCM_CFG1_L2SZ_WIDTH))
/*@}*/

/*******************************************************************************
 * MSCM_CFG3 - Processor X Configuration 3 Register
 ******************************************************************************/

/*!
 * @brief MSCM_CFG3 - Processor X Configuration 3 Register (RO)
 *
 * Reset value: 0x00000221U
 *
 * The register provides CPU-specific response detailing configuration
 * information, in this case, information on processor options. A privileged read from the
 * CM7 returns the appropriate processor information. Reads from any other bus
 * master return all zeroes. Attempted user mode or write accesses are terminated
 * with an error.
 */
/*!
 * @name Constants and macros for entire MSCM_CFG3 register
 */
/*@{*/
#define MSCM_RD_CFG3(base, index) (MSCM_CFG3_REG(base, index))
/*@}*/

/*
 * Constants & macros for individual MSCM_CFG3 bitfields
 */

/*!
 * @name Register MSCM_CFG3, field FPU[0] (RO)
 *
 * This field indicates if hardware support for floating point capabilities are
 * supported in the processor. If FPU support is not included, then FPU = 0x0 If
 * FPU support is included, then FPU = 0x1
 */
/*@{*/
/*! @brief Read current value of the MSCM_CFG3_FPU field. */
#define MSCM_RD_CFG3_FPU(base, index) ((MSCM_CFG3_REG(base, index) & MSCM_CFG3_FPU_MASK) >> MSCM_CFG3_FPU_SHIFT)
#define MSCM_BRD_CFG3_FPU(base, index) (BME_UBFX32(&MSCM_CFG3_REG(base, index), MSCM_CFG3_FPU_SHIFT, MSCM_CFG3_FPU_WIDTH))
/*@}*/

/*!
 * @name Register MSCM_CFG3, field SIMD[1] (RO)
 *
 * This field indicates if the instruction set extensions supporting SIMD and/or
 * NEON capabilities are supported in the processor. If SIMD/NEON support is not
 * included, then SIMD = 0x0 If SIMD/NEON support is included, then SIMD = 0x1
 */
/*@{*/
/*! @brief Read current value of the MSCM_CFG3_SIMD field. */
#define MSCM_RD_CFG3_SIMD(base, index) ((MSCM_CFG3_REG(base, index) & MSCM_CFG3_SIMD_MASK) >> MSCM_CFG3_SIMD_SHIFT)
#define MSCM_BRD_CFG3_SIMD(base, index) (BME_UBFX32(&MSCM_CFG3_REG(base, index), MSCM_CFG3_SIMD_SHIFT, MSCM_CFG3_SIMD_WIDTH))
/*@}*/

/*!
 * @name Register MSCM_CFG3, field JAZ[2] (RO)
 *
 * This field indicates if Jazelle hardware is supported in the processor. If
 * Jazelle support is not included, then JAZ = 0x0 If Jazelle support is included,
 * then JAZ = 0x1
 */
/*@{*/
/*! @brief Read current value of the MSCM_CFG3_JAZ field. */
#define MSCM_RD_CFG3_JAZ(base, index) ((MSCM_CFG3_REG(base, index) & MSCM_CFG3_JAZ_MASK) >> MSCM_CFG3_JAZ_SHIFT)
#define MSCM_BRD_CFG3_JAZ(base, index) (BME_UBFX32(&MSCM_CFG3_REG(base, index), MSCM_CFG3_JAZ_SHIFT, MSCM_CFG3_JAZ_WIDTH))
/*@}*/

/*!
 * @name Register MSCM_CFG3, field MMU[3] (RO)
 *
 * This field indicates if the virtual memory management capabilities are
 * supported in the processor. If MMU support is not included, then MMU = 0x0 If MMU
 * support is included, then MMU = 0x1
 */
/*@{*/
/*! @brief Read current value of the MSCM_CFG3_MMU field. */
#define MSCM_RD_CFG3_MMU(base, index) ((MSCM_CFG3_REG(base, index) & MSCM_CFG3_MMU_MASK) >> MSCM_CFG3_MMU_SHIFT)
#define MSCM_BRD_CFG3_MMU(base, index) (BME_UBFX32(&MSCM_CFG3_REG(base, index), MSCM_CFG3_MMU_SHIFT, MSCM_CFG3_MMU_WIDTH))
/*@}*/

/*!
 * @name Register MSCM_CFG3, field TZ[4] (RO)
 *
 * This field indicates if the Trust Zone capabilities are supported in the
 * processor. If Trust Zone support is not included, then TZ = 0x0 If Trust Zone
 * support is included, then TZ = 0x1
 */
/*@{*/
/*! @brief Read current value of the MSCM_CFG3_TZ field. */
#define MSCM_RD_CFG3_TZ(base, index) ((MSCM_CFG3_REG(base, index) & MSCM_CFG3_TZ_MASK) >> MSCM_CFG3_TZ_SHIFT)
#define MSCM_BRD_CFG3_TZ(base, index) (BME_UBFX32(&MSCM_CFG3_REG(base, index), MSCM_CFG3_TZ_SHIFT, MSCM_CFG3_TZ_WIDTH))
/*@}*/

/*!
 * @name Register MSCM_CFG3, field CMP[5] (RO)
 *
 * This field indicates if the core memory protection hardware is included in
 * the processor. If core memory protection is not included, then CMP = 0x0 If core
 * memory protection is included, then CMP = 0x1
 */
/*@{*/
/*! @brief Read current value of the MSCM_CFG3_CMP field. */
#define MSCM_RD_CFG3_CMP(base, index) ((MSCM_CFG3_REG(base, index) & MSCM_CFG3_CMP_MASK) >> MSCM_CFG3_CMP_SHIFT)
#define MSCM_BRD_CFG3_CMP(base, index) (BME_UBFX32(&MSCM_CFG3_REG(base, index), MSCM_CFG3_CMP_SHIFT, MSCM_CFG3_CMP_WIDTH))
/*@}*/

/*!
 * @name Register MSCM_CFG3, field BB[6] (RO)
 *
 * This field defines if the processor supports bit banding. If bit banding is
 * not supported, then BB = 0x0 If bit banding is supported, then BB = 0x1
 */
/*@{*/
/*! @brief Read current value of the MSCM_CFG3_BB field. */
#define MSCM_RD_CFG3_BB(base, index) ((MSCM_CFG3_REG(base, index) & MSCM_CFG3_BB_MASK) >> MSCM_CFG3_BB_SHIFT)
#define MSCM_BRD_CFG3_BB(base, index) (BME_UBFX32(&MSCM_CFG3_REG(base, index), MSCM_CFG3_BB_SHIFT, MSCM_CFG3_BB_WIDTH))
/*@}*/

/*!
 * @name Register MSCM_CFG3, field SBP[9:8] (RO)
 *
 * This field defines the number of physical connections to the system bus
 * fabric for this processor.
 */
/*@{*/
/*! @brief Read current value of the MSCM_CFG3_SBP field. */
#define MSCM_RD_CFG3_SBP(base, index) ((MSCM_CFG3_REG(base, index) & MSCM_CFG3_SBP_MASK) >> MSCM_CFG3_SBP_SHIFT)
#define MSCM_BRD_CFG3_SBP(base, index) (BME_UBFX32(&MSCM_CFG3_REG(base, index), MSCM_CFG3_SBP_SHIFT, MSCM_CFG3_SBP_WIDTH))
/*@}*/

