ErichStyger/mcuoneclipse/Examples/KDS/TWR-KV58F220M/TWR_KV58F220M_PEx_2_SDKv2/SDK/platform/devices/MKV58F24/include/MKV58F24_extension.h
/*******************************************************************************
 * MSCM_OCMDR - On-Chip Memory Descriptor Register
 ******************************************************************************/

/*!
 * @brief MSCM_OCMDR - On-Chip Memory Descriptor Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * This section of the programming model is an array of 32-bit generic on-chip
 * memory descriptor registers that provide static information on the attached
 * memories as well as configurable controls (where appropriate). Privileged 32-bit
 * reads from a processor core or the debugger return the appropriate processor
 * information. Reads from any other bus master return all zeroes. Privileged
 * writes from a processor core or the debugger to writeable registers update the
 * appropriate fields. Privileged writes from other bus masters are ignored.
 * Attempted user mode accesses or any access with a size other than 32 bits are
 * terminated with an error.
 */
/*!
 * @name Constants and macros for entire MSCM_OCMDR register
 */
/*@{*/
#define MSCM_RD_OCMDR(base, index) (MSCM_OCMDR_REG(base, index))
/*@}*/

/*
 * Constants & macros for individual MSCM_OCMDR bitfields
 */

/*!
 * @name Register MSCM_OCMDR, field OCMPU[12] (RO)
 *
 * This field identifies a memory protected by a Memory Protection Unit.
 *
 * Values:
 * - 0b0 - OCMEMn is not protected by an MPU.
 * - 0b1 - OCMEMn is protected by an MPU.
 */
/*@{*/
/*! @brief Read current value of the MSCM_OCMDR_OCMPU field. */
#define MSCM_RD_OCMDR_OCMPU(base, index) ((MSCM_OCMDR_REG(base, index) & MSCM_OCMDR_OCMPU_MASK) >> MSCM_OCMDR_OCMPU_SHIFT)
#define MSCM_BRD_OCMDR_OCMPU(base, index) (BME_UBFX32(&MSCM_OCMDR_REG(base, index), MSCM_OCMDR_OCMPU_SHIFT, MSCM_OCMDR_OCMPU_WIDTH))
/*@}*/

/*!
 * @name Register MSCM_OCMDR, field OCMT[15:13] (RO)
 *
 * OCMEM Type. This field defines the type of the on-chip memory:
 *
 * Values:
 * - 0b000 - OCMEMn is a system RAM.
 * - 0b001 - OCMEMn is a graphics RAM.
 * - 0b010 - Reserved
 * - 0b011 - OCMEMn is a ROM.
 * - 0b100 - OCMEMn is a program flash.
 * - 0b101 - OCMEMn is a data flash.
 * - 0b110 - OCMEMn is an EEE.
 * - 0b111 - Reserved
 */
/*@{*/
/*! @brief Read current value of the MSCM_OCMDR_OCMT field. */
#define MSCM_RD_OCMDR_OCMT(base, index) ((MSCM_OCMDR_REG(base, index) & MSCM_OCMDR_OCMT_MASK) >> MSCM_OCMDR_OCMT_SHIFT)
#define MSCM_BRD_OCMDR_OCMT(base, index) (BME_UBFX32(&MSCM_OCMDR_REG(base, index), MSCM_OCMDR_OCMT_SHIFT, MSCM_OCMDR_OCMT_WIDTH))
/*@}*/

/*!
 * @name Register MSCM_OCMDR, field OCMW[19:17] (RO)
 *
 * This field defines the width of the on-chip memory:
 *
 * Values:
 * - 0b010 - OCMEMn 32-bits wide
 * - 0b011 - OCMEMn 64-bits wide
 * - 0b100 - OCMEMn 128-bits wide
 * - 0b101 - OCMEMn 256-bits wide
 */
/*@{*/
/*! @brief Read current value of the MSCM_OCMDR_OCMW field. */
#define MSCM_RD_OCMDR_OCMW(base, index) ((MSCM_OCMDR_REG(base, index) & MSCM_OCMDR_OCMW_MASK) >> MSCM_OCMDR_OCMW_SHIFT)
#define MSCM_BRD_OCMDR_OCMW(base, index) (BME_UBFX32(&MSCM_OCMDR_REG(base, index), MSCM_OCMDR_OCMW_SHIFT, MSCM_OCMDR_OCMW_WIDTH))
/*@}*/

/*!
 * @name Register MSCM_OCMDR, field OCMSZ[27:24] (RO)
 *
 * This field provides an encoded value of the on-chip memory size. The capacity
 * of the memory is expressed as Size [bytes] = 2(8+SZ) where SZ is non-zero; a
 * SZ = 0 indicates the memory is not present.
 *
 * Values:
 * - 0b0000 - no OCMEMn
 * - 0b0011 - 4KB OCMEMn
 * - 0b0100 - 8KB OCMEMn
 * - 0b0101 - 16KB OCMEMn
 * - 0b0110 - 32KB OCMEMn
 * - 0b0111 - 64KB OCMEMn
 * - 0b1000 - 128KB OCMEMn
 * - 0b1001 - 256KB OCMEMn
 * - 0b1010 - 512KB OCMEMn
 * - 0b1011 - 1024KB OCMEMn
 * - 0b1100 - 2048KB OCMEMn
 * - 0b1101 - 4096KB OCMEMn
 * - 0b1110 - 8192KB OCMEMn
 * - 0b1111 - 16384KB OCMEMn
 */
/*@{*/
/*! @brief Read current value of the MSCM_OCMDR_OCMSZ field. */
#define MSCM_RD_OCMDR_OCMSZ(base, index) ((MSCM_OCMDR_REG(base, index) & MSCM_OCMDR_OCMSZ_MASK) >> MSCM_OCMDR_OCMSZ_SHIFT)
#define MSCM_BRD_OCMDR_OCMSZ(base, index) (BME_UBFX32(&MSCM_OCMDR_REG(base, index), MSCM_OCMDR_OCMSZ_SHIFT, MSCM_OCMDR_OCMSZ_WIDTH))
/*@}*/

/*!
 * @name Register MSCM_OCMDR, field OCMSZH[28] (RO)
 *
 * OCMEM Size "Hole". For on-chip memories that are not fully populated, that
 * is, include a memory "hole" in the upper 25% of the address range, this bit is
 * used.
 *
 * Values:
 * - 0b0 - OCMEMn is a power-of-2 capacity.
 * - 0b1 - OCMEMn is not a power-of-2, with a capacity is 0.75 * OCMSZ.
 */
/*@{*/
/*! @brief Read current value of the MSCM_OCMDR_OCMSZH field. */
#define MSCM_RD_OCMDR_OCMSZH(base, index) ((MSCM_OCMDR_REG(base, index) & MSCM_OCMDR_OCMSZH_MASK) >> MSCM_OCMDR_OCMSZH_SHIFT)
#define MSCM_BRD_OCMDR_OCMSZH(base, index) (BME_UBFX32(&MSCM_OCMDR_REG(base, index), MSCM_OCMDR_OCMSZH_SHIFT, MSCM_OCMDR_OCMSZH_WIDTH))
/*@}*/

/*!
 * @name Register MSCM_OCMDR, field FMT[30] (RO)
 *
 * Values:
 * - 0b0 - Local
 * - 0b1 - Global
 */
/*@{*/
/*! @brief Read current value of the MSCM_OCMDR_FMT field. */
#define MSCM_RD_OCMDR_FMT(base, index) ((MSCM_OCMDR_REG(base, index) & MSCM_OCMDR_FMT_MASK) >> MSCM_OCMDR_FMT_SHIFT)
#define MSCM_BRD_OCMDR_FMT(base, index) (BME_UBFX32(&MSCM_OCMDR_REG(base, index), MSCM_OCMDR_FMT_SHIFT, MSCM_OCMDR_FMT_WIDTH))
/*@}*/

/*!
 * @name Register MSCM_OCMDR, field V[31] (RO)
 *
 * This field defines the validity (presence) of the on-chip memory.
 *
 * Values:
 * - 0b0 - OCMEMn is not present.
 * - 0b1 - OCMEMn is present.
 */
/*@{*/
/*! @brief Read current value of the MSCM_OCMDR_V field. */
#define MSCM_RD_OCMDR_V(base, index) ((MSCM_OCMDR_REG(base, index) & MSCM_OCMDR_V_MASK) >> MSCM_OCMDR_V_SHIFT)
#define MSCM_BRD_OCMDR_V(base, index) (BME_UBFX32(&MSCM_OCMDR_REG(base, index), MSCM_OCMDR_V_SHIFT, MSCM_OCMDR_V_WIDTH))
/*@}*/

/*
 * MKV58F24 NV
 *
 * Flash configuration field
 *
 * Registers defined in this header file:
 * - NV_BACKKEY3 - Backdoor Comparison Key 3.
 * - NV_BACKKEY2 - Backdoor Comparison Key 2.
 * - NV_BACKKEY1 - Backdoor Comparison Key 1.
 * - NV_BACKKEY0 - Backdoor Comparison Key 0.
 * - NV_BACKKEY7 - Backdoor Comparison Key 7.
 * - NV_BACKKEY6 - Backdoor Comparison Key 6.
 * - NV_BACKKEY5 - Backdoor Comparison Key 5.
 * - NV_BACKKEY4 - Backdoor Comparison Key 4.
 * - NV_FPROT3 - Non-volatile P-Flash Protection 1 - Low Register
 * - NV_FPROT2 - Non-volatile P-Flash Protection 1 - High Register
 * - NV_FPROT1 - Non-volatile P-Flash Protection 0 - Low Register
 * - NV_FPROT0 - Non-volatile P-Flash Protection 0 - High Register
 * - NV_FSEC - Non-volatile Flash Security Register
 * - NV_FOPT - Non-volatile Flash Option Register
 */

