ErichStyger/mcuoneclipse/Examples/KDS/TWR-KV58F220M/TWR_KV58F220M_PEx_2_SDKv2/SDK/platform/devices/MKV58F24/include/MKV58F24_extension.h
/*******************************************************************************
 * PORT_DFCR - Digital Filter Clock Register
 ******************************************************************************/

/*!
 * @brief PORT_DFCR - Digital Filter Clock Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register is read only for ports that do not support a digital filter.
 * The digital filter configuration is valid in all digital pin muxing modes.
 */
/*!
 * @name Constants and macros for entire PORT_DFCR register
 */
/*@{*/
#define PORT_RD_DFCR(base)       (PORT_DFCR_REG(base))
#define PORT_WR_DFCR(base, value) (PORT_DFCR_REG(base) = (value))
#define PORT_RMW_DFCR(base, mask, value) (PORT_WR_DFCR(base, (PORT_RD_DFCR(base) & ~(mask)) | (value)))
#define PORT_SET_DFCR(base, value) (BME_OR32(&PORT_DFCR_REG(base), (uint32_t)(value)))
#define PORT_CLR_DFCR(base, value) (BME_AND32(&PORT_DFCR_REG(base), (uint32_t)(~(value))))
#define PORT_TOG_DFCR(base, value) (BME_XOR32(&PORT_DFCR_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual PORT_DFCR bitfields
 */

/*!
 * @name Register PORT_DFCR, field CS[0] (RW)
 *
 * The digital filter configuration is valid in all digital pin muxing modes.
 * Configures the clock source for the digital input filters. Changing the filter
 * clock source must be done only when all digital filters are disabled.
 *
 * Values:
 * - 0b0 - Digital filters are clocked by the bus clock.
 * - 0b1 - Digital filters are clocked by the LPO clock.
 */
/*@{*/
/*! @brief Read current value of the PORT_DFCR_CS field. */
#define PORT_RD_DFCR_CS(base) ((PORT_DFCR_REG(base) & PORT_DFCR_CS_MASK) >> PORT_DFCR_CS_SHIFT)
#define PORT_BRD_DFCR_CS(base) (BME_UBFX32(&PORT_DFCR_REG(base), PORT_DFCR_CS_SHIFT, PORT_DFCR_CS_WIDTH))

/*! @brief Set the CS field to a new value. */
#define PORT_WR_DFCR_CS(base, value) (PORT_RMW_DFCR(base, PORT_DFCR_CS_MASK, PORT_DFCR_CS(value)))
#define PORT_BWR_DFCR_CS(base, value) (BME_BFI32(&PORT_DFCR_REG(base), ((uint32_t)(value) << PORT_DFCR_CS_SHIFT), PORT_DFCR_CS_SHIFT, PORT_DFCR_CS_WIDTH))
/*@}*/

/*******************************************************************************
 * PORT_DFWR - Digital Filter Width Register
 ******************************************************************************/

/*!
 * @brief PORT_DFWR - Digital Filter Width Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register is read only for ports that do not support a digital filter.
 * The digital filter configuration is valid in all digital pin muxing modes.
 */
/*!
 * @name Constants and macros for entire PORT_DFWR register
 */
/*@{*/
#define PORT_RD_DFWR(base)       (PORT_DFWR_REG(base))
#define PORT_WR_DFWR(base, value) (PORT_DFWR_REG(base) = (value))
#define PORT_RMW_DFWR(base, mask, value) (PORT_WR_DFWR(base, (PORT_RD_DFWR(base) & ~(mask)) | (value)))
#define PORT_SET_DFWR(base, value) (BME_OR32(&PORT_DFWR_REG(base), (uint32_t)(value)))
#define PORT_CLR_DFWR(base, value) (BME_AND32(&PORT_DFWR_REG(base), (uint32_t)(~(value))))
#define PORT_TOG_DFWR(base, value) (BME_XOR32(&PORT_DFWR_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual PORT_DFWR bitfields
 */

/*!
 * @name Register PORT_DFWR, field FILT[4:0] (RW)
 *
 * The digital filter configuration is valid in all digital pin muxing modes.
 * Configures the maximum size of the glitches, in clock cycles, that the digital
 * filter absorbs for the enabled digital filters. Glitches that are longer than
 * this register setting will pass through the digital filter, and glitches that
 * are equal to or less than this register setting are filtered. Changing the
 * filter length must be done only after all filters are disabled.
 */
/*@{*/
/*! @brief Read current value of the PORT_DFWR_FILT field. */
#define PORT_RD_DFWR_FILT(base) ((PORT_DFWR_REG(base) & PORT_DFWR_FILT_MASK) >> PORT_DFWR_FILT_SHIFT)
#define PORT_BRD_DFWR_FILT(base) (BME_UBFX32(&PORT_DFWR_REG(base), PORT_DFWR_FILT_SHIFT, PORT_DFWR_FILT_WIDTH))

/*! @brief Set the FILT field to a new value. */
#define PORT_WR_DFWR_FILT(base, value) (PORT_RMW_DFWR(base, PORT_DFWR_FILT_MASK, PORT_DFWR_FILT(value)))
#define PORT_BWR_DFWR_FILT(base, value) (BME_BFI32(&PORT_DFWR_REG(base), ((uint32_t)(value) << PORT_DFWR_FILT_SHIFT), PORT_DFWR_FILT_SHIFT, PORT_DFWR_FILT_WIDTH))
/*@}*/

/*
 * MKV58F24 PWM
 *
 * Pulse Width Modulator with nano edge placement
 *
 * Registers defined in this header file:
 * - PWM_CNT - Counter Register
 * - PWM_INIT - Initial Count Register
 * - PWM_CTRL2 - Control 2 Register
 * - PWM_CTRL - Control Register
 * - PWM_VAL0 - Value Register 0
 * - PWM_FRACVAL1 - Fractional Value Register 1
 * - PWM_VAL1 - Value Register 1
 * - PWM_FRACVAL2 - Fractional Value Register 2
 * - PWM_VAL2 - Value Register 2
 * - PWM_FRACVAL3 - Fractional Value Register 3
 * - PWM_VAL3 - Value Register 3
 * - PWM_FRACVAL4 - Fractional Value Register 4
 * - PWM_VAL4 - Value Register 4
 * - PWM_FRACVAL5 - Fractional Value Register 5
 * - PWM_VAL5 - Value Register 5
 * - PWM_FRCTRL - Fractional Control Register
 * - PWM_OCTRL - Output Control Register
 * - PWM_STS - Status Register
 * - PWM_INTEN - Interrupt Enable Register
 * - PWM_DMAEN - DMA Enable Register
 * - PWM_TCTRL - Output Trigger Control Register
 * - PWM_DISMAP - Fault Disable Mapping Register 0
 * - PWM_DTCNT0 - Deadtime Count Register 0
 * - PWM_DTCNT1 - Deadtime Count Register 1
 * - PWM_CAPTCTRLA - Capture Control A Register
 * - PWM_CAPTCOMPA - Capture Compare A Register
 * - PWM_CAPTCTRLB - Capture Control B Register
 * - PWM_CAPTCOMPB - Capture Compare B Register
 * - PWM_CAPTCTRLX - Capture Control X Register
 * - PWM_CAPTCOMPX - Capture Compare X Register
 * - PWM_CVAL0 - Capture Value 0 Register
 * - PWM_CVAL0CYC - Capture Value 0 Cycle Register
 * - PWM_CVAL1 - Capture Value 1 Register
 * - PWM_CVAL1CYC - Capture Value 1 Cycle Register
 * - PWM_CVAL2 - Capture Value 2 Register
 * - PWM_CVAL2CYC - Capture Value 2 Cycle Register
 * - PWM_CVAL3 - Capture Value 3 Register
 * - PWM_CVAL3CYC - Capture Value 3 Cycle Register
 * - PWM_CVAL4 - Capture Value 4 Register
 * - PWM_CVAL4CYC - Capture Value 4 Cycle Register
 * - PWM_CVAL5 - Capture Value 5 Register
 * - PWM_CVAL5CYC - Capture Value 5 Cycle Register
 * - PWM_OUTEN - Output Enable Register
 * - PWM_MASK - Mask Register
 * - PWM_SWCOUT - Software Controlled Output Register
 * - PWM_DTSRCSEL - PWM Source Select Register
 * - PWM_MCTRL - Master Control Register 0
 * - PWM_MCTRL2 - Master Control Register 1
 * - PWM_FCTRL - Fault Control Register
 * - PWM_FSTS - Fault Status Register
 * - PWM_FFILT - Fault Filter Register
 * - PWM_FTST - Fault Test Register
 * - PWM_FCTRL2 - Fault Control 2 Register
 */

