ErichStyger/mcuoneclipse/Examples/KDS/TWR-KV58F220M/TWR_KV58F220M_PEx_2_SDKv2/SDK/platform/devices/MKV58F24/include/MKV58F24_extension.h
#define PWM_INSTANCE_COUNT (2U) /*!< Number of instances of the PWM module. */
#define PWM0_IDX (0U) /*!< Instance number for PWM0. */
#define PWM1_IDX (1U) /*!< Instance number for PWM1. */

/*******************************************************************************
 * PWM_CNT - Counter Register
 ******************************************************************************/

/*!
 * @brief PWM_CNT - Counter Register (RO)
 *
 * Reset value: 0x0000U
 *
 * This read-only register displays the state of the signed 16-bit submodule
 * counter. This register is not byte accessible.
 */
/*!
 * @name Constants and macros for entire PWM_CNT register
 */
/*@{*/
#define PWM_RD_CNT(base, index)  (PWM_CNT_REG(base, index))
/*@}*/

/*******************************************************************************
 * PWM_INIT - Initial Count Register
 ******************************************************************************/

/*!
 * @brief PWM_INIT - Initial Count Register (RW)
 *
 * Reset value: 0x0000U
 *
 * The 16-bit signed value in this buffered, read/write register defines the
 * initial count value for the PWM in PWM clock periods. This is the value loaded
 * into the submodule counter when local sync, master sync, or master reload is
 * asserted (based on the value of CTRL2[INIT_SEL]) or when CTRL2[FORCE] is asserted
 * and force init is enabled. For PWM operation, the buffered contents of this
 * register are loaded into the counter at the start of every PWM cycle. This
 * register is not byte accessible. The INIT register is buffered. The value written
 * does not take effect until MCTRL0[LDOK] is set and the next PWM load cycle
 * begins or CTRL[LDMOD] is set. This register cannot be written when MCTRL0[LDOK]
 * is set. Reading INIT reads the value in a buffer and not necessarily the value
 * the PWM generator is currently using.
 */
/*!
 * @name Constants and macros for entire PWM_INIT register
 */
/*@{*/
#define PWM_RD_INIT(base, index) (PWM_INIT_REG(base, index))
#define PWM_WR_INIT(base, index, value) (PWM_INIT_REG(base, index) = (value))
#define PWM_RMW_INIT(base, index, mask, value) (PWM_WR_INIT(base, index, (PWM_RD_INIT(base, index) & ~(mask)) | (value)))
#define PWM_SET_INIT(base, index, value) (BME_OR16(&PWM_INIT_REG(base, index), (uint16_t)(value)))
#define PWM_CLR_INIT(base, index, value) (BME_AND16(&PWM_INIT_REG(base, index), (uint16_t)(~(value))))
#define PWM_TOG_INIT(base, index, value) (BME_XOR16(&PWM_INIT_REG(base, index), (uint16_t)(value)))
/*@}*/

/*******************************************************************************
 * PWM_CTRL2 - Control 2 Register
 ******************************************************************************/

/*!
 * @brief PWM_CTRL2 - Control 2 Register (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire PWM_CTRL2 register
 */
/*@{*/
#define PWM_RD_CTRL2(base, index) (PWM_CTRL2_REG(base, index))
#define PWM_WR_CTRL2(base, index, value) (PWM_CTRL2_REG(base, index) = (value))
#define PWM_RMW_CTRL2(base, index, mask, value) (PWM_WR_CTRL2(base, index, (PWM_RD_CTRL2(base, index) & ~(mask)) | (value)))
#define PWM_SET_CTRL2(base, index, value) (BME_OR16(&PWM_CTRL2_REG(base, index), (uint16_t)(value)))
#define PWM_CLR_CTRL2(base, index, value) (BME_AND16(&PWM_CTRL2_REG(base, index), (uint16_t)(~(value))))
#define PWM_TOG_CTRL2(base, index, value) (BME_XOR16(&PWM_CTRL2_REG(base, index), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual PWM_CTRL2 bitfields
 */

/*!
 * @name Register PWM_CTRL2, field CLK_SEL[1:0] (RW)
 *
 * These read/write bits determine the source of the clock signal for this
 * submodule.
 *
 * Values:
 * - 0b00 - The IPBus clock is used as the clock for the local prescaler and
 *     counter.
 * - 0b01 - EXT_CLK is used as the clock for the local prescaler and counter.
 * - 0b10 - Submodule 0's clock (AUX_CLK) is used as the source clock for the
 *     local prescaler and counter. This setting should not be used in submodule 0
 *     as it will force the clock to logic 0.
 * - 0b11 - reserved
 */
/*@{*/
/*! @brief Read current value of the PWM_CTRL2_CLK_SEL field. */
#define PWM_RD_CTRL2_CLK_SEL(base, index) ((PWM_CTRL2_REG(base, index) & PWM_CTRL2_CLK_SEL_MASK) >> PWM_CTRL2_CLK_SEL_SHIFT)
#define PWM_BRD_CTRL2_CLK_SEL(base, index) (BME_UBFX16(&PWM_CTRL2_REG(base, index), PWM_CTRL2_CLK_SEL_SHIFT, PWM_CTRL2_CLK_SEL_WIDTH))

/*! @brief Set the CLK_SEL field to a new value. */
#define PWM_WR_CTRL2_CLK_SEL(base, index, value) (PWM_RMW_CTRL2(base, index, PWM_CTRL2_CLK_SEL_MASK, PWM_CTRL2_CLK_SEL(value)))
#define PWM_BWR_CTRL2_CLK_SEL(base, index, value) (BME_BFI16(&PWM_CTRL2_REG(base, index), ((uint16_t)(value) << PWM_CTRL2_CLK_SEL_SHIFT), PWM_CTRL2_CLK_SEL_SHIFT, PWM_CTRL2_CLK_SEL_WIDTH))
/*@}*/

/*!
 * @name Register PWM_CTRL2, field RELOAD_SEL[2] (RW)
 *
 * This read/write bit determines the source of the RELOAD signal for this
 * submodule. When this bit is set, MCTRL0[LDOK[0]] for submodule 0 should be used
 * since the local MCTRL0[LDOK] will be ignored.
 *
 * Values:
 * - 0b0 - The local RELOAD signal is used to reload registers.
 * - 0b1 - The master RELOAD signal (from submodule 0) is used to reload
 *     registers. This setting should not be used in submodule 0 as it will force the
 *     RELOAD signal to logic 0.
 */
/*@{*/
/*! @brief Read current value of the PWM_CTRL2_RELOAD_SEL field. */
#define PWM_RD_CTRL2_RELOAD_SEL(base, index) ((PWM_CTRL2_REG(base, index) & PWM_CTRL2_RELOAD_SEL_MASK) >> PWM_CTRL2_RELOAD_SEL_SHIFT)
#define PWM_BRD_CTRL2_RELOAD_SEL(base, index) (BME_UBFX16(&PWM_CTRL2_REG(base, index), PWM_CTRL2_RELOAD_SEL_SHIFT, PWM_CTRL2_RELOAD_SEL_WIDTH))

/*! @brief Set the RELOAD_SEL field to a new value. */
#define PWM_WR_CTRL2_RELOAD_SEL(base, index, value) (PWM_RMW_CTRL2(base, index, PWM_CTRL2_RELOAD_SEL_MASK, PWM_CTRL2_RELOAD_SEL(value)))
#define PWM_BWR_CTRL2_RELOAD_SEL(base, index, value) (BME_BFI16(&PWM_CTRL2_REG(base, index), ((uint16_t)(value) << PWM_CTRL2_RELOAD_SEL_SHIFT), PWM_CTRL2_RELOAD_SEL_SHIFT, PWM_CTRL2_RELOAD_SEL_WIDTH))
/*@}*/

/*!
 * @name Register PWM_CTRL2, field FORCE_SEL[5:3] (RW)
 *
 * Values:
 * - 0b000 - The local force signal, CTRL2[FORCE], from this submodule is used
 *     to force updates.
 * - 0b001 - The master force signal from submodule 0 is used to force updates.
 *     This setting should not be used in submodule 0 as it will hold the FORCE
 *     OUTPUT signal to logic 0.
 * - 0b010 - The local reload signal from this submodule is used to force
 *     updates without regard to the state of LDOK.
 * - 0b011 - The master reload signal from submodule0 is used to force updates
 *     if LDOK is set. This setting should not be used in submodule0 as it will
 *     hold the FORCE OUTPUT signal to logic 0.
 * - 0b100 - The local sync signal from this submodule is used to force updates.
 * - 0b101 - The master sync signal from submodule0 is used to force updates.
 *     This setting should not be used in submodule0 as it will hold the FORCE
 *     OUTPUT signal to logic 0.
 * - 0b110 - The external force signal, EXT_FORCE, from outside the PWM module
 *     causes updates.
 * - 0b111 - The external sync signal, EXT_SYNC, from outside the PWM module
 *     causes updates.
 */
/*@{*/
/*! @brief Read current value of the PWM_CTRL2_FORCE_SEL field. */
#define PWM_RD_CTRL2_FORCE_SEL(base, index) ((PWM_CTRL2_REG(base, index) & PWM_CTRL2_FORCE_SEL_MASK) >> PWM_CTRL2_FORCE_SEL_SHIFT)
#define PWM_BRD_CTRL2_FORCE_SEL(base, index) (BME_UBFX16(&PWM_CTRL2_REG(base, index), PWM_CTRL2_FORCE_SEL_SHIFT, PWM_CTRL2_FORCE_SEL_WIDTH))

