ErichStyger/mcuoneclipse/Examples/KDS/TWR-KV58F220M/TWR_KV58F220M_PEx_2_SDKv2/SDK/platform/devices/MKV58F24/include/MKV58F24_extension.h
/*! @brief Set the WAITEN field to a new value. */
#define PWM_WR_CTRL2_WAITEN(base, index, value) (PWM_RMW_CTRL2(base, index, PWM_CTRL2_WAITEN_MASK, PWM_CTRL2_WAITEN(value)))
#define PWM_BWR_CTRL2_WAITEN(base, index, value) (BME_BFI16(&PWM_CTRL2_REG(base, index), ((uint16_t)(value) << PWM_CTRL2_WAITEN_SHIFT), PWM_CTRL2_WAITEN_SHIFT, PWM_CTRL2_WAITEN_WIDTH))
/*@}*/

/*!
 * @name Register PWM_CTRL2, field DBGEN[15] (RW)
 *
 * When set to one, the PWM will continue to run while the chip is in debug
 * mode. If the device enters debug mode and this bit is zero, then the PWM outputs
 * will be disabled until debug mode is exited. At that point the PWM pins will
 * resume operation as programmed in the PWM registers. For certain types of motors
 * (such as 3-phase AC), it is imperative that this bit be left in its default
 * state (in which the PWM is disabled in debug mode). Failure to do so could
 * result in damage to the motor or inverter. For other types of motors (example: DC
 * motors), this bit might safely be set to one, enabling the PWM in debug mode.
 * The key point is PWM parameter updates will not occur in debug mode. Any
 * motors requiring such updates should be disabled during debug mode. If in doubt,
 * leave this bit set to zero.
 */
/*@{*/
/*! @brief Read current value of the PWM_CTRL2_DBGEN field. */
#define PWM_RD_CTRL2_DBGEN(base, index) ((PWM_CTRL2_REG(base, index) & PWM_CTRL2_DBGEN_MASK) >> PWM_CTRL2_DBGEN_SHIFT)
#define PWM_BRD_CTRL2_DBGEN(base, index) (BME_UBFX16(&PWM_CTRL2_REG(base, index), PWM_CTRL2_DBGEN_SHIFT, PWM_CTRL2_DBGEN_WIDTH))

/*! @brief Set the DBGEN field to a new value. */
#define PWM_WR_CTRL2_DBGEN(base, index, value) (PWM_RMW_CTRL2(base, index, PWM_CTRL2_DBGEN_MASK, PWM_CTRL2_DBGEN(value)))
#define PWM_BWR_CTRL2_DBGEN(base, index, value) (BME_BFI16(&PWM_CTRL2_REG(base, index), ((uint16_t)(value) << PWM_CTRL2_DBGEN_SHIFT), PWM_CTRL2_DBGEN_SHIFT, PWM_CTRL2_DBGEN_WIDTH))
/*@}*/

/*******************************************************************************
 * PWM_CTRL - Control Register
 ******************************************************************************/

/*!
 * @brief PWM_CTRL - Control Register (RW)
 *
 * Reset value: 0x0400U
 */
/*!
 * @name Constants and macros for entire PWM_CTRL register
 */
/*@{*/
#define PWM_RD_CTRL(base, index) (PWM_CTRL_REG(base, index))
#define PWM_WR_CTRL(base, index, value) (PWM_CTRL_REG(base, index) = (value))
#define PWM_RMW_CTRL(base, index, mask, value) (PWM_WR_CTRL(base, index, (PWM_RD_CTRL(base, index) & ~(mask)) | (value)))
#define PWM_SET_CTRL(base, index, value) (BME_OR16(&PWM_CTRL_REG(base, index), (uint16_t)(value)))
#define PWM_CLR_CTRL(base, index, value) (BME_AND16(&PWM_CTRL_REG(base, index), (uint16_t)(~(value))))
#define PWM_TOG_CTRL(base, index, value) (BME_XOR16(&PWM_CTRL_REG(base, index), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual PWM_CTRL bitfields
 */

/*!
 * @name Register PWM_CTRL, field DBLEN[0] (RW)
 *
 * This read/write bit enables the double switching PWM behavior(See Double
 * Switching PWMs). Double switching is not compatible with fractional PWM clock
 * generation. Make sure this bit is clear when setting FRCTRL[FRAC23_EN],
 * FRCTRL[FRAC45_EN], or FRCTRL[FRAC1_EN].
 *
 * Values:
 * - 0b0 - Double switching disabled.
 * - 0b1 - Double switching enabled.
 */
/*@{*/
/*! @brief Read current value of the PWM_CTRL_DBLEN field. */
#define PWM_RD_CTRL_DBLEN(base, index) ((PWM_CTRL_REG(base, index) & PWM_CTRL_DBLEN_MASK) >> PWM_CTRL_DBLEN_SHIFT)
#define PWM_BRD_CTRL_DBLEN(base, index) (BME_UBFX16(&PWM_CTRL_REG(base, index), PWM_CTRL_DBLEN_SHIFT, PWM_CTRL_DBLEN_WIDTH))

/*! @brief Set the DBLEN field to a new value. */
#define PWM_WR_CTRL_DBLEN(base, index, value) (PWM_RMW_CTRL(base, index, PWM_CTRL_DBLEN_MASK, PWM_CTRL_DBLEN(value)))
#define PWM_BWR_CTRL_DBLEN(base, index, value) (BME_BFI16(&PWM_CTRL_REG(base, index), ((uint16_t)(value) << PWM_CTRL_DBLEN_SHIFT), PWM_CTRL_DBLEN_SHIFT, PWM_CTRL_DBLEN_WIDTH))
/*@}*/

/*!
 * @name Register PWM_CTRL, field DBLX[1] (RW)
 *
 * This read/write bit enables the double switching behavior on PWMX. When this
 * bit is set, the PWMX output shall be the exclusive OR combination of PWM0 and
 * PWM1 prior to polarity and masking considerations.
 *
 * Values:
 * - 0b0 - PWMX double pulse disabled.
 * - 0b1 - PWMX double pulse enabled.
 */
/*@{*/
/*! @brief Read current value of the PWM_CTRL_DBLX field. */
#define PWM_RD_CTRL_DBLX(base, index) ((PWM_CTRL_REG(base, index) & PWM_CTRL_DBLX_MASK) >> PWM_CTRL_DBLX_SHIFT)
#define PWM_BRD_CTRL_DBLX(base, index) (BME_UBFX16(&PWM_CTRL_REG(base, index), PWM_CTRL_DBLX_SHIFT, PWM_CTRL_DBLX_WIDTH))

/*! @brief Set the DBLX field to a new value. */
#define PWM_WR_CTRL_DBLX(base, index, value) (PWM_RMW_CTRL(base, index, PWM_CTRL_DBLX_MASK, PWM_CTRL_DBLX(value)))
#define PWM_BWR_CTRL_DBLX(base, index, value) (BME_BFI16(&PWM_CTRL_REG(base, index), ((uint16_t)(value) << PWM_CTRL_DBLX_SHIFT), PWM_CTRL_DBLX_SHIFT, PWM_CTRL_DBLX_WIDTH))
/*@}*/

/*!
 * @name Register PWM_CTRL, field LDMOD[2] (RW)
 *
 * This read/write bit selects the timing of loading the buffered registers for
 * this submodule.
 *
 * Values:
 * - 0b0 - Buffered registers of this submodule are loaded and take effect at
 *     the next PWM reload if MCTRL0[LDOK] is set.
 * - 0b1 - Buffered registers of this submodule are loaded and take effect
 *     immediately upon MCTRL0[LDOK] being set. In this case it is not necessary to
 *     set CTRL[FULL] or CTRL[HALF].
 */
/*@{*/
/*! @brief Read current value of the PWM_CTRL_LDMOD field. */
#define PWM_RD_CTRL_LDMOD(base, index) ((PWM_CTRL_REG(base, index) & PWM_CTRL_LDMOD_MASK) >> PWM_CTRL_LDMOD_SHIFT)
#define PWM_BRD_CTRL_LDMOD(base, index) (BME_UBFX16(&PWM_CTRL_REG(base, index), PWM_CTRL_LDMOD_SHIFT, PWM_CTRL_LDMOD_WIDTH))

/*! @brief Set the LDMOD field to a new value. */
#define PWM_WR_CTRL_LDMOD(base, index, value) (PWM_RMW_CTRL(base, index, PWM_CTRL_LDMOD_MASK, PWM_CTRL_LDMOD(value)))
#define PWM_BWR_CTRL_LDMOD(base, index, value) (BME_BFI16(&PWM_CTRL_REG(base, index), ((uint16_t)(value) << PWM_CTRL_LDMOD_SHIFT), PWM_CTRL_LDMOD_SHIFT, PWM_CTRL_LDMOD_WIDTH))
/*@}*/

/*!
 * @name Register PWM_CTRL, field PRSC[6:4] (RW)
 *
 * These buffered read/write bits select the divide ratio of the PWM clock
 * frequency selected by CTRL2[CLK_SEL]. Reading CTRL[PRSC] reads the buffered values
 * and not necessarily the values currently in effect. CTRL[PRSC] takes effect at
 * the beginning of the next PWM cycle and only when the load okay bit,
 * MCTRL0[LDOK], is set or CTRL[LDMOD] is set. This field cannot be written when
 * MCTRL0[LDOK] is set.
 *
 * Values:
 * - 0b000 - PWM clock frequency = fclk
 * - 0b001 - PWM clock frequency = fclk/2
 * - 0b010 - PWM clock frequency = fclk/4
 * - 0b011 - PWM clock frequency = fclk/8
 * - 0b100 - PWM clock frequency = fclk/16
 * - 0b101 - PWM clock frequency = fclk/32
 * - 0b110 - PWM clock frequency = fclk/64
 * - 0b111 - PWM clock frequency = fclk/128
 */
/*@{*/
/*! @brief Read current value of the PWM_CTRL_PRSC field. */
#define PWM_RD_CTRL_PRSC(base, index) ((PWM_CTRL_REG(base, index) & PWM_CTRL_PRSC_MASK) >> PWM_CTRL_PRSC_SHIFT)
#define PWM_BRD_CTRL_PRSC(base, index) (BME_UBFX16(&PWM_CTRL_REG(base, index), PWM_CTRL_PRSC_SHIFT, PWM_CTRL_PRSC_WIDTH))

/*! @brief Set the PRSC field to a new value. */
#define PWM_WR_CTRL_PRSC(base, index, value) (PWM_RMW_CTRL(base, index, PWM_CTRL_PRSC_MASK, PWM_CTRL_PRSC(value)))
#define PWM_BWR_CTRL_PRSC(base, index, value) (BME_BFI16(&PWM_CTRL_REG(base, index), ((uint16_t)(value) << PWM_CTRL_PRSC_SHIFT), PWM_CTRL_PRSC_SHIFT, PWM_CTRL_PRSC_WIDTH))
/*@}*/

/*!
 * @name Register PWM_CTRL, field DT[9:8] (RO)
 *
 * These read only bits reflect the sampled values of the PWM_X input at the end
 * of each deadtime. Sampling occurs at the end of deadtime 0 for DT[0] and the
 * end of deadtime 1 for DT[1]. Reset clears these bits.
 */
/*@{*/
/*! @brief Read current value of the PWM_CTRL_DT field. */
#define PWM_RD_CTRL_DT(base, index) ((PWM_CTRL_REG(base, index) & PWM_CTRL_DT_MASK) >> PWM_CTRL_DT_SHIFT)
#define PWM_BRD_CTRL_DT(base, index) (BME_UBFX16(&PWM_CTRL_REG(base, index), PWM_CTRL_DT_SHIFT, PWM_CTRL_DT_WIDTH))
/*@}*/

/*!
 * @name Register PWM_CTRL, field FULL[10] (RW)
 *
 * This read/write bit enables full-cycle reloads. A full cycle is defined by
 * when the submodule counter matches the VAL1 register. Either CTRL[HALF] or
 * CTRL[FULL] must be set in order to move the buffered data into the registers used
 * by the PWM generators or CTRL[LDMOD] must be set. If both CTRL[HALF] and
 * CTRL[FULL] are set, then reloads can occur twice per cycle.
 *
 * Values:
 * - 0b0 - Full-cycle reloads disabled.
 * - 0b1 - Full-cycle reloads enabled.
 */
/*@{*/
/*! @brief Read current value of the PWM_CTRL_FULL field. */
#define PWM_RD_CTRL_FULL(base, index) ((PWM_CTRL_REG(base, index) & PWM_CTRL_FULL_MASK) >> PWM_CTRL_FULL_SHIFT)
#define PWM_BRD_CTRL_FULL(base, index) (BME_UBFX16(&PWM_CTRL_REG(base, index), PWM_CTRL_FULL_SHIFT, PWM_CTRL_FULL_WIDTH))

/*! @brief Set the FULL field to a new value. */
#define PWM_WR_CTRL_FULL(base, index, value) (PWM_RMW_CTRL(base, index, PWM_CTRL_FULL_MASK, PWM_CTRL_FULL(value)))
#define PWM_BWR_CTRL_FULL(base, index, value) (BME_BFI16(&PWM_CTRL_REG(base, index), ((uint16_t)(value) << PWM_CTRL_FULL_SHIFT), PWM_CTRL_FULL_SHIFT, PWM_CTRL_FULL_WIDTH))
/*@}*/

/*!
 * @name Register PWM_CTRL, field HALF[11] (RW)
 *
 * This read/write bit enables half-cycle reloads. A half cycle is defined by
 * when the submodule counter matches the VAL0 register and does not have to be
 * half way through the PWM cycle.
 *
 * Values:
 * - 0b0 - Half-cycle reloads disabled.
 * - 0b1 - Half-cycle reloads enabled.
 */
/*@{*/
/*! @brief Read current value of the PWM_CTRL_HALF field. */
#define PWM_RD_CTRL_HALF(base, index) ((PWM_CTRL_REG(base, index) & PWM_CTRL_HALF_MASK) >> PWM_CTRL_HALF_SHIFT)
#define PWM_BRD_CTRL_HALF(base, index) (BME_UBFX16(&PWM_CTRL_REG(base, index), PWM_CTRL_HALF_SHIFT, PWM_CTRL_HALF_WIDTH))

/*! @brief Set the HALF field to a new value. */
#define PWM_WR_CTRL_HALF(base, index, value) (PWM_RMW_CTRL(base, index, PWM_CTRL_HALF_MASK, PWM_CTRL_HALF(value)))
#define PWM_BWR_CTRL_HALF(base, index, value) (BME_BFI16(&PWM_CTRL_REG(base, index), ((uint16_t)(value) << PWM_CTRL_HALF_SHIFT), PWM_CTRL_HALF_SHIFT, PWM_CTRL_HALF_WIDTH))
/*@}*/

/*!
 * @name Register PWM_CTRL, field LDFQ[15:12] (RW)
 *
 * These buffered read/write bits select the PWM load frequency. Reset clears
 * LDFQ, selecting loading every PWM opportunity. A PWM opportunity is determined
 * by HALF and FULL. LDFQ takes effect when the current load cycle is complete,
 * regardless of the state of MCTRL0[LDOK]. Reading LDFQ reads the buffered values
 * and not necessarily the values currently in effect.
 *
 * Values:
 * - 0b0000 - Every PWM opportunity
 * - 0b0001 - Every 2 PWM opportunities
 * - 0b0010 - Every 3 PWM opportunities
 * - 0b0011 - Every 4 PWM opportunities
 * - 0b0100 - Every 5 PWM opportunities
 * - 0b0101 - Every 6 PWM opportunities
 * - 0b0110 - Every 7 PWM opportunities
 * - 0b0111 - Every 8 PWM opportunities
 * - 0b1000 - Every 9 PWM opportunities
 * - 0b1001 - Every 10 PWM opportunities
 * - 0b1010 - Every 11 PWM opportunities
 * - 0b1011 - Every 12 PWM opportunities
 * - 0b1100 - Every 13 PWM opportunities
 * - 0b1101 - Every 14 PWM opportunities
 * - 0b1110 - Every 15 PWM opportunities
 * - 0b1111 - Every 16 PWM opportunities
 */
/*@{*/
/*! @brief Read current value of the PWM_CTRL_LDFQ field. */
#define PWM_RD_CTRL_LDFQ(base, index) ((PWM_CTRL_REG(base, index) & PWM_CTRL_LDFQ_MASK) >> PWM_CTRL_LDFQ_SHIFT)
#define PWM_BRD_CTRL_LDFQ(base, index) (BME_UBFX16(&PWM_CTRL_REG(base, index), PWM_CTRL_LDFQ_SHIFT, PWM_CTRL_LDFQ_WIDTH))

