ErichStyger/mcuoneclipse/Examples/KDS/TWR-KV58F220M/TWR_KV58F220M_PEx_2_SDKv2/SDK/platform/devices/MKV58F24/include/MKV58F24_extension.h
/*! @brief Set the LDFQ field to a new value. */
#define PWM_WR_CTRL_LDFQ(base, index, value) (PWM_RMW_CTRL(base, index, PWM_CTRL_LDFQ_MASK, PWM_CTRL_LDFQ(value)))
#define PWM_BWR_CTRL_LDFQ(base, index, value) (BME_BFI16(&PWM_CTRL_REG(base, index), ((uint16_t)(value) << PWM_CTRL_LDFQ_SHIFT), PWM_CTRL_LDFQ_SHIFT, PWM_CTRL_LDFQ_WIDTH))
/*@}*/

/*******************************************************************************
 * PWM_VAL0 - Value Register 0
 ******************************************************************************/

/*!
 * @brief PWM_VAL0 - Value Register 0 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire PWM_VAL0 register
 */
/*@{*/
#define PWM_RD_VAL0(base, index) (PWM_VAL0_REG(base, index))
#define PWM_WR_VAL0(base, index, value) (PWM_VAL0_REG(base, index) = (value))
#define PWM_RMW_VAL0(base, index, mask, value) (PWM_WR_VAL0(base, index, (PWM_RD_VAL0(base, index) & ~(mask)) | (value)))
#define PWM_SET_VAL0(base, index, value) (BME_OR16(&PWM_VAL0_REG(base, index), (uint16_t)(value)))
#define PWM_CLR_VAL0(base, index, value) (BME_AND16(&PWM_VAL0_REG(base, index), (uint16_t)(~(value))))
#define PWM_TOG_VAL0(base, index, value) (BME_XOR16(&PWM_VAL0_REG(base, index), (uint16_t)(value)))
/*@}*/

/*******************************************************************************
 * PWM_FRACVAL1 - Fractional Value Register 1
 ******************************************************************************/

/*!
 * @brief PWM_FRACVAL1 - Fractional Value Register 1 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire PWM_FRACVAL1 register
 */
/*@{*/
#define PWM_RD_FRACVAL1(base, index) (PWM_FRACVAL1_REG(base, index))
#define PWM_WR_FRACVAL1(base, index, value) (PWM_FRACVAL1_REG(base, index) = (value))
#define PWM_RMW_FRACVAL1(base, index, mask, value) (PWM_WR_FRACVAL1(base, index, (PWM_RD_FRACVAL1(base, index) & ~(mask)) | (value)))
#define PWM_SET_FRACVAL1(base, index, value) (BME_OR16(&PWM_FRACVAL1_REG(base, index), (uint16_t)(value)))
#define PWM_CLR_FRACVAL1(base, index, value) (BME_AND16(&PWM_FRACVAL1_REG(base, index), (uint16_t)(~(value))))
#define PWM_TOG_FRACVAL1(base, index, value) (BME_XOR16(&PWM_FRACVAL1_REG(base, index), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual PWM_FRACVAL1 bitfields
 */

/*!
 * @name Register PWM_FRACVAL1, field FRACVAL1[15:11] (RW)
 *
 * These bits act as a fractional addition to the value in the VAL1 register
 * which controls the PWM period width. The PWM period is computed in terms of IPBus
 * clock cycles. This fractional portion is accumulated at the end of every
 * cycle until an additional whole IPBus cycle is reached. At this time the value
 * being used for VAL1 is temporarily incremented and the PWM cycle is extended by
 * one clock period to compensate for the accumulated fractional values. The
 * FRACVAL1 register is buffered. The value written does not take effect until
 * MCTRL0[LDOK] is set and the next PWM load cycle begins or CTRL[LDMOD] is set.
 * FRACVAL1 cannot be written when MCTRL0[LDOK] is set. Reading FRACVAL1 reads the value
 * in a buffer and not necessarily the value the PWM generator is currently
 * using. If the VAL1 register defines the timer period (Local Sync is selected as
 * the counter initialization signal), a 100% duty cycle cannot be achieved on the
 * PWMX output. After the count reaches VAL1, the PWMX output is low for a
 * minimum of one count every cycle. When the Master Sync signal (only originated by
 * the Local Sync from sub-module 0) is used to control the timer period, the VAL1
 * register can be free for other functions such as PWM generation without the
 * duty cycle limitation.
 */
/*@{*/
/*! @brief Read current value of the PWM_FRACVAL1_FRACVAL1 field. */
#define PWM_RD_FRACVAL1_FRACVAL1(base, index) ((PWM_FRACVAL1_REG(base, index) & PWM_FRACVAL1_FRACVAL1_MASK) >> PWM_FRACVAL1_FRACVAL1_SHIFT)
#define PWM_BRD_FRACVAL1_FRACVAL1(base, index) (BME_UBFX16(&PWM_FRACVAL1_REG(base, index), PWM_FRACVAL1_FRACVAL1_SHIFT, PWM_FRACVAL1_FRACVAL1_WIDTH))

/*! @brief Set the FRACVAL1 field to a new value. */
#define PWM_WR_FRACVAL1_FRACVAL1(base, index, value) (PWM_RMW_FRACVAL1(base, index, PWM_FRACVAL1_FRACVAL1_MASK, PWM_FRACVAL1_FRACVAL1(value)))
#define PWM_BWR_FRACVAL1_FRACVAL1(base, index, value) (BME_BFI16(&PWM_FRACVAL1_REG(base, index), ((uint16_t)(value) << PWM_FRACVAL1_FRACVAL1_SHIFT), PWM_FRACVAL1_FRACVAL1_SHIFT, PWM_FRACVAL1_FRACVAL1_WIDTH))
/*@}*/

/*******************************************************************************
 * PWM_VAL1 - Value Register 1
 ******************************************************************************/

/*!
 * @brief PWM_VAL1 - Value Register 1 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire PWM_VAL1 register
 */
/*@{*/
#define PWM_RD_VAL1(base, index) (PWM_VAL1_REG(base, index))
#define PWM_WR_VAL1(base, index, value) (PWM_VAL1_REG(base, index) = (value))
#define PWM_RMW_VAL1(base, index, mask, value) (PWM_WR_VAL1(base, index, (PWM_RD_VAL1(base, index) & ~(mask)) | (value)))
#define PWM_SET_VAL1(base, index, value) (BME_OR16(&PWM_VAL1_REG(base, index), (uint16_t)(value)))
#define PWM_CLR_VAL1(base, index, value) (BME_AND16(&PWM_VAL1_REG(base, index), (uint16_t)(~(value))))
#define PWM_TOG_VAL1(base, index, value) (BME_XOR16(&PWM_VAL1_REG(base, index), (uint16_t)(value)))
/*@}*/

/*******************************************************************************
 * PWM_FRACVAL2 - Fractional Value Register 2
 ******************************************************************************/

/*!
 * @brief PWM_FRACVAL2 - Fractional Value Register 2 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire PWM_FRACVAL2 register
 */
/*@{*/
#define PWM_RD_FRACVAL2(base, index) (PWM_FRACVAL2_REG(base, index))
#define PWM_WR_FRACVAL2(base, index, value) (PWM_FRACVAL2_REG(base, index) = (value))
#define PWM_RMW_FRACVAL2(base, index, mask, value) (PWM_WR_FRACVAL2(base, index, (PWM_RD_FRACVAL2(base, index) & ~(mask)) | (value)))
#define PWM_SET_FRACVAL2(base, index, value) (BME_OR16(&PWM_FRACVAL2_REG(base, index), (uint16_t)(value)))
#define PWM_CLR_FRACVAL2(base, index, value) (BME_AND16(&PWM_FRACVAL2_REG(base, index), (uint16_t)(~(value))))
#define PWM_TOG_FRACVAL2(base, index, value) (BME_XOR16(&PWM_FRACVAL2_REG(base, index), (uint16_t)(value)))
/*@}*/

