ErichStyger/mcuoneclipse/Examples/KDS/TWR-KV58F220M/TWR_KV58F220M_PEx_2_SDKv2/SDK/platform/devices/MKV58F24/include/MKV58F24_extension.h
/*
 * Constants & macros for individual PWM_FRACVAL2 bitfields
 */

/*!
 * @name Register PWM_FRACVAL2, field FRACVAL2[15:11] (RW)
 *
 * These bits act as a fractional addition to the value in the VAL2 register
 * which controls the PWM_A turn on timing. It is also used to control the
 * fractional addition to the turn off delay of PWM_B when MCTRL0[IPOLx]=0 in
 * complementary mode, CTRL2[INDEP]=0. The FRACVAL2 register is buffered. The value written
 * does not take effect until MCTRL0[LDOK] is set and the next PWM load cycle
 * begins or CTRL[LDMOD] is set. FRACVAL2 cannot be written when MCTRL0[LDOK] is set.
 * Reading FRACVAL2 reads the value in a buffer and not necessarily the value
 * the PWM generator is currently using. FRCTRL[FRAC23_EN] should be set to 0 when
 * the values of VAL2 and VAL3 cause the high or low time of the PWM output to be
 * 3 cycles or less.
 */
/*@{*/
/*! @brief Read current value of the PWM_FRACVAL2_FRACVAL2 field. */
#define PWM_RD_FRACVAL2_FRACVAL2(base, index) ((PWM_FRACVAL2_REG(base, index) & PWM_FRACVAL2_FRACVAL2_MASK) >> PWM_FRACVAL2_FRACVAL2_SHIFT)
#define PWM_BRD_FRACVAL2_FRACVAL2(base, index) (BME_UBFX16(&PWM_FRACVAL2_REG(base, index), PWM_FRACVAL2_FRACVAL2_SHIFT, PWM_FRACVAL2_FRACVAL2_WIDTH))

/*! @brief Set the FRACVAL2 field to a new value. */
#define PWM_WR_FRACVAL2_FRACVAL2(base, index, value) (PWM_RMW_FRACVAL2(base, index, PWM_FRACVAL2_FRACVAL2_MASK, PWM_FRACVAL2_FRACVAL2(value)))
#define PWM_BWR_FRACVAL2_FRACVAL2(base, index, value) (BME_BFI16(&PWM_FRACVAL2_REG(base, index), ((uint16_t)(value) << PWM_FRACVAL2_FRACVAL2_SHIFT), PWM_FRACVAL2_FRACVAL2_SHIFT, PWM_FRACVAL2_FRACVAL2_WIDTH))
/*@}*/

/*******************************************************************************
 * PWM_VAL2 - Value Register 2
 ******************************************************************************/

/*!
 * @brief PWM_VAL2 - Value Register 2 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire PWM_VAL2 register
 */
/*@{*/
#define PWM_RD_VAL2(base, index) (PWM_VAL2_REG(base, index))
#define PWM_WR_VAL2(base, index, value) (PWM_VAL2_REG(base, index) = (value))
#define PWM_RMW_VAL2(base, index, mask, value) (PWM_WR_VAL2(base, index, (PWM_RD_VAL2(base, index) & ~(mask)) | (value)))
#define PWM_SET_VAL2(base, index, value) (BME_OR16(&PWM_VAL2_REG(base, index), (uint16_t)(value)))
#define PWM_CLR_VAL2(base, index, value) (BME_AND16(&PWM_VAL2_REG(base, index), (uint16_t)(~(value))))
#define PWM_TOG_VAL2(base, index, value) (BME_XOR16(&PWM_VAL2_REG(base, index), (uint16_t)(value)))
/*@}*/

/*******************************************************************************
 * PWM_FRACVAL3 - Fractional Value Register 3
 ******************************************************************************/

/*!
 * @brief PWM_FRACVAL3 - Fractional Value Register 3 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire PWM_FRACVAL3 register
 */
/*@{*/
#define PWM_RD_FRACVAL3(base, index) (PWM_FRACVAL3_REG(base, index))
#define PWM_WR_FRACVAL3(base, index, value) (PWM_FRACVAL3_REG(base, index) = (value))
#define PWM_RMW_FRACVAL3(base, index, mask, value) (PWM_WR_FRACVAL3(base, index, (PWM_RD_FRACVAL3(base, index) & ~(mask)) | (value)))
#define PWM_SET_FRACVAL3(base, index, value) (BME_OR16(&PWM_FRACVAL3_REG(base, index), (uint16_t)(value)))
#define PWM_CLR_FRACVAL3(base, index, value) (BME_AND16(&PWM_FRACVAL3_REG(base, index), (uint16_t)(~(value))))
#define PWM_TOG_FRACVAL3(base, index, value) (BME_XOR16(&PWM_FRACVAL3_REG(base, index), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual PWM_FRACVAL3 bitfields
 */

/*!
 * @name Register PWM_FRACVAL3, field FRACVAL3[15:11] (RW)
 *
 * These bits act as a fractional addition to the value in the VAL3 register
 * which controls the PWM_A turn off timing. It is also used to control the
 * fractional addition to the turn on delay of PWM_B when MCTRL0[IPOLx]=0 in
 * complementary mode, CTRL2[INDEP]=0. The FRACVAL3 register is buffered. The value written
 * does not take effect until MCTRL0[LDOK] is set and the next PWM load cycle
 * begins or CTRL[LDMOD] is set. FRACVAL3 cannot be written when MCTRL0[LDOK] is set.
 * Reading FRACVAL3 reads the value in a buffer and not necessarily the value
 * the PWM generator is currently using. FRCTRL[FRAC23_EN] should be set to 0 when
 * the values of VAL2 and VAL3 cause the high or low time of the PWM output to be
 * 3 cycles or less.
 */
/*@{*/
/*! @brief Read current value of the PWM_FRACVAL3_FRACVAL3 field. */
#define PWM_RD_FRACVAL3_FRACVAL3(base, index) ((PWM_FRACVAL3_REG(base, index) & PWM_FRACVAL3_FRACVAL3_MASK) >> PWM_FRACVAL3_FRACVAL3_SHIFT)
#define PWM_BRD_FRACVAL3_FRACVAL3(base, index) (BME_UBFX16(&PWM_FRACVAL3_REG(base, index), PWM_FRACVAL3_FRACVAL3_SHIFT, PWM_FRACVAL3_FRACVAL3_WIDTH))

/*! @brief Set the FRACVAL3 field to a new value. */
#define PWM_WR_FRACVAL3_FRACVAL3(base, index, value) (PWM_RMW_FRACVAL3(base, index, PWM_FRACVAL3_FRACVAL3_MASK, PWM_FRACVAL3_FRACVAL3(value)))
#define PWM_BWR_FRACVAL3_FRACVAL3(base, index, value) (BME_BFI16(&PWM_FRACVAL3_REG(base, index), ((uint16_t)(value) << PWM_FRACVAL3_FRACVAL3_SHIFT), PWM_FRACVAL3_FRACVAL3_SHIFT, PWM_FRACVAL3_FRACVAL3_WIDTH))
/*@}*/

/*******************************************************************************
 * PWM_VAL3 - Value Register 3
 ******************************************************************************/

/*!
 * @brief PWM_VAL3 - Value Register 3 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire PWM_VAL3 register
 */
/*@{*/
#define PWM_RD_VAL3(base, index) (PWM_VAL3_REG(base, index))
#define PWM_WR_VAL3(base, index, value) (PWM_VAL3_REG(base, index) = (value))
#define PWM_RMW_VAL3(base, index, mask, value) (PWM_WR_VAL3(base, index, (PWM_RD_VAL3(base, index) & ~(mask)) | (value)))
#define PWM_SET_VAL3(base, index, value) (BME_OR16(&PWM_VAL3_REG(base, index), (uint16_t)(value)))
#define PWM_CLR_VAL3(base, index, value) (BME_AND16(&PWM_VAL3_REG(base, index), (uint16_t)(~(value))))
#define PWM_TOG_VAL3(base, index, value) (BME_XOR16(&PWM_VAL3_REG(base, index), (uint16_t)(value)))
/*@}*/

