ErichStyger/mcuoneclipse/Examples/KDS/TWR-KV58F220M/TWR_KV58F220M_PEx_2_SDKv2/SDK/platform/devices/MKV58F24/include/MKV58F24_extension.h
/*******************************************************************************
 * PWM_FRACVAL4 - Fractional Value Register 4
 ******************************************************************************/

/*!
 * @brief PWM_FRACVAL4 - Fractional Value Register 4 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire PWM_FRACVAL4 register
 */
/*@{*/
#define PWM_RD_FRACVAL4(base, index) (PWM_FRACVAL4_REG(base, index))
#define PWM_WR_FRACVAL4(base, index, value) (PWM_FRACVAL4_REG(base, index) = (value))
#define PWM_RMW_FRACVAL4(base, index, mask, value) (PWM_WR_FRACVAL4(base, index, (PWM_RD_FRACVAL4(base, index) & ~(mask)) | (value)))
#define PWM_SET_FRACVAL4(base, index, value) (BME_OR16(&PWM_FRACVAL4_REG(base, index), (uint16_t)(value)))
#define PWM_CLR_FRACVAL4(base, index, value) (BME_AND16(&PWM_FRACVAL4_REG(base, index), (uint16_t)(~(value))))
#define PWM_TOG_FRACVAL4(base, index, value) (BME_XOR16(&PWM_FRACVAL4_REG(base, index), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual PWM_FRACVAL4 bitfields
 */

/*!
 * @name Register PWM_FRACVAL4, field FRACVAL4[15:11] (RW)
 *
 * These bits act as a fractional addition to the value in the VAL4 register
 * which controls the PWM_B turn on timing. It is also used to control the
 * fractional addition to the turn off delay of PWM_A when MCTRL0[IPOLx]=1 in
 * complementary mode, CTRL2[INDEP]=0. The FRACVAL4 register is buffered. The value written
 * does not take effect until MCTRL0[LDOK] is set and the next PWM load cycle
 * begins or CTRL[LDMOD] is set. FRACVAL4 cannot be written when MCTRL0[LDOK] is set.
 * Reading FRACVAL4 reads the value in a buffer and not necessarily the value
 * the PWM generator is currently using. FRCTRL[FRAC45_EN] should be set to 0 when
 * the values of VAL4 and VAL5 cause the high or low time of the PWM output to be
 * 3 cycles or less.
 */
/*@{*/
/*! @brief Read current value of the PWM_FRACVAL4_FRACVAL4 field. */
#define PWM_RD_FRACVAL4_FRACVAL4(base, index) ((PWM_FRACVAL4_REG(base, index) & PWM_FRACVAL4_FRACVAL4_MASK) >> PWM_FRACVAL4_FRACVAL4_SHIFT)
#define PWM_BRD_FRACVAL4_FRACVAL4(base, index) (BME_UBFX16(&PWM_FRACVAL4_REG(base, index), PWM_FRACVAL4_FRACVAL4_SHIFT, PWM_FRACVAL4_FRACVAL4_WIDTH))

/*! @brief Set the FRACVAL4 field to a new value. */
#define PWM_WR_FRACVAL4_FRACVAL4(base, index, value) (PWM_RMW_FRACVAL4(base, index, PWM_FRACVAL4_FRACVAL4_MASK, PWM_FRACVAL4_FRACVAL4(value)))
#define PWM_BWR_FRACVAL4_FRACVAL4(base, index, value) (BME_BFI16(&PWM_FRACVAL4_REG(base, index), ((uint16_t)(value) << PWM_FRACVAL4_FRACVAL4_SHIFT), PWM_FRACVAL4_FRACVAL4_SHIFT, PWM_FRACVAL4_FRACVAL4_WIDTH))
/*@}*/

/*******************************************************************************
 * PWM_VAL4 - Value Register 4
 ******************************************************************************/

/*!
 * @brief PWM_VAL4 - Value Register 4 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire PWM_VAL4 register
 */
/*@{*/
#define PWM_RD_VAL4(base, index) (PWM_VAL4_REG(base, index))
#define PWM_WR_VAL4(base, index, value) (PWM_VAL4_REG(base, index) = (value))
#define PWM_RMW_VAL4(base, index, mask, value) (PWM_WR_VAL4(base, index, (PWM_RD_VAL4(base, index) & ~(mask)) | (value)))
#define PWM_SET_VAL4(base, index, value) (BME_OR16(&PWM_VAL4_REG(base, index), (uint16_t)(value)))
#define PWM_CLR_VAL4(base, index, value) (BME_AND16(&PWM_VAL4_REG(base, index), (uint16_t)(~(value))))
#define PWM_TOG_VAL4(base, index, value) (BME_XOR16(&PWM_VAL4_REG(base, index), (uint16_t)(value)))
/*@}*/

/*******************************************************************************
 * PWM_FRACVAL5 - Fractional Value Register 5
 ******************************************************************************/

/*!
 * @brief PWM_FRACVAL5 - Fractional Value Register 5 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire PWM_FRACVAL5 register
 */
/*@{*/
#define PWM_RD_FRACVAL5(base, index) (PWM_FRACVAL5_REG(base, index))
#define PWM_WR_FRACVAL5(base, index, value) (PWM_FRACVAL5_REG(base, index) = (value))
#define PWM_RMW_FRACVAL5(base, index, mask, value) (PWM_WR_FRACVAL5(base, index, (PWM_RD_FRACVAL5(base, index) & ~(mask)) | (value)))
#define PWM_SET_FRACVAL5(base, index, value) (BME_OR16(&PWM_FRACVAL5_REG(base, index), (uint16_t)(value)))
#define PWM_CLR_FRACVAL5(base, index, value) (BME_AND16(&PWM_FRACVAL5_REG(base, index), (uint16_t)(~(value))))
#define PWM_TOG_FRACVAL5(base, index, value) (BME_XOR16(&PWM_FRACVAL5_REG(base, index), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual PWM_FRACVAL5 bitfields
 */

/*!
 * @name Register PWM_FRACVAL5, field FRACVAL5[15:11] (RW)
 *
 * These bits act as a fractional addition to the value in the VAL5 register
 * which controls the PWM_B turn off timing. It is also used to control the
 * fractional addition to the turn on delay of PWM_A when MCTRL0[IPOLx]=1 in
 * complementary mode, CTRL2[INDEP]=0. The FRACVAL5 register is buffered. The value written
 * does not take effect until MCTRL0[LDOK] is set and the next PWM load cycle
 * begins or CTRL[LDMOD] is set. FRACVAL5 cannot be written when MCTRL0[LDOK] is set.
 * Reading FRACVAL5 reads the value in a buffer and not necessarily the value
 * the PWM generator is currently using. FRCTRL[FRAC45_EN] should be set to 0 when
 * the values of VAL4 and VAL5 cause the high or low time of the PWM output to be
 * 3 cycles or less.
 */
/*@{*/
/*! @brief Read current value of the PWM_FRACVAL5_FRACVAL5 field. */
#define PWM_RD_FRACVAL5_FRACVAL5(base, index) ((PWM_FRACVAL5_REG(base, index) & PWM_FRACVAL5_FRACVAL5_MASK) >> PWM_FRACVAL5_FRACVAL5_SHIFT)
#define PWM_BRD_FRACVAL5_FRACVAL5(base, index) (BME_UBFX16(&PWM_FRACVAL5_REG(base, index), PWM_FRACVAL5_FRACVAL5_SHIFT, PWM_FRACVAL5_FRACVAL5_WIDTH))

/*! @brief Set the FRACVAL5 field to a new value. */
#define PWM_WR_FRACVAL5_FRACVAL5(base, index, value) (PWM_RMW_FRACVAL5(base, index, PWM_FRACVAL5_FRACVAL5_MASK, PWM_FRACVAL5_FRACVAL5(value)))
#define PWM_BWR_FRACVAL5_FRACVAL5(base, index, value) (BME_BFI16(&PWM_FRACVAL5_REG(base, index), ((uint16_t)(value) << PWM_FRACVAL5_FRACVAL5_SHIFT), PWM_FRACVAL5_FRACVAL5_SHIFT, PWM_FRACVAL5_FRACVAL5_WIDTH))
/*@}*/

