ErichStyger/mcuoneclipse/Examples/KDS/TWR-KV58F220M/TWR_KV58F220M_PEx_2_SDKv2/SDK/platform/devices/MKV58F24/include/MKV58F24_extension.h
/*******************************************************************************
 * PWM_VAL5 - Value Register 5
 ******************************************************************************/

/*!
 * @brief PWM_VAL5 - Value Register 5 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire PWM_VAL5 register
 */
/*@{*/
#define PWM_RD_VAL5(base, index) (PWM_VAL5_REG(base, index))
#define PWM_WR_VAL5(base, index, value) (PWM_VAL5_REG(base, index) = (value))
#define PWM_RMW_VAL5(base, index, mask, value) (PWM_WR_VAL5(base, index, (PWM_RD_VAL5(base, index) & ~(mask)) | (value)))
#define PWM_SET_VAL5(base, index, value) (BME_OR16(&PWM_VAL5_REG(base, index), (uint16_t)(value)))
#define PWM_CLR_VAL5(base, index, value) (BME_AND16(&PWM_VAL5_REG(base, index), (uint16_t)(~(value))))
#define PWM_TOG_VAL5(base, index, value) (BME_XOR16(&PWM_VAL5_REG(base, index), (uint16_t)(value)))
/*@}*/

/*******************************************************************************
 * PWM_FRCTRL - Fractional Control Register
 ******************************************************************************/

/*!
 * @brief PWM_FRCTRL - Fractional Control Register (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire PWM_FRCTRL register
 */
/*@{*/
#define PWM_RD_FRCTRL(base, index) (PWM_FRCTRL_REG(base, index))
#define PWM_WR_FRCTRL(base, index, value) (PWM_FRCTRL_REG(base, index) = (value))
#define PWM_RMW_FRCTRL(base, index, mask, value) (PWM_WR_FRCTRL(base, index, (PWM_RD_FRCTRL(base, index) & ~(mask)) | (value)))
#define PWM_SET_FRCTRL(base, index, value) (BME_OR16(&PWM_FRCTRL_REG(base, index), (uint16_t)(value)))
#define PWM_CLR_FRCTRL(base, index, value) (BME_AND16(&PWM_FRCTRL_REG(base, index), (uint16_t)(~(value))))
#define PWM_TOG_FRCTRL(base, index, value) (BME_XOR16(&PWM_FRCTRL_REG(base, index), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual PWM_FRCTRL bitfields
 */

/*!
 * @name Register PWM_FRCTRL, field FRAC1_EN[1] (RW)
 *
 * This bit is used to enable the fractional cycle length of the PWM period
 * using the FRACVAL1 register. When disabled, the fractional cycle length of the PWM
 * period is bypassed. The FRAC1_EN bit is buffered. The value written does not
 * take effect until MCTRL0[LDOK] is set and the next PWM load cycle begins or
 * CTRL[LDMOD] is set. FRAC1_EN cannot be written when MCTRL0[LDOK] is set. Reading
 * FRAC1_EN reads the value in a buffer and not necessarily the value the PWM
 * generator is currently using.
 *
 * Values:
 * - 0b0 - Disable fractional cycle length for the PWM period.
 * - 0b1 - Enable fractional cycle length for the PWM period.
 */
/*@{*/
/*! @brief Read current value of the PWM_FRCTRL_FRAC1_EN field. */
#define PWM_RD_FRCTRL_FRAC1_EN(base, index) ((PWM_FRCTRL_REG(base, index) & PWM_FRCTRL_FRAC1_EN_MASK) >> PWM_FRCTRL_FRAC1_EN_SHIFT)
#define PWM_BRD_FRCTRL_FRAC1_EN(base, index) (BME_UBFX16(&PWM_FRCTRL_REG(base, index), PWM_FRCTRL_FRAC1_EN_SHIFT, PWM_FRCTRL_FRAC1_EN_WIDTH))

/*! @brief Set the FRAC1_EN field to a new value. */
#define PWM_WR_FRCTRL_FRAC1_EN(base, index, value) (PWM_RMW_FRCTRL(base, index, PWM_FRCTRL_FRAC1_EN_MASK, PWM_FRCTRL_FRAC1_EN(value)))
#define PWM_BWR_FRCTRL_FRAC1_EN(base, index, value) (BME_BFI16(&PWM_FRCTRL_REG(base, index), ((uint16_t)(value) << PWM_FRCTRL_FRAC1_EN_SHIFT), PWM_FRCTRL_FRAC1_EN_SHIFT, PWM_FRCTRL_FRAC1_EN_WIDTH))
/*@}*/

/*!
 * @name Register PWM_FRCTRL, field FRAC23_EN[2] (RW)
 *
 * This bit is used to enable the fractional cycle edge placement of PWM_A using
 * the FRACVAL2 and FRACVAL3 registers. When disabled, the fractional cycle edge
 * placement of PWM_A is bypassed. The FRAC23_EN bit is buffered. The value
 * written does not take effect until MCTRL0[LDOK] is set and the next PWM load cycle
 * begins or CTRL[LDMOD] is set. FRAC23_EN cannot be written when MCTRL0[LDOK]
 * is set. Reading FRAC23_EN reads the value in a buffer and not necessarily the
 * value the PWM generator is currently using.
 *
 * Values:
 * - 0b0 - Disable fractional cycle placement for PWM_A.
 * - 0b1 - Enable fractional cycle placement for PWM_A.
 */
/*@{*/
/*! @brief Read current value of the PWM_FRCTRL_FRAC23_EN field. */
#define PWM_RD_FRCTRL_FRAC23_EN(base, index) ((PWM_FRCTRL_REG(base, index) & PWM_FRCTRL_FRAC23_EN_MASK) >> PWM_FRCTRL_FRAC23_EN_SHIFT)
#define PWM_BRD_FRCTRL_FRAC23_EN(base, index) (BME_UBFX16(&PWM_FRCTRL_REG(base, index), PWM_FRCTRL_FRAC23_EN_SHIFT, PWM_FRCTRL_FRAC23_EN_WIDTH))

/*! @brief Set the FRAC23_EN field to a new value. */
#define PWM_WR_FRCTRL_FRAC23_EN(base, index, value) (PWM_RMW_FRCTRL(base, index, PWM_FRCTRL_FRAC23_EN_MASK, PWM_FRCTRL_FRAC23_EN(value)))
#define PWM_BWR_FRCTRL_FRAC23_EN(base, index, value) (BME_BFI16(&PWM_FRCTRL_REG(base, index), ((uint16_t)(value) << PWM_FRCTRL_FRAC23_EN_SHIFT), PWM_FRCTRL_FRAC23_EN_SHIFT, PWM_FRCTRL_FRAC23_EN_WIDTH))
/*@}*/

/*!
 * @name Register PWM_FRCTRL, field FRAC45_EN[4] (RW)
 *
 * This bit is used to enable the fractional cycle edge placement of PWM_B using
 * the FRACVAL4 and FRACVAL5 registers. When disabled, the fractional cycle edge
 * placement of PWM_B is bypassed. The FRAC45_EN bit is buffered. The value
 * written does not take effect until MCTRL0[LDOK] is set and the next PWM load cycle
 * begins or CTRL[LDMOD] is set. FRAC45_EN cannot be written when MCTRL0[LDOK]
 * is set. Reading FRAC45_EN reads the value in a buffer and not necessarily the
 * value the PWM generator is currently using.
 *
 * Values:
 * - 0b0 - Disable fractional cycle placement for PWM_B.
 * - 0b1 - Enable fractional cycle placement for PWM_B.
 */
/*@{*/
/*! @brief Read current value of the PWM_FRCTRL_FRAC45_EN field. */
#define PWM_RD_FRCTRL_FRAC45_EN(base, index) ((PWM_FRCTRL_REG(base, index) & PWM_FRCTRL_FRAC45_EN_MASK) >> PWM_FRCTRL_FRAC45_EN_SHIFT)
#define PWM_BRD_FRCTRL_FRAC45_EN(base, index) (BME_UBFX16(&PWM_FRCTRL_REG(base, index), PWM_FRCTRL_FRAC45_EN_SHIFT, PWM_FRCTRL_FRAC45_EN_WIDTH))

/*! @brief Set the FRAC45_EN field to a new value. */
#define PWM_WR_FRCTRL_FRAC45_EN(base, index, value) (PWM_RMW_FRCTRL(base, index, PWM_FRCTRL_FRAC45_EN_MASK, PWM_FRCTRL_FRAC45_EN(value)))
#define PWM_BWR_FRCTRL_FRAC45_EN(base, index, value) (BME_BFI16(&PWM_FRCTRL_REG(base, index), ((uint16_t)(value) << PWM_FRCTRL_FRAC45_EN_SHIFT), PWM_FRCTRL_FRAC45_EN_SHIFT, PWM_FRCTRL_FRAC45_EN_WIDTH))
/*@}*/

/*!
 * @name Register PWM_FRCTRL, field FRAC_PU[8] (RW)
 *
 * This bit is used to power up the fractional delay analog block. The
 * fractional delay block takes 25 us to power up after the first FRAC_PU bit in any
 * submodule is set. The fractional delay block only powers down when the FRAC_PU bits
 * in all submodules are 0. The fractional delay logic can only be used when the
 * IPBus clock is running at 100 MHz. When turned off, fractional placement is
 * disabled. After setting this bit and waiting the 25usec, load the PWM VAL*
 * registers with values to create a PWM output with greater than 0% duty cycle and
 * run for at least one PWM period. This can be done without the outputs enabled
 * and is used to clear the state of the analog block that produces the fractional
 * delays. This bit is functional only in PWMs that support nano-edge placement.
 *
 * Values:
 * - 0b0 - Turn off fractional delay logic.
 * - 0b1 - Power up fractional delay logic.
 */
/*@{*/
/*! @brief Read current value of the PWM_FRCTRL_FRAC_PU field. */
#define PWM_RD_FRCTRL_FRAC_PU(base, index) ((PWM_FRCTRL_REG(base, index) & PWM_FRCTRL_FRAC_PU_MASK) >> PWM_FRCTRL_FRAC_PU_SHIFT)
#define PWM_BRD_FRCTRL_FRAC_PU(base, index) (BME_UBFX16(&PWM_FRCTRL_REG(base, index), PWM_FRCTRL_FRAC_PU_SHIFT, PWM_FRCTRL_FRAC_PU_WIDTH))

