ErichStyger/mcuoneclipse/Examples/KDS/TWR-KV58F220M/TWR_KV58F220M_PEx_2_SDKv2/SDK/platform/devices/MKV58F24/include/MKV58F24_extension.h
/*! @brief Set the FRAC_PU field to a new value. */
#define PWM_WR_FRCTRL_FRAC_PU(base, index, value) (PWM_RMW_FRCTRL(base, index, PWM_FRCTRL_FRAC_PU_MASK, PWM_FRCTRL_FRAC_PU(value)))
#define PWM_BWR_FRCTRL_FRAC_PU(base, index, value) (BME_BFI16(&PWM_FRCTRL_REG(base, index), ((uint16_t)(value) << PWM_FRCTRL_FRAC_PU_SHIFT), PWM_FRCTRL_FRAC_PU_SHIFT, PWM_FRCTRL_FRAC_PU_WIDTH))
/*@}*/

/*!
 * @name Register PWM_FRCTRL, field TEST[15] (RO)
 *
 * This is a read only test bit for factory use. This bit will reset to 0 but
 * may be either 0 or 1 during PWM operation.
 */
/*@{*/
/*! @brief Read current value of the PWM_FRCTRL_TEST field. */
#define PWM_RD_FRCTRL_TEST(base, index) ((PWM_FRCTRL_REG(base, index) & PWM_FRCTRL_TEST_MASK) >> PWM_FRCTRL_TEST_SHIFT)
#define PWM_BRD_FRCTRL_TEST(base, index) (BME_UBFX16(&PWM_FRCTRL_REG(base, index), PWM_FRCTRL_TEST_SHIFT, PWM_FRCTRL_TEST_WIDTH))
/*@}*/

/*******************************************************************************
 * PWM_OCTRL - Output Control Register
 ******************************************************************************/

/*!
 * @brief PWM_OCTRL - Output Control Register (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire PWM_OCTRL register
 */
/*@{*/
#define PWM_RD_OCTRL(base, index) (PWM_OCTRL_REG(base, index))
#define PWM_WR_OCTRL(base, index, value) (PWM_OCTRL_REG(base, index) = (value))
#define PWM_RMW_OCTRL(base, index, mask, value) (PWM_WR_OCTRL(base, index, (PWM_RD_OCTRL(base, index) & ~(mask)) | (value)))
#define PWM_SET_OCTRL(base, index, value) (BME_OR16(&PWM_OCTRL_REG(base, index), (uint16_t)(value)))
#define PWM_CLR_OCTRL(base, index, value) (BME_AND16(&PWM_OCTRL_REG(base, index), (uint16_t)(~(value))))
#define PWM_TOG_OCTRL(base, index, value) (BME_XOR16(&PWM_OCTRL_REG(base, index), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual PWM_OCTRL bitfields
 */

/*!
 * @name Register PWM_OCTRL, field PWMXFS[1:0] (RW)
 *
 * These bits determine the fault state for the PWM_X output during fault
 * conditions and STOP mode. It may also define the output state during WAIT and DEBUG
 * modes depending on the settings of CTRL2[WAITEN] and CTRL2[DBGEN].
 *
 * Values:
 * - 0b00 - Output is forced to logic 0 state prior to consideration of output
 *     polarity control.
 * - 0b01 - Output is forced to logic 1 state prior to consideration of output
 *     polarity control.
 * - 0b10 - Output is tristated.
 * - 0b11 - Output is tristated.
 */
/*@{*/
/*! @brief Read current value of the PWM_OCTRL_PWMXFS field. */
#define PWM_RD_OCTRL_PWMXFS(base, index) ((PWM_OCTRL_REG(base, index) & PWM_OCTRL_PWMXFS_MASK) >> PWM_OCTRL_PWMXFS_SHIFT)
#define PWM_BRD_OCTRL_PWMXFS(base, index) (BME_UBFX16(&PWM_OCTRL_REG(base, index), PWM_OCTRL_PWMXFS_SHIFT, PWM_OCTRL_PWMXFS_WIDTH))

/*! @brief Set the PWMXFS field to a new value. */
#define PWM_WR_OCTRL_PWMXFS(base, index, value) (PWM_RMW_OCTRL(base, index, PWM_OCTRL_PWMXFS_MASK, PWM_OCTRL_PWMXFS(value)))
#define PWM_BWR_OCTRL_PWMXFS(base, index, value) (BME_BFI16(&PWM_OCTRL_REG(base, index), ((uint16_t)(value) << PWM_OCTRL_PWMXFS_SHIFT), PWM_OCTRL_PWMXFS_SHIFT, PWM_OCTRL_PWMXFS_WIDTH))
/*@}*/

/*!
 * @name Register PWM_OCTRL, field PWMBFS[3:2] (RW)
 *
 * These bits determine the fault state for the PWM_B output during fault
 * conditions and STOP mode. It may also define the output state during WAIT and DEBUG
 * modes depending on the settings of CTRL2[WAITEN] and CTRL2[DBGEN].
 *
 * Values:
 * - 0b00 - Output is forced to logic 0 state prior to consideration of output
 *     polarity control.
 * - 0b01 - Output is forced to logic 1 state prior to consideration of output
 *     polarity control.
 * - 0b10 - Output is tristated.
 * - 0b11 - Output is tristated.
 */
/*@{*/
/*! @brief Read current value of the PWM_OCTRL_PWMBFS field. */
#define PWM_RD_OCTRL_PWMBFS(base, index) ((PWM_OCTRL_REG(base, index) & PWM_OCTRL_PWMBFS_MASK) >> PWM_OCTRL_PWMBFS_SHIFT)
#define PWM_BRD_OCTRL_PWMBFS(base, index) (BME_UBFX16(&PWM_OCTRL_REG(base, index), PWM_OCTRL_PWMBFS_SHIFT, PWM_OCTRL_PWMBFS_WIDTH))

/*! @brief Set the PWMBFS field to a new value. */
#define PWM_WR_OCTRL_PWMBFS(base, index, value) (PWM_RMW_OCTRL(base, index, PWM_OCTRL_PWMBFS_MASK, PWM_OCTRL_PWMBFS(value)))
#define PWM_BWR_OCTRL_PWMBFS(base, index, value) (BME_BFI16(&PWM_OCTRL_REG(base, index), ((uint16_t)(value) << PWM_OCTRL_PWMBFS_SHIFT), PWM_OCTRL_PWMBFS_SHIFT, PWM_OCTRL_PWMBFS_WIDTH))
/*@}*/

/*!
 * @name Register PWM_OCTRL, field PWMAFS[5:4] (RW)
 *
 * These bits determine the fault state for the PWM_A output during fault
 * conditions and STOP mode. It may also define the output state during WAIT and DEBUG
 * modes depending on the settings of CTRL2[WAITEN] and CTRL2[DBGEN].
 *
 * Values:
 * - 0b00 - Output is forced to logic 0 state prior to consideration of output
 *     polarity control.
 * - 0b01 - Output is forced to logic 1 state prior to consideration of output
 *     polarity control.
 * - 0b10 - Output is tristated.
 * - 0b11 - Output is tristated.
 */
/*@{*/
/*! @brief Read current value of the PWM_OCTRL_PWMAFS field. */
#define PWM_RD_OCTRL_PWMAFS(base, index) ((PWM_OCTRL_REG(base, index) & PWM_OCTRL_PWMAFS_MASK) >> PWM_OCTRL_PWMAFS_SHIFT)
#define PWM_BRD_OCTRL_PWMAFS(base, index) (BME_UBFX16(&PWM_OCTRL_REG(base, index), PWM_OCTRL_PWMAFS_SHIFT, PWM_OCTRL_PWMAFS_WIDTH))

/*! @brief Set the PWMAFS field to a new value. */
#define PWM_WR_OCTRL_PWMAFS(base, index, value) (PWM_RMW_OCTRL(base, index, PWM_OCTRL_PWMAFS_MASK, PWM_OCTRL_PWMAFS(value)))
#define PWM_BWR_OCTRL_PWMAFS(base, index, value) (BME_BFI16(&PWM_OCTRL_REG(base, index), ((uint16_t)(value) << PWM_OCTRL_PWMAFS_SHIFT), PWM_OCTRL_PWMAFS_SHIFT, PWM_OCTRL_PWMAFS_WIDTH))
/*@}*/

/*!
 * @name Register PWM_OCTRL, field POLX[8] (RW)
 *
 * This bit inverts the PWM_X output polarity.
 *
 * Values:
 * - 0b0 - PWM_X output not inverted. A high level on the PWM_X pin represents
 *     the "on" or "active" state.
 * - 0b1 - PWM_X output inverted. A low level on the PWM_X pin represents the
 *     "on" or "active" state.
 */
/*@{*/
/*! @brief Read current value of the PWM_OCTRL_POLX field. */
#define PWM_RD_OCTRL_POLX(base, index) ((PWM_OCTRL_REG(base, index) & PWM_OCTRL_POLX_MASK) >> PWM_OCTRL_POLX_SHIFT)
#define PWM_BRD_OCTRL_POLX(base, index) (BME_UBFX16(&PWM_OCTRL_REG(base, index), PWM_OCTRL_POLX_SHIFT, PWM_OCTRL_POLX_WIDTH))

/*! @brief Set the POLX field to a new value. */
#define PWM_WR_OCTRL_POLX(base, index, value) (PWM_RMW_OCTRL(base, index, PWM_OCTRL_POLX_MASK, PWM_OCTRL_POLX(value)))
#define PWM_BWR_OCTRL_POLX(base, index, value) (BME_BFI16(&PWM_OCTRL_REG(base, index), ((uint16_t)(value) << PWM_OCTRL_POLX_SHIFT), PWM_OCTRL_POLX_SHIFT, PWM_OCTRL_POLX_WIDTH))
/*@}*/

/*!
 * @name Register PWM_OCTRL, field POLB[9] (RW)
 *
 * This bit inverts the PWM_B output polarity.
 *
 * Values:
 * - 0b0 - PWM_B output not inverted. A high level on the PWM_B pin represents
 *     the "on" or "active" state.
 * - 0b1 - PWM_B output inverted. A low level on the PWM_B pin represents the
 *     "on" or "active" state.
 */
/*@{*/
/*! @brief Read current value of the PWM_OCTRL_POLB field. */
#define PWM_RD_OCTRL_POLB(base, index) ((PWM_OCTRL_REG(base, index) & PWM_OCTRL_POLB_MASK) >> PWM_OCTRL_POLB_SHIFT)
#define PWM_BRD_OCTRL_POLB(base, index) (BME_UBFX16(&PWM_OCTRL_REG(base, index), PWM_OCTRL_POLB_SHIFT, PWM_OCTRL_POLB_WIDTH))

/*! @brief Set the POLB field to a new value. */
#define PWM_WR_OCTRL_POLB(base, index, value) (PWM_RMW_OCTRL(base, index, PWM_OCTRL_POLB_MASK, PWM_OCTRL_POLB(value)))
#define PWM_BWR_OCTRL_POLB(base, index, value) (BME_BFI16(&PWM_OCTRL_REG(base, index), ((uint16_t)(value) << PWM_OCTRL_POLB_SHIFT), PWM_OCTRL_POLB_SHIFT, PWM_OCTRL_POLB_WIDTH))
/*@}*/

/*!
 * @name Register PWM_OCTRL, field POLA[10] (RW)
 *
 * This bit inverts the PWM_A output polarity.
 *
 * Values:
 * - 0b0 - PWM_A output not inverted. A high level on the PWM_A pin represents
 *     the "on" or "active" state.
 * - 0b1 - PWM_A output inverted. A low level on the PWM_A pin represents the
 *     "on" or "active" state.
 */
/*@{*/
/*! @brief Read current value of the PWM_OCTRL_POLA field. */
#define PWM_RD_OCTRL_POLA(base, index) ((PWM_OCTRL_REG(base, index) & PWM_OCTRL_POLA_MASK) >> PWM_OCTRL_POLA_SHIFT)
#define PWM_BRD_OCTRL_POLA(base, index) (BME_UBFX16(&PWM_OCTRL_REG(base, index), PWM_OCTRL_POLA_SHIFT, PWM_OCTRL_POLA_WIDTH))

/*! @brief Set the POLA field to a new value. */
#define PWM_WR_OCTRL_POLA(base, index, value) (PWM_RMW_OCTRL(base, index, PWM_OCTRL_POLA_MASK, PWM_OCTRL_POLA(value)))
#define PWM_BWR_OCTRL_POLA(base, index, value) (BME_BFI16(&PWM_OCTRL_REG(base, index), ((uint16_t)(value) << PWM_OCTRL_POLA_SHIFT), PWM_OCTRL_POLA_SHIFT, PWM_OCTRL_POLA_WIDTH))
/*@}*/

/*!
 * @name Register PWM_OCTRL, field PWMX_IN[13] (RO)
 *
 * This read only bit shows the logic value currently being driven into the
 * PWM_X input. The bit's reset state is undefined.
 */
/*@{*/
/*! @brief Read current value of the PWM_OCTRL_PWMX_IN field. */
#define PWM_RD_OCTRL_PWMX_IN(base, index) ((PWM_OCTRL_REG(base, index) & PWM_OCTRL_PWMX_IN_MASK) >> PWM_OCTRL_PWMX_IN_SHIFT)
#define PWM_BRD_OCTRL_PWMX_IN(base, index) (BME_UBFX16(&PWM_OCTRL_REG(base, index), PWM_OCTRL_PWMX_IN_SHIFT, PWM_OCTRL_PWMX_IN_WIDTH))
/*@}*/

/*!
 * @name Register PWM_OCTRL, field PWMB_IN[14] (RO)
 *
 * This read only bit shows the logic value currently being driven into the
 * PWM_B input. The bit's reset state is undefined.
 */
/*@{*/
/*! @brief Read current value of the PWM_OCTRL_PWMB_IN field. */
#define PWM_RD_OCTRL_PWMB_IN(base, index) ((PWM_OCTRL_REG(base, index) & PWM_OCTRL_PWMB_IN_MASK) >> PWM_OCTRL_PWMB_IN_SHIFT)
#define PWM_BRD_OCTRL_PWMB_IN(base, index) (BME_UBFX16(&PWM_OCTRL_REG(base, index), PWM_OCTRL_PWMB_IN_SHIFT, PWM_OCTRL_PWMB_IN_WIDTH))
/*@}*/

/*!
 * @name Register PWM_OCTRL, field PWMA_IN[15] (RO)
 *
 * This read only bit shows the logic value currently being driven into the
 * PWM_A input. The bit's reset state is undefined.
 */
/*@{*/
/*! @brief Read current value of the PWM_OCTRL_PWMA_IN field. */
#define PWM_RD_OCTRL_PWMA_IN(base, index) ((PWM_OCTRL_REG(base, index) & PWM_OCTRL_PWMA_IN_MASK) >> PWM_OCTRL_PWMA_IN_SHIFT)
#define PWM_BRD_OCTRL_PWMA_IN(base, index) (BME_UBFX16(&PWM_OCTRL_REG(base, index), PWM_OCTRL_PWMA_IN_SHIFT, PWM_OCTRL_PWMA_IN_WIDTH))
/*@}*/

