ErichStyger/mcuoneclipse/Examples/KDS/TWR-KV58F220M/TWR_KV58F220M_PEx_2_SDKv2/SDK/platform/devices/MKV58F24/include/MKV58F24_extension.h
/*! @brief Set the FAND field to a new value. */
#define PWM_WR_DMAEN_FAND(base, index, value) (PWM_RMW_DMAEN(base, index, PWM_DMAEN_FAND_MASK, PWM_DMAEN_FAND(value)))
#define PWM_BWR_DMAEN_FAND(base, index, value) (BME_BFI16(&PWM_DMAEN_REG(base, index), ((uint16_t)(value) << PWM_DMAEN_FAND_SHIFT), PWM_DMAEN_FAND_SHIFT, PWM_DMAEN_FAND_WIDTH))
/*@}*/

/*!
 * @name Register PWM_DMAEN, field VALDE[9] (RW)
 *
 * This read/write bit enables DMA write requests for the VALx and FRACVALx
 * registers when STS[RF] is set. Reset clears this bit.
 *
 * Values:
 * - 0b0 - DMA write requests disabled
 * - 0b1 - DMA write requests for the VALx and FRACVALx registers enabled
 */
/*@{*/
/*! @brief Read current value of the PWM_DMAEN_VALDE field. */
#define PWM_RD_DMAEN_VALDE(base, index) ((PWM_DMAEN_REG(base, index) & PWM_DMAEN_VALDE_MASK) >> PWM_DMAEN_VALDE_SHIFT)
#define PWM_BRD_DMAEN_VALDE(base, index) (BME_UBFX16(&PWM_DMAEN_REG(base, index), PWM_DMAEN_VALDE_SHIFT, PWM_DMAEN_VALDE_WIDTH))

/*! @brief Set the VALDE field to a new value. */
#define PWM_WR_DMAEN_VALDE(base, index, value) (PWM_RMW_DMAEN(base, index, PWM_DMAEN_VALDE_MASK, PWM_DMAEN_VALDE(value)))
#define PWM_BWR_DMAEN_VALDE(base, index, value) (BME_BFI16(&PWM_DMAEN_REG(base, index), ((uint16_t)(value) << PWM_DMAEN_VALDE_SHIFT), PWM_DMAEN_VALDE_SHIFT, PWM_DMAEN_VALDE_WIDTH))
/*@}*/

/*******************************************************************************
 * PWM_TCTRL - Output Trigger Control Register
 ******************************************************************************/

/*!
 * @brief PWM_TCTRL - Output Trigger Control Register (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire PWM_TCTRL register
 */
/*@{*/
#define PWM_RD_TCTRL(base, index) (PWM_TCTRL_REG(base, index))
#define PWM_WR_TCTRL(base, index, value) (PWM_TCTRL_REG(base, index) = (value))
#define PWM_RMW_TCTRL(base, index, mask, value) (PWM_WR_TCTRL(base, index, (PWM_RD_TCTRL(base, index) & ~(mask)) | (value)))
#define PWM_SET_TCTRL(base, index, value) (BME_OR16(&PWM_TCTRL_REG(base, index), (uint16_t)(value)))
#define PWM_CLR_TCTRL(base, index, value) (BME_AND16(&PWM_TCTRL_REG(base, index), (uint16_t)(~(value))))
#define PWM_TOG_TCTRL(base, index, value) (BME_XOR16(&PWM_TCTRL_REG(base, index), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual PWM_TCTRL bitfields
 */

/*!
 * @name Register PWM_TCTRL, field OUT_TRIG_EN[5:0] (RW)
 *
 * These bits enable the generation of PWM_OUT_TRIG0 and PWM_OUT_TRIG1 outputs
 * based on the counter value matching the value in one or more of the VAL0-5
 * registers. VAL0, VAL2, and VAL4 are used to generate PWM_OUT_TRIG0, and VAL1,
 * VAL3, and VAL5 are used to generate PWM_OUT_TRIG1. The PWM_OUT_TRIGx signals are
 * only asserted as long as the counter value matches the VALx value; therefore,
 * up to six triggers can be generated (three each on PWM_OUT_TRIG0 and
 * PWM_OUT_TRIG1) per PWM cycle per submodule. Due to delays in creating the PWM outputs,
 * the output trigger signals will lead the PWM output edges by 2-3 clock cycles
 * depending on the fractional cycle value being used.
 *
 * Values:
 * - 0b000000 - PWM_OUT_TRIGx will not set when the counter value matches the
 *     VALx value.
 * - 0b000001 - PWM_OUT_TRIGx will set when the counter value matches the VALx
 *     value.
 */
/*@{*/
/*! @brief Read current value of the PWM_TCTRL_OUT_TRIG_EN field. */
#define PWM_RD_TCTRL_OUT_TRIG_EN(base, index) ((PWM_TCTRL_REG(base, index) & PWM_TCTRL_OUT_TRIG_EN_MASK) >> PWM_TCTRL_OUT_TRIG_EN_SHIFT)
#define PWM_BRD_TCTRL_OUT_TRIG_EN(base, index) (BME_UBFX16(&PWM_TCTRL_REG(base, index), PWM_TCTRL_OUT_TRIG_EN_SHIFT, PWM_TCTRL_OUT_TRIG_EN_WIDTH))

/*! @brief Set the OUT_TRIG_EN field to a new value. */
#define PWM_WR_TCTRL_OUT_TRIG_EN(base, index, value) (PWM_RMW_TCTRL(base, index, PWM_TCTRL_OUT_TRIG_EN_MASK, PWM_TCTRL_OUT_TRIG_EN(value)))
#define PWM_BWR_TCTRL_OUT_TRIG_EN(base, index, value) (BME_BFI16(&PWM_TCTRL_REG(base, index), ((uint16_t)(value) << PWM_TCTRL_OUT_TRIG_EN_SHIFT), PWM_TCTRL_OUT_TRIG_EN_SHIFT, PWM_TCTRL_OUT_TRIG_EN_WIDTH))
/*@}*/

/*!
 * @name Register PWM_TCTRL, field TRGFRQ[12] (RW)
 *
 * This read/write bit allows control over the frequency of the trigger outputs
 * when using non-zero values of CTRL[LDFQ].
 *
 * Values:
 * - 0b0 - Trigger outputs are generated during every PWM period even if the PWM
 *     is not reloaded every period due to CTRL[LDFQ] being non-zero.
 * - 0b1 - Trigger outputs are generated only during the final PWM period prior
 *     to a reload opportunity when the PWM is not reloaded every period due to
 *     CTRL[LDFQ] being non-zero.
 */
/*@{*/
/*! @brief Read current value of the PWM_TCTRL_TRGFRQ field. */
#define PWM_RD_TCTRL_TRGFRQ(base, index) ((PWM_TCTRL_REG(base, index) & PWM_TCTRL_TRGFRQ_MASK) >> PWM_TCTRL_TRGFRQ_SHIFT)
#define PWM_BRD_TCTRL_TRGFRQ(base, index) (BME_UBFX16(&PWM_TCTRL_REG(base, index), PWM_TCTRL_TRGFRQ_SHIFT, PWM_TCTRL_TRGFRQ_WIDTH))

/*! @brief Set the TRGFRQ field to a new value. */
#define PWM_WR_TCTRL_TRGFRQ(base, index, value) (PWM_RMW_TCTRL(base, index, PWM_TCTRL_TRGFRQ_MASK, PWM_TCTRL_TRGFRQ(value)))
#define PWM_BWR_TCTRL_TRGFRQ(base, index, value) (BME_BFI16(&PWM_TCTRL_REG(base, index), ((uint16_t)(value) << PWM_TCTRL_TRGFRQ_SHIFT), PWM_TCTRL_TRGFRQ_SHIFT, PWM_TCTRL_TRGFRQ_WIDTH))
/*@}*/

/*!
 * @name Register PWM_TCTRL, field PWBOT1[14] (RW)
 *
 * This bit selects which signal to bring out on the PWM's PWM_OUT_TRIG1 port.
 * The output trigger port is often connected to routing logic on the chip. This
 * control bit allows the PWM1 output signal to be driven onto the output trigger
 * port so it can be sent to the chip routing logic.
 *
 * Values:
 * - 0b0 - Route the PWM_OUT_TRIG1 signal to PWM_OUT_TRIG1 port.
 * - 0b1 - Route the PWM1 output to the PWM_OUT_TRIG1 port.
 */
/*@{*/
/*! @brief Read current value of the PWM_TCTRL_PWBOT1 field. */
#define PWM_RD_TCTRL_PWBOT1(base, index) ((PWM_TCTRL_REG(base, index) & PWM_TCTRL_PWBOT1_MASK) >> PWM_TCTRL_PWBOT1_SHIFT)
#define PWM_BRD_TCTRL_PWBOT1(base, index) (BME_UBFX16(&PWM_TCTRL_REG(base, index), PWM_TCTRL_PWBOT1_SHIFT, PWM_TCTRL_PWBOT1_WIDTH))

