ErichStyger/mcuoneclipse/Examples/KDS/TWR-KV58F220M/TWR_KV58F220M_PEx_2_SDKv2/SDK/platform/devices/MKV58F24/include/MKV58F24_extension.h
/*! @brief Set the PWBOT1 field to a new value. */
#define PWM_WR_TCTRL_PWBOT1(base, index, value) (PWM_RMW_TCTRL(base, index, PWM_TCTRL_PWBOT1_MASK, PWM_TCTRL_PWBOT1(value)))
#define PWM_BWR_TCTRL_PWBOT1(base, index, value) (BME_BFI16(&PWM_TCTRL_REG(base, index), ((uint16_t)(value) << PWM_TCTRL_PWBOT1_SHIFT), PWM_TCTRL_PWBOT1_SHIFT, PWM_TCTRL_PWBOT1_WIDTH))
/*@}*/

/*!
 * @name Register PWM_TCTRL, field PWAOT0[15] (RW)
 *
 * This bit selects which signal to bring out on the PWM's PWM_OUT_TRIG0 port.
 * The output trigger port is often connected to routing logic on the chip. This
 * control bit allows the PWM0 output signal to be driven onto the output trigger
 * port so it can be sent to the chip routing logic.
 *
 * Values:
 * - 0b0 - Route the PWM_OUT_TRIG0 signal to PWM_OUT_TRIG0 port.
 * - 0b1 - Route the PWM0 output to the PWM_OUT_TRIG0 port.
 */
/*@{*/
/*! @brief Read current value of the PWM_TCTRL_PWAOT0 field. */
#define PWM_RD_TCTRL_PWAOT0(base, index) ((PWM_TCTRL_REG(base, index) & PWM_TCTRL_PWAOT0_MASK) >> PWM_TCTRL_PWAOT0_SHIFT)
#define PWM_BRD_TCTRL_PWAOT0(base, index) (BME_UBFX16(&PWM_TCTRL_REG(base, index), PWM_TCTRL_PWAOT0_SHIFT, PWM_TCTRL_PWAOT0_WIDTH))

/*! @brief Set the PWAOT0 field to a new value. */
#define PWM_WR_TCTRL_PWAOT0(base, index, value) (PWM_RMW_TCTRL(base, index, PWM_TCTRL_PWAOT0_MASK, PWM_TCTRL_PWAOT0(value)))
#define PWM_BWR_TCTRL_PWAOT0(base, index, value) (BME_BFI16(&PWM_TCTRL_REG(base, index), ((uint16_t)(value) << PWM_TCTRL_PWAOT0_SHIFT), PWM_TCTRL_PWAOT0_SHIFT, PWM_TCTRL_PWAOT0_WIDTH))
/*@}*/

/*******************************************************************************
 * PWM_DISMAP - Fault Disable Mapping Register 0
 ******************************************************************************/

/*!
 * @brief PWM_DISMAP - Fault Disable Mapping Register 0 (RW)
 *
 * Reset value: 0xFFFFU
 *
 * This register determines which PWM pins are disabled by the fault protection
 * inputs. Reset sets all of the bits in the fault disable mapping register.
 */
/*!
 * @name Constants and macros for entire PWM_DISMAP register
 */
/*@{*/
#define PWM_RD_DISMAP(base, index, index2) (PWM_DISMAP_REG(base, index, index2))
#define PWM_WR_DISMAP(base, index, index2, value) (PWM_DISMAP_REG(base, index, index2) = (value))
#define PWM_RMW_DISMAP(base, index, index2, mask, value) (PWM_WR_DISMAP(base, index, index2, (PWM_RD_DISMAP(base, index, index2) & ~(mask)) | (value)))
#define PWM_SET_DISMAP(base, index, index2, value) (BME_OR16(&PWM_DISMAP_REG(base, index, index2), (uint16_t)(value)))
#define PWM_CLR_DISMAP(base, index, index2, value) (BME_AND16(&PWM_DISMAP_REG(base, index, index2), (uint16_t)(~(value))))
#define PWM_TOG_DISMAP(base, index, index2, value) (BME_XOR16(&PWM_DISMAP_REG(base, index, index2), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual PWM_DISMAP bitfields
 */

/*!
 * @name Register PWM_DISMAP, field DIS0A[3:0] (RW)
 *
 * Each of the four bits of this read/write field is one-to-one associated with
 * the four FAULTx inputs of fault channel 0. The PWM_A output is turned off if
 * there is a logic 1 on a FAULTx input and a 1 in the corresponding bit of this
 * field. A reset sets all bits in this field.
 */
/*@{*/
/*! @brief Read current value of the PWM_DISMAP_DIS0A field. */
#define PWM_RD_DISMAP_DIS0A(base, index, index2) ((PWM_DISMAP_REG(base, index, index2) & PWM_DISMAP_DIS0A_MASK) >> PWM_DISMAP_DIS0A_SHIFT)
#define PWM_BRD_DISMAP_DIS0A(base, index, index2) (BME_UBFX16(&PWM_DISMAP_REG(base, index, index2), PWM_DISMAP_DIS0A_SHIFT, PWM_DISMAP_DIS0A_WIDTH))

/*! @brief Set the DIS0A field to a new value. */
#define PWM_WR_DISMAP_DIS0A(base, index, index2, value) (PWM_RMW_DISMAP(base, index, index2, PWM_DISMAP_DIS0A_MASK, PWM_DISMAP_DIS0A(value)))
#define PWM_BWR_DISMAP_DIS0A(base, index, index2, value) (BME_BFI16(&PWM_DISMAP_REG(base, index, index2), ((uint16_t)(value) << PWM_DISMAP_DIS0A_SHIFT), PWM_DISMAP_DIS0A_SHIFT, PWM_DISMAP_DIS0A_WIDTH))
/*@}*/

/*!
 * @name Register PWM_DISMAP, field DIS0B[7:4] (RW)
 *
 * Each of the four bits of this read/write field is one-to-one associated with
 * the four FAULTx inputs of fault channel 0. The PWM_B output is turned off if
 * there is a logic 1 on a FAULTx input and a 1 in the corresponding bit of this
 * field. A reset sets all bits in this field.
 */
/*@{*/
/*! @brief Read current value of the PWM_DISMAP_DIS0B field. */
#define PWM_RD_DISMAP_DIS0B(base, index, index2) ((PWM_DISMAP_REG(base, index, index2) & PWM_DISMAP_DIS0B_MASK) >> PWM_DISMAP_DIS0B_SHIFT)
#define PWM_BRD_DISMAP_DIS0B(base, index, index2) (BME_UBFX16(&PWM_DISMAP_REG(base, index, index2), PWM_DISMAP_DIS0B_SHIFT, PWM_DISMAP_DIS0B_WIDTH))

/*! @brief Set the DIS0B field to a new value. */
#define PWM_WR_DISMAP_DIS0B(base, index, index2, value) (PWM_RMW_DISMAP(base, index, index2, PWM_DISMAP_DIS0B_MASK, PWM_DISMAP_DIS0B(value)))
#define PWM_BWR_DISMAP_DIS0B(base, index, index2, value) (BME_BFI16(&PWM_DISMAP_REG(base, index, index2), ((uint16_t)(value) << PWM_DISMAP_DIS0B_SHIFT), PWM_DISMAP_DIS0B_SHIFT, PWM_DISMAP_DIS0B_WIDTH))
/*@}*/

/*!
 * @name Register PWM_DISMAP, field DIS0X[11:8] (RW)
 *
 * Each of the four bits of this read/write field is one-to-one associated with
 * the four FAULTx inputs of fault channel 0. The PWM_X output is turned off if
 * there is a logic 1 on a FAULTx input and a 1 in the corresponding bit of this
 * field. A reset sets all bits in this field.
 */
/*@{*/
/*! @brief Read current value of the PWM_DISMAP_DIS0X field. */
#define PWM_RD_DISMAP_DIS0X(base, index, index2) ((PWM_DISMAP_REG(base, index, index2) & PWM_DISMAP_DIS0X_MASK) >> PWM_DISMAP_DIS0X_SHIFT)
#define PWM_BRD_DISMAP_DIS0X(base, index, index2) (BME_UBFX16(&PWM_DISMAP_REG(base, index, index2), PWM_DISMAP_DIS0X_SHIFT, PWM_DISMAP_DIS0X_WIDTH))

/*! @brief Set the DIS0X field to a new value. */
#define PWM_WR_DISMAP_DIS0X(base, index, index2, value) (PWM_RMW_DISMAP(base, index, index2, PWM_DISMAP_DIS0X_MASK, PWM_DISMAP_DIS0X(value)))
#define PWM_BWR_DISMAP_DIS0X(base, index, index2, value) (BME_BFI16(&PWM_DISMAP_REG(base, index, index2), ((uint16_t)(value) << PWM_DISMAP_DIS0X_SHIFT), PWM_DISMAP_DIS0X_SHIFT, PWM_DISMAP_DIS0X_WIDTH))
/*@}*/

