ErichStyger/mcuoneclipse/Examples/KDS/TWR-KV58F220M/TWR_KV58F220M_PEx_2_SDKv2/SDK/platform/devices/MKV58F24/include/MKV58F24_extension.h
/*! @brief Set the INP_SELX field to a new value. */
#define PWM_WR_CAPTCTRLX_INP_SELX(base, index, value) (PWM_RMW_CAPTCTRLX(base, index, PWM_CAPTCTRLX_INP_SELX_MASK, PWM_CAPTCTRLX_INP_SELX(value)))
#define PWM_BWR_CAPTCTRLX_INP_SELX(base, index, value) (BME_BFI16(&PWM_CAPTCTRLX_REG(base, index), ((uint16_t)(value) << PWM_CAPTCTRLX_INP_SELX_SHIFT), PWM_CAPTCTRLX_INP_SELX_SHIFT, PWM_CAPTCTRLX_INP_SELX_WIDTH))
/*@}*/

/*!
 * @name Register PWM_CAPTCTRLX, field EDGCNTX_EN[7] (RW)
 *
 * This bit enables the edge counter which counts rising and falling edges on
 * the PWM_X input signal.
 *
 * Values:
 * - 0b0 - Edge counter disabled and held in reset
 * - 0b1 - Edge counter enabled
 */
/*@{*/
/*! @brief Read current value of the PWM_CAPTCTRLX_EDGCNTX_EN field. */
#define PWM_RD_CAPTCTRLX_EDGCNTX_EN(base, index) ((PWM_CAPTCTRLX_REG(base, index) & PWM_CAPTCTRLX_EDGCNTX_EN_MASK) >> PWM_CAPTCTRLX_EDGCNTX_EN_SHIFT)
#define PWM_BRD_CAPTCTRLX_EDGCNTX_EN(base, index) (BME_UBFX16(&PWM_CAPTCTRLX_REG(base, index), PWM_CAPTCTRLX_EDGCNTX_EN_SHIFT, PWM_CAPTCTRLX_EDGCNTX_EN_WIDTH))

/*! @brief Set the EDGCNTX_EN field to a new value. */
#define PWM_WR_CAPTCTRLX_EDGCNTX_EN(base, index, value) (PWM_RMW_CAPTCTRLX(base, index, PWM_CAPTCTRLX_EDGCNTX_EN_MASK, PWM_CAPTCTRLX_EDGCNTX_EN(value)))
#define PWM_BWR_CAPTCTRLX_EDGCNTX_EN(base, index, value) (BME_BFI16(&PWM_CAPTCTRLX_REG(base, index), ((uint16_t)(value) << PWM_CAPTCTRLX_EDGCNTX_EN_SHIFT), PWM_CAPTCTRLX_EDGCNTX_EN_SHIFT, PWM_CAPTCTRLX_EDGCNTX_EN_WIDTH))
/*@}*/

/*!
 * @name Register PWM_CAPTCTRLX, field CFXWM[9:8] (RW)
 *
 * This field represents the water mark level for capture X FIFOs. The capture
 * flags, STS[CFX1] and STS[CFX0], won't be set until the word count of the
 * corresponding FIFO is greater than this water mark level. (FIFO depth is 1)
 */
/*@{*/
/*! @brief Read current value of the PWM_CAPTCTRLX_CFXWM field. */
#define PWM_RD_CAPTCTRLX_CFXWM(base, index) ((PWM_CAPTCTRLX_REG(base, index) & PWM_CAPTCTRLX_CFXWM_MASK) >> PWM_CAPTCTRLX_CFXWM_SHIFT)
#define PWM_BRD_CAPTCTRLX_CFXWM(base, index) (BME_UBFX16(&PWM_CAPTCTRLX_REG(base, index), PWM_CAPTCTRLX_CFXWM_SHIFT, PWM_CAPTCTRLX_CFXWM_WIDTH))

/*! @brief Set the CFXWM field to a new value. */
#define PWM_WR_CAPTCTRLX_CFXWM(base, index, value) (PWM_RMW_CAPTCTRLX(base, index, PWM_CAPTCTRLX_CFXWM_MASK, PWM_CAPTCTRLX_CFXWM(value)))
#define PWM_BWR_CAPTCTRLX_CFXWM(base, index, value) (BME_BFI16(&PWM_CAPTCTRLX_REG(base, index), ((uint16_t)(value) << PWM_CAPTCTRLX_CFXWM_SHIFT), PWM_CAPTCTRLX_CFXWM_SHIFT, PWM_CAPTCTRLX_CFXWM_WIDTH))
/*@}*/

/*!
 * @name Register PWM_CAPTCTRLX, field CX0CNT[12:10] (RO)
 *
 * This field reflects the number of words in the Capture X0 FIFO. (FIFO depth
 * is 1)
 */
/*@{*/
/*! @brief Read current value of the PWM_CAPTCTRLX_CX0CNT field. */
#define PWM_RD_CAPTCTRLX_CX0CNT(base, index) ((PWM_CAPTCTRLX_REG(base, index) & PWM_CAPTCTRLX_CX0CNT_MASK) >> PWM_CAPTCTRLX_CX0CNT_SHIFT)
#define PWM_BRD_CAPTCTRLX_CX0CNT(base, index) (BME_UBFX16(&PWM_CAPTCTRLX_REG(base, index), PWM_CAPTCTRLX_CX0CNT_SHIFT, PWM_CAPTCTRLX_CX0CNT_WIDTH))
/*@}*/

/*!
 * @name Register PWM_CAPTCTRLX, field CX1CNT[15:13] (RO)
 *
 * This field reflects the number of words in the Capture X1 FIFO. (FIFO depth
 * is 1)
 */
/*@{*/
/*! @brief Read current value of the PWM_CAPTCTRLX_CX1CNT field. */
#define PWM_RD_CAPTCTRLX_CX1CNT(base, index) ((PWM_CAPTCTRLX_REG(base, index) & PWM_CAPTCTRLX_CX1CNT_MASK) >> PWM_CAPTCTRLX_CX1CNT_SHIFT)
#define PWM_BRD_CAPTCTRLX_CX1CNT(base, index) (BME_UBFX16(&PWM_CAPTCTRLX_REG(base, index), PWM_CAPTCTRLX_CX1CNT_SHIFT, PWM_CAPTCTRLX_CX1CNT_WIDTH))
/*@}*/

/*******************************************************************************
 * PWM_CAPTCOMPX - Capture Compare X Register
 ******************************************************************************/

/*!
 * @brief PWM_CAPTCOMPX - Capture Compare X Register (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire PWM_CAPTCOMPX register
 */
/*@{*/
#define PWM_RD_CAPTCOMPX(base, index) (PWM_CAPTCOMPX_REG(base, index))
#define PWM_WR_CAPTCOMPX(base, index, value) (PWM_CAPTCOMPX_REG(base, index) = (value))
#define PWM_RMW_CAPTCOMPX(base, index, mask, value) (PWM_WR_CAPTCOMPX(base, index, (PWM_RD_CAPTCOMPX(base, index) & ~(mask)) | (value)))
#define PWM_SET_CAPTCOMPX(base, index, value) (BME_OR16(&PWM_CAPTCOMPX_REG(base, index), (uint16_t)(value)))
#define PWM_CLR_CAPTCOMPX(base, index, value) (BME_AND16(&PWM_CAPTCOMPX_REG(base, index), (uint16_t)(~(value))))
#define PWM_TOG_CAPTCOMPX(base, index, value) (BME_XOR16(&PWM_CAPTCOMPX_REG(base, index), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual PWM_CAPTCOMPX bitfields
 */

/*!
 * @name Register PWM_CAPTCOMPX, field EDGCMPX[7:0] (RW)
 *
 * This read/write field is the compare value associated with the edge counter
 * for the PWM_X input capture circuitry.
 */
/*@{*/
/*! @brief Read current value of the PWM_CAPTCOMPX_EDGCMPX field. */
#define PWM_RD_CAPTCOMPX_EDGCMPX(base, index) ((PWM_CAPTCOMPX_REG(base, index) & PWM_CAPTCOMPX_EDGCMPX_MASK) >> PWM_CAPTCOMPX_EDGCMPX_SHIFT)
#define PWM_BRD_CAPTCOMPX_EDGCMPX(base, index) (BME_UBFX16(&PWM_CAPTCOMPX_REG(base, index), PWM_CAPTCOMPX_EDGCMPX_SHIFT, PWM_CAPTCOMPX_EDGCMPX_WIDTH))

/*! @brief Set the EDGCMPX field to a new value. */
#define PWM_WR_CAPTCOMPX_EDGCMPX(base, index, value) (PWM_RMW_CAPTCOMPX(base, index, PWM_CAPTCOMPX_EDGCMPX_MASK, PWM_CAPTCOMPX_EDGCMPX(value)))
#define PWM_BWR_CAPTCOMPX_EDGCMPX(base, index, value) (BME_BFI16(&PWM_CAPTCOMPX_REG(base, index), ((uint16_t)(value) << PWM_CAPTCOMPX_EDGCMPX_SHIFT), PWM_CAPTCOMPX_EDGCMPX_SHIFT, PWM_CAPTCOMPX_EDGCMPX_WIDTH))
/*@}*/

/*!
 * @name Register PWM_CAPTCOMPX, field EDGCNTX[15:8] (RO)
 *
 * This read-only field contains the edge counter value for the PWM_X input
 * capture circuitry.
 */
/*@{*/
/*! @brief Read current value of the PWM_CAPTCOMPX_EDGCNTX field. */
#define PWM_RD_CAPTCOMPX_EDGCNTX(base, index) ((PWM_CAPTCOMPX_REG(base, index) & PWM_CAPTCOMPX_EDGCNTX_MASK) >> PWM_CAPTCOMPX_EDGCNTX_SHIFT)
#define PWM_BRD_CAPTCOMPX_EDGCNTX(base, index) (BME_UBFX16(&PWM_CAPTCOMPX_REG(base, index), PWM_CAPTCOMPX_EDGCNTX_SHIFT, PWM_CAPTCOMPX_EDGCNTX_WIDTH))
/*@}*/

