ErichStyger/mcuoneclipse/Examples/KDS/TWR-KV58F220M/TWR_KV58F220M_PEx_2_SDKv2/SDK/platform/devices/MKV58F24/include/MKV58F24_extension.h
/*******************************************************************************
 * PWM_CVAL4 - Capture Value 4 Register
 ******************************************************************************/

/*!
 * @brief PWM_CVAL4 - Capture Value 4 Register (RO)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire PWM_CVAL4 register
 */
/*@{*/
#define PWM_RD_CVAL4(base, index) (PWM_CVAL4_REG(base, index))
/*@}*/

/*******************************************************************************
 * PWM_CVAL4CYC - Capture Value 4 Cycle Register
 ******************************************************************************/

/*!
 * @brief PWM_CVAL4CYC - Capture Value 4 Cycle Register (RO)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire PWM_CVAL4CYC register
 */
/*@{*/
#define PWM_RD_CVAL4CYC(base, index) (PWM_CVAL4CYC_REG(base, index))
/*@}*/

/*
 * Constants & macros for individual PWM_CVAL4CYC bitfields
 */

/*!
 * @name Register PWM_CVAL4CYC, field CVAL4CYC[3:0] (RO)
 *
 * This read-only register stores the cycle number corresponding to the value
 * captured in CVAL4. This register is incremented each time the counter is loaded
 * with the INIT value at the end of a PWM modulo cycle.
 */
/*@{*/
/*! @brief Read current value of the PWM_CVAL4CYC_CVAL4CYC field. */
#define PWM_RD_CVAL4CYC_CVAL4CYC(base, index) ((PWM_CVAL4CYC_REG(base, index) & PWM_CVAL4CYC_CVAL4CYC_MASK) >> PWM_CVAL4CYC_CVAL4CYC_SHIFT)
#define PWM_BRD_CVAL4CYC_CVAL4CYC(base, index) (BME_UBFX16(&PWM_CVAL4CYC_REG(base, index), PWM_CVAL4CYC_CVAL4CYC_SHIFT, PWM_CVAL4CYC_CVAL4CYC_WIDTH))
/*@}*/

/*******************************************************************************
 * PWM_CVAL5 - Capture Value 5 Register
 ******************************************************************************/

/*!
 * @brief PWM_CVAL5 - Capture Value 5 Register (RO)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire PWM_CVAL5 register
 */
/*@{*/
#define PWM_RD_CVAL5(base, index) (PWM_CVAL5_REG(base, index))
/*@}*/

/*******************************************************************************
 * PWM_CVAL5CYC - Capture Value 5 Cycle Register
 ******************************************************************************/

/*!
 * @brief PWM_CVAL5CYC - Capture Value 5 Cycle Register (RO)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire PWM_CVAL5CYC register
 */
/*@{*/
#define PWM_RD_CVAL5CYC(base, index) (PWM_CVAL5CYC_REG(base, index))
/*@}*/

/*
 * Constants & macros for individual PWM_CVAL5CYC bitfields
 */

/*!
 * @name Register PWM_CVAL5CYC, field CVAL5CYC[3:0] (RO)
 *
 * This read-only register stores the cycle number corresponding to the value
 * captured in CVAL5. This register is incremented each time the counter is loaded
 * with the INIT value at the end of a PWM modulo cycle.
 */
/*@{*/
/*! @brief Read current value of the PWM_CVAL5CYC_CVAL5CYC field. */
#define PWM_RD_CVAL5CYC_CVAL5CYC(base, index) ((PWM_CVAL5CYC_REG(base, index) & PWM_CVAL5CYC_CVAL5CYC_MASK) >> PWM_CVAL5CYC_CVAL5CYC_SHIFT)
#define PWM_BRD_CVAL5CYC_CVAL5CYC(base, index) (BME_UBFX16(&PWM_CVAL5CYC_REG(base, index), PWM_CVAL5CYC_CVAL5CYC_SHIFT, PWM_CVAL5CYC_CVAL5CYC_WIDTH))
/*@}*/

/*******************************************************************************
 * PWM_OUTEN - Output Enable Register
 ******************************************************************************/

/*!
 * @brief PWM_OUTEN - Output Enable Register (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire PWM_OUTEN register
 */
/*@{*/
#define PWM_RD_OUTEN(base)       (PWM_OUTEN_REG(base))
#define PWM_WR_OUTEN(base, value) (PWM_OUTEN_REG(base) = (value))
#define PWM_RMW_OUTEN(base, mask, value) (PWM_WR_OUTEN(base, (PWM_RD_OUTEN(base) & ~(mask)) | (value)))
#define PWM_SET_OUTEN(base, value) (BME_OR16(&PWM_OUTEN_REG(base), (uint16_t)(value)))
#define PWM_CLR_OUTEN(base, value) (BME_AND16(&PWM_OUTEN_REG(base), (uint16_t)(~(value))))
#define PWM_TOG_OUTEN(base, value) (BME_XOR16(&PWM_OUTEN_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual PWM_OUTEN bitfields
 */

/*!
 * @name Register PWM_OUTEN, field PWMX_EN[3:0] (RW)
 *
 * The four bits of this field enable the PWM_X outputs of submodules 3-0,
 * respectively. These bits should be set to 0 (output disabled) when a PWM_X pin is
 * being used for input capture or deadtime correction.
 *
 * Values:
 * - 0b0000 - PWM_X output disabled.
 * - 0b0001 - PWM_X output enabled.
 */
/*@{*/
/*! @brief Read current value of the PWM_OUTEN_PWMX_EN field. */
#define PWM_RD_OUTEN_PWMX_EN(base) ((PWM_OUTEN_REG(base) & PWM_OUTEN_PWMX_EN_MASK) >> PWM_OUTEN_PWMX_EN_SHIFT)
#define PWM_BRD_OUTEN_PWMX_EN(base) (BME_UBFX16(&PWM_OUTEN_REG(base), PWM_OUTEN_PWMX_EN_SHIFT, PWM_OUTEN_PWMX_EN_WIDTH))

/*! @brief Set the PWMX_EN field to a new value. */
#define PWM_WR_OUTEN_PWMX_EN(base, value) (PWM_RMW_OUTEN(base, PWM_OUTEN_PWMX_EN_MASK, PWM_OUTEN_PWMX_EN(value)))
#define PWM_BWR_OUTEN_PWMX_EN(base, value) (BME_BFI16(&PWM_OUTEN_REG(base), ((uint16_t)(value) << PWM_OUTEN_PWMX_EN_SHIFT), PWM_OUTEN_PWMX_EN_SHIFT, PWM_OUTEN_PWMX_EN_WIDTH))
/*@}*/

/*!
 * @name Register PWM_OUTEN, field PWMB_EN[7:4] (RW)
 *
 * The four bits of this field enable the PWM_B outputs of submodules 3-0,
 * respectively. These bits should be set to 0 (output disabled) when a PWM_B pin is
 * being used for input capture.
 *
 * Values:
 * - 0b0000 - PWM_B output disabled.
 * - 0b0001 - PWM_B output enabled.
 */
/*@{*/
/*! @brief Read current value of the PWM_OUTEN_PWMB_EN field. */
#define PWM_RD_OUTEN_PWMB_EN(base) ((PWM_OUTEN_REG(base) & PWM_OUTEN_PWMB_EN_MASK) >> PWM_OUTEN_PWMB_EN_SHIFT)
#define PWM_BRD_OUTEN_PWMB_EN(base) (BME_UBFX16(&PWM_OUTEN_REG(base), PWM_OUTEN_PWMB_EN_SHIFT, PWM_OUTEN_PWMB_EN_WIDTH))

/*! @brief Set the PWMB_EN field to a new value. */
#define PWM_WR_OUTEN_PWMB_EN(base, value) (PWM_RMW_OUTEN(base, PWM_OUTEN_PWMB_EN_MASK, PWM_OUTEN_PWMB_EN(value)))
#define PWM_BWR_OUTEN_PWMB_EN(base, value) (BME_BFI16(&PWM_OUTEN_REG(base), ((uint16_t)(value) << PWM_OUTEN_PWMB_EN_SHIFT), PWM_OUTEN_PWMB_EN_SHIFT, PWM_OUTEN_PWMB_EN_WIDTH))
/*@}*/

/*!
 * @name Register PWM_OUTEN, field PWMA_EN[11:8] (RW)
 *
 * The four bits of this field enable the PWM_A outputs of submodules 3-0,
 * respectively. These bits should be set to 0 (output disabled) when a PWM_A pin is
 * being used for input capture.
 *
 * Values:
 * - 0b0000 - PWM_A output disabled.
 * - 0b0001 - PWM_A output enabled.
 */
/*@{*/
/*! @brief Read current value of the PWM_OUTEN_PWMA_EN field. */
#define PWM_RD_OUTEN_PWMA_EN(base) ((PWM_OUTEN_REG(base) & PWM_OUTEN_PWMA_EN_MASK) >> PWM_OUTEN_PWMA_EN_SHIFT)
#define PWM_BRD_OUTEN_PWMA_EN(base) (BME_UBFX16(&PWM_OUTEN_REG(base), PWM_OUTEN_PWMA_EN_SHIFT, PWM_OUTEN_PWMA_EN_WIDTH))

/*! @brief Set the PWMA_EN field to a new value. */
#define PWM_WR_OUTEN_PWMA_EN(base, value) (PWM_RMW_OUTEN(base, PWM_OUTEN_PWMA_EN_MASK, PWM_OUTEN_PWMA_EN(value)))
#define PWM_BWR_OUTEN_PWMA_EN(base, value) (BME_BFI16(&PWM_OUTEN_REG(base), ((uint16_t)(value) << PWM_OUTEN_PWMA_EN_SHIFT), PWM_OUTEN_PWMA_EN_SHIFT, PWM_OUTEN_PWMA_EN_WIDTH))
/*@}*/

