ErichStyger/mcuoneclipse/Examples/KDS/TWR-KV58F220M/TWR_KV58F220M_PEx_2_SDKv2/SDK/platform/devices/MKV58F24/include/MKV58F24_extension.h
/*! @brief Set the SM2OUT23 field to a new value. */
#define PWM_WR_SWCOUT_SM2OUT23(base, value) (PWM_RMW_SWCOUT(base, PWM_SWCOUT_SM2OUT23_MASK, PWM_SWCOUT_SM2OUT23(value)))
#define PWM_BWR_SWCOUT_SM2OUT23(base, value) (BME_BFI16(&PWM_SWCOUT_REG(base), ((uint16_t)(value) << PWM_SWCOUT_SM2OUT23_SHIFT), PWM_SWCOUT_SM2OUT23_SHIFT, PWM_SWCOUT_SM2OUT23_WIDTH))
/*@}*/

/*!
 * @name Register PWM_SWCOUT, field SM3OUT45[6] (RW)
 *
 * This bit is only used when DTSRCSEL[SM3SEL45] is set to b10. It allows
 * software control of which signal is supplied to the deadtime generator of that
 * submodule.
 *
 * Values:
 * - 0b0 - A logic 0 is supplied to the deadtime generator of submodule 3
 *     instead of PWM45.
 * - 0b1 - A logic 1 is supplied to the deadtime generator of submodule 3
 *     instead of PWM45.
 */
/*@{*/
/*! @brief Read current value of the PWM_SWCOUT_SM3OUT45 field. */
#define PWM_RD_SWCOUT_SM3OUT45(base) ((PWM_SWCOUT_REG(base) & PWM_SWCOUT_SM3OUT45_MASK) >> PWM_SWCOUT_SM3OUT45_SHIFT)
#define PWM_BRD_SWCOUT_SM3OUT45(base) (BME_UBFX16(&PWM_SWCOUT_REG(base), PWM_SWCOUT_SM3OUT45_SHIFT, PWM_SWCOUT_SM3OUT45_WIDTH))

/*! @brief Set the SM3OUT45 field to a new value. */
#define PWM_WR_SWCOUT_SM3OUT45(base, value) (PWM_RMW_SWCOUT(base, PWM_SWCOUT_SM3OUT45_MASK, PWM_SWCOUT_SM3OUT45(value)))
#define PWM_BWR_SWCOUT_SM3OUT45(base, value) (BME_BFI16(&PWM_SWCOUT_REG(base), ((uint16_t)(value) << PWM_SWCOUT_SM3OUT45_SHIFT), PWM_SWCOUT_SM3OUT45_SHIFT, PWM_SWCOUT_SM3OUT45_WIDTH))
/*@}*/

/*!
 * @name Register PWM_SWCOUT, field SM3OUT23[7] (RW)
 *
 * This bit is only used when DTSRCSEL[SM3SEL23] is set to 0b10. It allows
 * software control of which signal is supplied to the deadtime generator of that
 * submodule.
 *
 * Values:
 * - 0b0 - A logic 0 is supplied to the deadtime generator of submodule 3
 *     instead of PWM23.
 * - 0b1 - A logic 1 is supplied to the deadtime generator of submodule 3
 *     instead of PWM23.
 */
/*@{*/
/*! @brief Read current value of the PWM_SWCOUT_SM3OUT23 field. */
#define PWM_RD_SWCOUT_SM3OUT23(base) ((PWM_SWCOUT_REG(base) & PWM_SWCOUT_SM3OUT23_MASK) >> PWM_SWCOUT_SM3OUT23_SHIFT)
#define PWM_BRD_SWCOUT_SM3OUT23(base) (BME_UBFX16(&PWM_SWCOUT_REG(base), PWM_SWCOUT_SM3OUT23_SHIFT, PWM_SWCOUT_SM3OUT23_WIDTH))

/*! @brief Set the SM3OUT23 field to a new value. */
#define PWM_WR_SWCOUT_SM3OUT23(base, value) (PWM_RMW_SWCOUT(base, PWM_SWCOUT_SM3OUT23_MASK, PWM_SWCOUT_SM3OUT23(value)))
#define PWM_BWR_SWCOUT_SM3OUT23(base, value) (BME_BFI16(&PWM_SWCOUT_REG(base), ((uint16_t)(value) << PWM_SWCOUT_SM3OUT23_SHIFT), PWM_SWCOUT_SM3OUT23_SHIFT, PWM_SWCOUT_SM3OUT23_WIDTH))
/*@}*/

/*******************************************************************************
 * PWM_DTSRCSEL - PWM Source Select Register
 ******************************************************************************/

/*!
 * @brief PWM_DTSRCSEL - PWM Source Select Register (RW)
 *
 * Reset value: 0x0000U
 *
 * The PWM source select bits are double buffered and do not take effect until a
 * FORCE_OUT event occurs within the appropriate submodule. Reading these bits
 * reads the buffered value and not necessarily the value currently in effect.
 */
/*!
 * @name Constants and macros for entire PWM_DTSRCSEL register
 */
/*@{*/
#define PWM_RD_DTSRCSEL(base)    (PWM_DTSRCSEL_REG(base))
#define PWM_WR_DTSRCSEL(base, value) (PWM_DTSRCSEL_REG(base) = (value))
#define PWM_RMW_DTSRCSEL(base, mask, value) (PWM_WR_DTSRCSEL(base, (PWM_RD_DTSRCSEL(base) & ~(mask)) | (value)))
#define PWM_SET_DTSRCSEL(base, value) (BME_OR16(&PWM_DTSRCSEL_REG(base), (uint16_t)(value)))
#define PWM_CLR_DTSRCSEL(base, value) (BME_AND16(&PWM_DTSRCSEL_REG(base), (uint16_t)(~(value))))
#define PWM_TOG_DTSRCSEL(base, value) (BME_XOR16(&PWM_DTSRCSEL_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual PWM_DTSRCSEL bitfields
 */

/*!
 * @name Register PWM_DTSRCSEL, field SM0SEL45[1:0] (RW)
 *
 * This field selects possible over-rides to the generated SM0PWM45 signal that
 * will be passed to the deadtime logic upon the occurrence of a FORCE_OUT event
 * in that submodule.
 *
 * Values:
 * - 0b00 - Generated SM0PWM45 signal is used by the deadtime logic.
 * - 0b01 - Inverted generated SM0PWM45 signal is used by the deadtime logic.
 * - 0b10 - SWCOUT[SM0OUT45] is used by the deadtime logic.
 * - 0b11 - PWMx_EXTB0 signal is used by the deadtime logic.
 */
/*@{*/
/*! @brief Read current value of the PWM_DTSRCSEL_SM0SEL45 field. */
#define PWM_RD_DTSRCSEL_SM0SEL45(base) ((PWM_DTSRCSEL_REG(base) & PWM_DTSRCSEL_SM0SEL45_MASK) >> PWM_DTSRCSEL_SM0SEL45_SHIFT)
#define PWM_BRD_DTSRCSEL_SM0SEL45(base) (BME_UBFX16(&PWM_DTSRCSEL_REG(base), PWM_DTSRCSEL_SM0SEL45_SHIFT, PWM_DTSRCSEL_SM0SEL45_WIDTH))

/*! @brief Set the SM0SEL45 field to a new value. */
#define PWM_WR_DTSRCSEL_SM0SEL45(base, value) (PWM_RMW_DTSRCSEL(base, PWM_DTSRCSEL_SM0SEL45_MASK, PWM_DTSRCSEL_SM0SEL45(value)))
#define PWM_BWR_DTSRCSEL_SM0SEL45(base, value) (BME_BFI16(&PWM_DTSRCSEL_REG(base), ((uint16_t)(value) << PWM_DTSRCSEL_SM0SEL45_SHIFT), PWM_DTSRCSEL_SM0SEL45_SHIFT, PWM_DTSRCSEL_SM0SEL45_WIDTH))
/*@}*/

/*!
 * @name Register PWM_DTSRCSEL, field SM0SEL23[3:2] (RW)
 *
 * This field selects possible over-rides to the generated SM0PWM23 signal that
 * will be passed to the deadtime logic upon the occurrence of a FORCE_OUT event
 * in that submodule.
 *
 * Values:
 * - 0b00 - Generated SM0PWM23 signal is used by the deadtime logic.
 * - 0b01 - Inverted generated SM0PWM23 signal is used by the deadtime logic.
 * - 0b10 - SWCOUT[SM0OUT23] is used by the deadtime logic.
 * - 0b11 - PWMx_EXTA0 signal is used by the deadtime logic.
 */
/*@{*/
/*! @brief Read current value of the PWM_DTSRCSEL_SM0SEL23 field. */
#define PWM_RD_DTSRCSEL_SM0SEL23(base) ((PWM_DTSRCSEL_REG(base) & PWM_DTSRCSEL_SM0SEL23_MASK) >> PWM_DTSRCSEL_SM0SEL23_SHIFT)
#define PWM_BRD_DTSRCSEL_SM0SEL23(base) (BME_UBFX16(&PWM_DTSRCSEL_REG(base), PWM_DTSRCSEL_SM0SEL23_SHIFT, PWM_DTSRCSEL_SM0SEL23_WIDTH))

/*! @brief Set the SM0SEL23 field to a new value. */
#define PWM_WR_DTSRCSEL_SM0SEL23(base, value) (PWM_RMW_DTSRCSEL(base, PWM_DTSRCSEL_SM0SEL23_MASK, PWM_DTSRCSEL_SM0SEL23(value)))
#define PWM_BWR_DTSRCSEL_SM0SEL23(base, value) (BME_BFI16(&PWM_DTSRCSEL_REG(base), ((uint16_t)(value) << PWM_DTSRCSEL_SM0SEL23_SHIFT), PWM_DTSRCSEL_SM0SEL23_SHIFT, PWM_DTSRCSEL_SM0SEL23_WIDTH))
/*@}*/

/*!
 * @name Register PWM_DTSRCSEL, field SM1SEL45[5:4] (RW)
 *
 * This field selects possible over-rides to the generated SM1PWM45 signal that
 * will be passed to the deadtime logic upon the occurrence of a FORCE_OUT event
 * in that submodule.
 *
 * Values:
 * - 0b00 - Generated SM1PWM45 signal is used by the deadtime logic.
 * - 0b01 - Inverted generated SM1PWM45 signal is used by the deadtime logic.
 * - 0b10 - SWCOUT[SM1OUT45] is used by the deadtime logic.
 * - 0b11 - PWMx_EXTB1 signal is used by the deadtime logic.
 */
/*@{*/
/*! @brief Read current value of the PWM_DTSRCSEL_SM1SEL45 field. */
#define PWM_RD_DTSRCSEL_SM1SEL45(base) ((PWM_DTSRCSEL_REG(base) & PWM_DTSRCSEL_SM1SEL45_MASK) >> PWM_DTSRCSEL_SM1SEL45_SHIFT)
#define PWM_BRD_DTSRCSEL_SM1SEL45(base) (BME_UBFX16(&PWM_DTSRCSEL_REG(base), PWM_DTSRCSEL_SM1SEL45_SHIFT, PWM_DTSRCSEL_SM1SEL45_WIDTH))

/*! @brief Set the SM1SEL45 field to a new value. */
#define PWM_WR_DTSRCSEL_SM1SEL45(base, value) (PWM_RMW_DTSRCSEL(base, PWM_DTSRCSEL_SM1SEL45_MASK, PWM_DTSRCSEL_SM1SEL45(value)))
#define PWM_BWR_DTSRCSEL_SM1SEL45(base, value) (BME_BFI16(&PWM_DTSRCSEL_REG(base), ((uint16_t)(value) << PWM_DTSRCSEL_SM1SEL45_SHIFT), PWM_DTSRCSEL_SM1SEL45_SHIFT, PWM_DTSRCSEL_SM1SEL45_WIDTH))
/*@}*/

/*!
 * @name Register PWM_DTSRCSEL, field SM1SEL23[7:6] (RW)
 *
 * This field selects possible over-rides to the generated SM1PWM23 signal that
 * will be passed to the deadtime logic upon the occurrence of a FORCE_OUT event
 * in that submodule.
 *
 * Values:
 * - 0b00 - Generated SM1PWM23 signal is used by the deadtime logic.
 * - 0b01 - Inverted generated SM1PWM23 signal is used by the deadtime logic.
 * - 0b10 - SWCOUT[SM1OUT23] is used by the deadtime logic.
 * - 0b11 - PWMx_EXTA1 signal is used by the deadtime logic.
 */
/*@{*/
/*! @brief Read current value of the PWM_DTSRCSEL_SM1SEL23 field. */
#define PWM_RD_DTSRCSEL_SM1SEL23(base) ((PWM_DTSRCSEL_REG(base) & PWM_DTSRCSEL_SM1SEL23_MASK) >> PWM_DTSRCSEL_SM1SEL23_SHIFT)
#define PWM_BRD_DTSRCSEL_SM1SEL23(base) (BME_UBFX16(&PWM_DTSRCSEL_REG(base), PWM_DTSRCSEL_SM1SEL23_SHIFT, PWM_DTSRCSEL_SM1SEL23_WIDTH))

/*! @brief Set the SM1SEL23 field to a new value. */
#define PWM_WR_DTSRCSEL_SM1SEL23(base, value) (PWM_RMW_DTSRCSEL(base, PWM_DTSRCSEL_SM1SEL23_MASK, PWM_DTSRCSEL_SM1SEL23(value)))
#define PWM_BWR_DTSRCSEL_SM1SEL23(base, value) (BME_BFI16(&PWM_DTSRCSEL_REG(base), ((uint16_t)(value) << PWM_DTSRCSEL_SM1SEL23_SHIFT), PWM_DTSRCSEL_SM1SEL23_SHIFT, PWM_DTSRCSEL_SM1SEL23_WIDTH))
/*@}*/

/*!
 * @name Register PWM_DTSRCSEL, field SM2SEL45[9:8] (RW)
 *
 * This field selects possible over-rides to the generated SM2PWM45 signal that
 * will be passed to the deadtime logic upon the occurrence of a FORCE_OUT event
 * in that sudeadtime logic upon the occurrence of a FORCE_OUT event in that
 * submodule.
 *
 * Values:
 * - 0b00 - Generated SM2PWM45 signal is used by the deadtime logic.
 * - 0b01 - Inverted generated SM2PWM45 signal is used by the deadtime logic.
 * - 0b10 - SWCOUT[SM2OUT45] is used by the deadtime logic.
 * - 0b11 - PWMx_EXTB2 signal is used by the deadtime logic.
 */
/*@{*/
/*! @brief Read current value of the PWM_DTSRCSEL_SM2SEL45 field. */
#define PWM_RD_DTSRCSEL_SM2SEL45(base) ((PWM_DTSRCSEL_REG(base) & PWM_DTSRCSEL_SM2SEL45_MASK) >> PWM_DTSRCSEL_SM2SEL45_SHIFT)
#define PWM_BRD_DTSRCSEL_SM2SEL45(base) (BME_UBFX16(&PWM_DTSRCSEL_REG(base), PWM_DTSRCSEL_SM2SEL45_SHIFT, PWM_DTSRCSEL_SM2SEL45_WIDTH))

