ErichStyger/mcuoneclipse/Examples/KDS/TWR-KV58F220M/TWR_KV58F220M_PEx_2_SDKv2/SDK/platform/devices/MKV58F24/include/MKV58F24_extension.h
/*! @brief Set the LDOK field to a new value. */
#define PWM_WR_MCTRL_LDOK(base, value) (PWM_RMW_MCTRL(base, PWM_MCTRL_LDOK_MASK, PWM_MCTRL_LDOK(value)))
#define PWM_BWR_MCTRL_LDOK(base, value) (BME_BFI16(&PWM_MCTRL_REG(base), ((uint16_t)(value) << PWM_MCTRL_LDOK_SHIFT), PWM_MCTRL_LDOK_SHIFT, PWM_MCTRL_LDOK_WIDTH))
/*@}*/

/*!
 * @name Register PWM_MCTRL, field CLDOK[7:4] (WORZ)
 *
 * The 4 bits of CLDOK field correspond to submodules 3-0, respectively. Each
 * write-only bit is used to clear the corresponding bit of MCTRL0[LDOK]. Write a 1
 * to CLDOK to clear the corresponding MCTRL0[LDOK] bit. If a reload occurs
 * within a submodule with the corresponding MCTRL0[LDOK] bit set at the same time
 * that MCTRL0[CLDOK] is written, then the reload in that submodule will not be
 * performed and MCTRL0[LDOK] will be cleared. CLDOK bit is self-clearing and always
 * reads as a 0.
 */
/*@{*/
/*! @brief Set the CLDOK field to a new value. */
#define PWM_WR_MCTRL_CLDOK(base, value) (PWM_RMW_MCTRL(base, PWM_MCTRL_CLDOK_MASK, PWM_MCTRL_CLDOK(value)))
#define PWM_BWR_MCTRL_CLDOK(base, value) (BME_BFI16(&PWM_MCTRL_REG(base), ((uint16_t)(value) << PWM_MCTRL_CLDOK_SHIFT), PWM_MCTRL_CLDOK_SHIFT, PWM_MCTRL_CLDOK_WIDTH))
/*@}*/

/*!
 * @name Register PWM_MCTRL, field RUN[11:8] (RW)
 *
 * The four read/write bits of this field enable the clocks to the PWM generator
 * of submodules 3-0, respectively. The corresponding MCTRL0[RUN] bit must be
 * set for each submodule that is using its input capture functions or is using the
 * local reload as its reload source. When this bit equals zero, the submodule
 * counter is reset. A reset clears this field.
 *
 * Values:
 * - 0b0000 - PWM generator is disabled in the corresponding submodule.
 * - 0b0001 - PWM generator is enabled in the corresponding submodule.
 */
/*@{*/
/*! @brief Read current value of the PWM_MCTRL_RUN field. */
#define PWM_RD_MCTRL_RUN(base) ((PWM_MCTRL_REG(base) & PWM_MCTRL_RUN_MASK) >> PWM_MCTRL_RUN_SHIFT)
#define PWM_BRD_MCTRL_RUN(base) (BME_UBFX16(&PWM_MCTRL_REG(base), PWM_MCTRL_RUN_SHIFT, PWM_MCTRL_RUN_WIDTH))

/*! @brief Set the RUN field to a new value. */
#define PWM_WR_MCTRL_RUN(base, value) (PWM_RMW_MCTRL(base, PWM_MCTRL_RUN_MASK, PWM_MCTRL_RUN(value)))
#define PWM_BWR_MCTRL_RUN(base, value) (BME_BFI16(&PWM_MCTRL_REG(base), ((uint16_t)(value) << PWM_MCTRL_RUN_SHIFT), PWM_MCTRL_RUN_SHIFT, PWM_MCTRL_RUN_WIDTH))
/*@}*/

/*!
 * @name Register PWM_MCTRL, field IPOL[15:12] (RW)
 *
 * The four buffered read/write bits of this field correspond to submodules 3-0,
 * respectively. Each bit selects between PWM23 and PWM45 as the source for the
 * generation of the complementary PWM pair output for the corresponding
 * submodule. MCTRL0[IPOL] is ignored in independent mode. MCTRL0[IPOL] does not take
 * effect until a FORCE_OUT event takes place in the appropriate submodule. Reading
 * MCTRL0[IPOL] reads the buffered value and not necessarily the value currently
 * in effect.
 *
 * Values:
 * - 0b0000 - PWM23 is used to generate complementary PWM pair in the
 *     corresponding submodule.
 * - 0b0001 - PWM45 is used to generate complementary PWM pair in the
 *     corresponding submodule.
 */
/*@{*/
/*! @brief Read current value of the PWM_MCTRL_IPOL field. */
#define PWM_RD_MCTRL_IPOL(base) ((PWM_MCTRL_REG(base) & PWM_MCTRL_IPOL_MASK) >> PWM_MCTRL_IPOL_SHIFT)
#define PWM_BRD_MCTRL_IPOL(base) (BME_UBFX16(&PWM_MCTRL_REG(base), PWM_MCTRL_IPOL_SHIFT, PWM_MCTRL_IPOL_WIDTH))

/*! @brief Set the IPOL field to a new value. */
#define PWM_WR_MCTRL_IPOL(base, value) (PWM_RMW_MCTRL(base, PWM_MCTRL_IPOL_MASK, PWM_MCTRL_IPOL(value)))
#define PWM_BWR_MCTRL_IPOL(base, value) (BME_BFI16(&PWM_MCTRL_REG(base), ((uint16_t)(value) << PWM_MCTRL_IPOL_SHIFT), PWM_MCTRL_IPOL_SHIFT, PWM_MCTRL_IPOL_WIDTH))
/*@}*/

/*******************************************************************************
 * PWM_MCTRL2 - Master Control Register 1
 ******************************************************************************/

/*!
 * @brief PWM_MCTRL2 - Master Control Register 1 (RW)
 *
 * Reset value: 0x0000U
 *
 * This register is optional and may not be available on all PWM instances. See
 * the chip-specific information for details.
 */
/*!
 * @name Constants and macros for entire PWM_MCTRL2 register
 */
/*@{*/
#define PWM_RD_MCTRL2(base)      (PWM_MCTRL2_REG(base))
#define PWM_WR_MCTRL2(base, value) (PWM_MCTRL2_REG(base) = (value))
#define PWM_RMW_MCTRL2(base, mask, value) (PWM_WR_MCTRL2(base, (PWM_RD_MCTRL2(base) & ~(mask)) | (value)))
#define PWM_SET_MCTRL2(base, value) (BME_OR16(&PWM_MCTRL2_REG(base), (uint16_t)(value)))
#define PWM_CLR_MCTRL2(base, value) (BME_AND16(&PWM_MCTRL2_REG(base), (uint16_t)(~(value))))
#define PWM_TOG_MCTRL2(base, value) (BME_XOR16(&PWM_MCTRL2_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual PWM_MCTRL2 bitfields
 */

/*!
 * @name Register PWM_MCTRL2, field MONPLL[1:0] (RW)
 *
 * These bits are used to control disabling of the fractional delay block when
 * the chip PLL is unlocked and/or missing its input reference. The fractional
 * delay block requires a continuous MHz clock from the PLL. If this clock turns off
 * when the fractional delay block is being used, then the output of the
 * fractional delay block can be stuck high or low even if the PLL restarts. When this
 * control bit is set, PLL problems cause the fractional delay block to be
 * disabled until the PLL returns to a locked state. Once the PLL is receiving a proper
 * reference and is locked, the fractional delay block requires a 25 us startup
 * time just as if the FRCTRL[FRAC*_EN] bits had been turned off and turned on
 * again. If PLL monitoring is disabled, then software should manually clear and
 * then set the FRCTRL[FRAC*_EN] bits when the PLL loses its reference or loses
 * lock. This will cause the fractional delay block to be disabled and restarted. If
 * the fractional delay block is not being used, then the value of these bits do
 * not matter.
 *
 * Values:
 * - 0b00 - Not locked. Do not monitor PLL operation. Resetting of the
 *     fractional delay block in case of PLL losing lock will be controlled by software.
 * - 0b01 - Not locked. Monitor PLL operation to automatically disable the
 *     fractional delay block when the PLL encounters problems.
 * - 0b10 - Locked. Do not monitor PLL operation. Resetting of the fractional
 *     delay block in case of PLL losing lock will be controlled by software. These
 *     bits are write protected until the next reset.
 * - 0b11 - Locked. Monitor PLL operation to automatically disable the
 *     fractional delay block when the PLL encounters problems. These bits are write
 *     protected until the next reset.
 */
/*@{*/
/*! @brief Read current value of the PWM_MCTRL2_MONPLL field. */
#define PWM_RD_MCTRL2_MONPLL(base) ((PWM_MCTRL2_REG(base) & PWM_MCTRL2_MONPLL_MASK) >> PWM_MCTRL2_MONPLL_SHIFT)
#define PWM_BRD_MCTRL2_MONPLL(base) (BME_UBFX16(&PWM_MCTRL2_REG(base), PWM_MCTRL2_MONPLL_SHIFT, PWM_MCTRL2_MONPLL_WIDTH))

/*! @brief Set the MONPLL field to a new value. */
#define PWM_WR_MCTRL2_MONPLL(base, value) (PWM_RMW_MCTRL2(base, PWM_MCTRL2_MONPLL_MASK, PWM_MCTRL2_MONPLL(value)))
#define PWM_BWR_MCTRL2_MONPLL(base, value) (BME_BFI16(&PWM_MCTRL2_REG(base), ((uint16_t)(value) << PWM_MCTRL2_MONPLL_SHIFT), PWM_MCTRL2_MONPLL_SHIFT, PWM_MCTRL2_MONPLL_WIDTH))
/*@}*/

