ErichStyger/mcuoneclipse/Examples/KDS/TWR-KV58F220M/TWR_KV58F220M_PEx_2_SDKv2/SDK/platform/devices/MKV58F24/include/MKV58F24_extension.h
/*
 * Constants & macros for individual PWM_FFILT bitfields
 */

/*!
 * @name Register PWM_FFILT, field FILT_PER[7:0] (RW)
 *
 * This 8-bit field applies universally to all fault inputs. These bits
 * represent the sampling period (in IPBus clock cycles) of the fault pin input filter.
 * Each input is sampled multiple times at the rate specified by this field. If
 * FILT_PER is 0x00 (default), then the input filter is bypassed. The value of
 * FILT_PER affects the input latency. When changing values for FILT_PER from one
 * non-zero value to another non-zero value, first write a value of zero to clear
 * the filter.
 */
/*@{*/
/*! @brief Read current value of the PWM_FFILT_FILT_PER field. */
#define PWM_RD_FFILT_FILT_PER(base) ((PWM_FFILT_REG(base) & PWM_FFILT_FILT_PER_MASK) >> PWM_FFILT_FILT_PER_SHIFT)
#define PWM_BRD_FFILT_FILT_PER(base) (BME_UBFX16(&PWM_FFILT_REG(base), PWM_FFILT_FILT_PER_SHIFT, PWM_FFILT_FILT_PER_WIDTH))

/*! @brief Set the FILT_PER field to a new value. */
#define PWM_WR_FFILT_FILT_PER(base, value) (PWM_RMW_FFILT(base, PWM_FFILT_FILT_PER_MASK, PWM_FFILT_FILT_PER(value)))
#define PWM_BWR_FFILT_FILT_PER(base, value) (BME_BFI16(&PWM_FFILT_REG(base), ((uint16_t)(value) << PWM_FFILT_FILT_PER_SHIFT), PWM_FFILT_FILT_PER_SHIFT, PWM_FFILT_FILT_PER_WIDTH))
/*@}*/

/*!
 * @name Register PWM_FFILT, field FILT_CNT[10:8] (RW)
 *
 * These bits represent the number of consecutive samples that must agree prior
 * to the input filter accepting an input transition. The number of samples is
 * the decimal value of this field plus three: the bitfield value of 0-7 represents
 * 3-10 samples, respectively. The value of FILT_CNT affects the input latency.
 */
/*@{*/
/*! @brief Read current value of the PWM_FFILT_FILT_CNT field. */
#define PWM_RD_FFILT_FILT_CNT(base) ((PWM_FFILT_REG(base) & PWM_FFILT_FILT_CNT_MASK) >> PWM_FFILT_FILT_CNT_SHIFT)
#define PWM_BRD_FFILT_FILT_CNT(base) (BME_UBFX16(&PWM_FFILT_REG(base), PWM_FFILT_FILT_CNT_SHIFT, PWM_FFILT_FILT_CNT_WIDTH))

/*! @brief Set the FILT_CNT field to a new value. */
#define PWM_WR_FFILT_FILT_CNT(base, value) (PWM_RMW_FFILT(base, PWM_FFILT_FILT_CNT_MASK, PWM_FFILT_FILT_CNT(value)))
#define PWM_BWR_FFILT_FILT_CNT(base, value) (BME_BFI16(&PWM_FFILT_REG(base), ((uint16_t)(value) << PWM_FFILT_FILT_CNT_SHIFT), PWM_FFILT_FILT_CNT_SHIFT, PWM_FFILT_FILT_CNT_WIDTH))
/*@}*/

/*!
 * @name Register PWM_FFILT, field GSTR[15] (RW)
 *
 * This bit is used to enable the fault glitch stretching logic. This logic
 * ensures that narrow fault glitches are stretched to be at least 2 IPBus clock
 * cycles wide. In some cases a narrow fault input can cause problems due to the
 * short PWM output shutdown/re-activation time. The stretching logic ensures that a
 * glitch on the fault input, when the fault filter is disabled, will be
 * registered in the fault flags.
 *
 * Values:
 * - 0b0 - Fault input glitch stretching is disabled.
 * - 0b1 - Input fault signals will be stretched to at least 2 IPBus clock
 *     cycles.
 */
/*@{*/
/*! @brief Read current value of the PWM_FFILT_GSTR field. */
#define PWM_RD_FFILT_GSTR(base) ((PWM_FFILT_REG(base) & PWM_FFILT_GSTR_MASK) >> PWM_FFILT_GSTR_SHIFT)
#define PWM_BRD_FFILT_GSTR(base) (BME_UBFX16(&PWM_FFILT_REG(base), PWM_FFILT_GSTR_SHIFT, PWM_FFILT_GSTR_WIDTH))

/*! @brief Set the GSTR field to a new value. */
#define PWM_WR_FFILT_GSTR(base, value) (PWM_RMW_FFILT(base, PWM_FFILT_GSTR_MASK, PWM_FFILT_GSTR(value)))
#define PWM_BWR_FFILT_GSTR(base, value) (BME_BFI16(&PWM_FFILT_REG(base), ((uint16_t)(value) << PWM_FFILT_GSTR_SHIFT), PWM_FFILT_GSTR_SHIFT, PWM_FFILT_GSTR_WIDTH))
/*@}*/

/*******************************************************************************
 * PWM_FTST - Fault Test Register
 ******************************************************************************/

/*!
 * @brief PWM_FTST - Fault Test Register (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire PWM_FTST register
 */
/*@{*/
#define PWM_RD_FTST(base)        (PWM_FTST_REG(base))
#define PWM_WR_FTST(base, value) (PWM_FTST_REG(base) = (value))
#define PWM_RMW_FTST(base, mask, value) (PWM_WR_FTST(base, (PWM_RD_FTST(base) & ~(mask)) | (value)))
#define PWM_SET_FTST(base, value) (BME_OR16(&PWM_FTST_REG(base), (uint16_t)(value)))
#define PWM_CLR_FTST(base, value) (BME_AND16(&PWM_FTST_REG(base), (uint16_t)(~(value))))
#define PWM_TOG_FTST(base, value) (BME_XOR16(&PWM_FTST_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual PWM_FTST bitfields
 */

/*!
 * @name Register PWM_FTST, field FTEST[0] (RW)
 *
 * This read/write bit is used to simulate a fault condition. Setting this bit
 * causes a simulated fault to be sent into all of the fault filters. The
 * condition propagates to the fault flags and possibly the PWM outputs depending on the
 * DISMAPn settings. Clearing this bit removes the simulated fault condition.
 *
 * Values:
 * - 0b0 - No fault
 * - 0b1 - Cause a simulated fault
 */
/*@{*/
/*! @brief Read current value of the PWM_FTST_FTEST field. */
#define PWM_RD_FTST_FTEST(base) ((PWM_FTST_REG(base) & PWM_FTST_FTEST_MASK) >> PWM_FTST_FTEST_SHIFT)
#define PWM_BRD_FTST_FTEST(base) (BME_UBFX16(&PWM_FTST_REG(base), PWM_FTST_FTEST_SHIFT, PWM_FTST_FTEST_WIDTH))

/*! @brief Set the FTEST field to a new value. */
#define PWM_WR_FTST_FTEST(base, value) (PWM_RMW_FTST(base, PWM_FTST_FTEST_MASK, PWM_FTST_FTEST(value)))
#define PWM_BWR_FTST_FTEST(base, value) (BME_BFI16(&PWM_FTST_REG(base), ((uint16_t)(value) << PWM_FTST_FTEST_SHIFT), PWM_FTST_FTEST_SHIFT, PWM_FTST_FTEST_WIDTH))
/*@}*/

/*******************************************************************************
 * PWM_FCTRL2 - Fault Control 2 Register
 ******************************************************************************/

/*!
 * @brief PWM_FCTRL2 - Fault Control 2 Register (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire PWM_FCTRL2 register
 */
/*@{*/
#define PWM_RD_FCTRL2(base)      (PWM_FCTRL2_REG(base))
#define PWM_WR_FCTRL2(base, value) (PWM_FCTRL2_REG(base) = (value))
#define PWM_RMW_FCTRL2(base, mask, value) (PWM_WR_FCTRL2(base, (PWM_RD_FCTRL2(base) & ~(mask)) | (value)))
#define PWM_SET_FCTRL2(base, value) (BME_OR16(&PWM_FCTRL2_REG(base), (uint16_t)(value)))
#define PWM_CLR_FCTRL2(base, value) (BME_AND16(&PWM_FCTRL2_REG(base), (uint16_t)(~(value))))
#define PWM_TOG_FCTRL2(base, value) (BME_XOR16(&PWM_FCTRL2_REG(base), (uint16_t)(value)))
/*@}*/

