ErichStyger/mcuoneclipse/Examples/KDS/TWR-KV58F220M/TWR_KV58F220M_PEx_2_SDKv2/SDK/platform/devices/MKV58F24/include/MKV58F24_extension.h
/*! @brief Set the FTM0TRG0SRC field to a new value. */
#define SIM_WR_SOPT4_FTM0TRG0SRC(base, value) (SIM_RMW_SOPT4(base, SIM_SOPT4_FTM0TRG0SRC_MASK, SIM_SOPT4_FTM0TRG0SRC(value)))
#define SIM_BWR_SOPT4_FTM0TRG0SRC(base, value) (BME_BFI32(&SIM_SOPT4_REG(base), ((uint32_t)(value) << SIM_SOPT4_FTM0TRG0SRC_SHIFT), SIM_SOPT4_FTM0TRG0SRC_SHIFT, SIM_SOPT4_FTM0TRG0SRC_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT4, field FTM0TRG1SRC[17] (RW)
 *
 * Selects the source of FTM0 hardware trigger 1.
 *
 * Values:
 * - 0b0 - PDB0 channel 1 output trigger drives FTM0 hardware trigger 1
 * - 0b1 - FTM1 channel match drives FTM0 hardware trigger 1
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT4_FTM0TRG1SRC field. */
#define SIM_RD_SOPT4_FTM0TRG1SRC(base) ((SIM_SOPT4_REG(base) & SIM_SOPT4_FTM0TRG1SRC_MASK) >> SIM_SOPT4_FTM0TRG1SRC_SHIFT)
#define SIM_BRD_SOPT4_FTM0TRG1SRC(base) (BME_UBFX32(&SIM_SOPT4_REG(base), SIM_SOPT4_FTM0TRG1SRC_SHIFT, SIM_SOPT4_FTM0TRG1SRC_WIDTH))

/*! @brief Set the FTM0TRG1SRC field to a new value. */
#define SIM_WR_SOPT4_FTM0TRG1SRC(base, value) (SIM_RMW_SOPT4(base, SIM_SOPT4_FTM0TRG1SRC_MASK, SIM_SOPT4_FTM0TRG1SRC(value)))
#define SIM_BWR_SOPT4_FTM0TRG1SRC(base, value) (BME_BFI32(&SIM_SOPT4_REG(base), ((uint32_t)(value) << SIM_SOPT4_FTM0TRG1SRC_SHIFT), SIM_SOPT4_FTM0TRG1SRC_SHIFT, SIM_SOPT4_FTM0TRG1SRC_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT4, field FTM0TRG2SRC[18] (RW)
 *
 * Selects the source of FTM0 hardware trigger 2.
 *
 * Values:
 * - 0b0 - FTM0_FLT0 pin drives FTM0 hardware trigger 2
 * - 0b1 - XBARA output 34 drives FTM0 hardware trigger 2
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT4_FTM0TRG2SRC field. */
#define SIM_RD_SOPT4_FTM0TRG2SRC(base) ((SIM_SOPT4_REG(base) & SIM_SOPT4_FTM0TRG2SRC_MASK) >> SIM_SOPT4_FTM0TRG2SRC_SHIFT)
#define SIM_BRD_SOPT4_FTM0TRG2SRC(base) (BME_UBFX32(&SIM_SOPT4_REG(base), SIM_SOPT4_FTM0TRG2SRC_SHIFT, SIM_SOPT4_FTM0TRG2SRC_WIDTH))

/*! @brief Set the FTM0TRG2SRC field to a new value. */
#define SIM_WR_SOPT4_FTM0TRG2SRC(base, value) (SIM_RMW_SOPT4(base, SIM_SOPT4_FTM0TRG2SRC_MASK, SIM_SOPT4_FTM0TRG2SRC(value)))
#define SIM_BWR_SOPT4_FTM0TRG2SRC(base, value) (BME_BFI32(&SIM_SOPT4_REG(base), ((uint32_t)(value) << SIM_SOPT4_FTM0TRG2SRC_SHIFT), SIM_SOPT4_FTM0TRG2SRC_SHIFT, SIM_SOPT4_FTM0TRG2SRC_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT4, field FTM1TRG0SRC[20] (RW)
 *
 * Selects the source of FTM1 hardware trigger 0. Also in parallel
 * SIM_OPT8[FTM1_SYNCBIT] will be fed to FTM1 Hardware Trigger 0.
 *
 * Values:
 * - 0b0 - CMP0 output drives FTM1 hardware trigger 0
 * - 0b1 - FTM0 channel match drives FTM1 hardware trigger 0
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT4_FTM1TRG0SRC field. */
#define SIM_RD_SOPT4_FTM1TRG0SRC(base) ((SIM_SOPT4_REG(base) & SIM_SOPT4_FTM1TRG0SRC_MASK) >> SIM_SOPT4_FTM1TRG0SRC_SHIFT)
#define SIM_BRD_SOPT4_FTM1TRG0SRC(base) (BME_UBFX32(&SIM_SOPT4_REG(base), SIM_SOPT4_FTM1TRG0SRC_SHIFT, SIM_SOPT4_FTM1TRG0SRC_WIDTH))

/*! @brief Set the FTM1TRG0SRC field to a new value. */
#define SIM_WR_SOPT4_FTM1TRG0SRC(base, value) (SIM_RMW_SOPT4(base, SIM_SOPT4_FTM1TRG0SRC_MASK, SIM_SOPT4_FTM1TRG0SRC(value)))
#define SIM_BWR_SOPT4_FTM1TRG0SRC(base, value) (BME_BFI32(&SIM_SOPT4_REG(base), ((uint32_t)(value) << SIM_SOPT4_FTM1TRG0SRC_SHIFT), SIM_SOPT4_FTM1TRG0SRC_SHIFT, SIM_SOPT4_FTM1TRG0SRC_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT4, field FTM1TRG2SRC[22] (RW)
 *
 * Selects the source of FTM1 hardware trigger 2.
 *
 * Values:
 * - 0b0 - FTM1_FLT0 pin drives FTM1 hardware trigger 2
 * - 0b1 - XBARA output 35 drives FTM1 hardware trigger 2
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT4_FTM1TRG2SRC field. */
#define SIM_RD_SOPT4_FTM1TRG2SRC(base) ((SIM_SOPT4_REG(base) & SIM_SOPT4_FTM1TRG2SRC_MASK) >> SIM_SOPT4_FTM1TRG2SRC_SHIFT)
#define SIM_BRD_SOPT4_FTM1TRG2SRC(base) (BME_UBFX32(&SIM_SOPT4_REG(base), SIM_SOPT4_FTM1TRG2SRC_SHIFT, SIM_SOPT4_FTM1TRG2SRC_WIDTH))

/*! @brief Set the FTM1TRG2SRC field to a new value. */
#define SIM_WR_SOPT4_FTM1TRG2SRC(base, value) (SIM_RMW_SOPT4(base, SIM_SOPT4_FTM1TRG2SRC_MASK, SIM_SOPT4_FTM1TRG2SRC(value)))
#define SIM_BWR_SOPT4_FTM1TRG2SRC(base, value) (BME_BFI32(&SIM_SOPT4_REG(base), ((uint32_t)(value) << SIM_SOPT4_FTM1TRG2SRC_SHIFT), SIM_SOPT4_FTM1TRG2SRC_SHIFT, SIM_SOPT4_FTM1TRG2SRC_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT4, field FTM2TRG0SRC[24] (RW)
 *
 * Selects the source of FTM2 hardware trigger 0. Also in parallel
 * SIM_OPT8[FTM2_SYNCBIT] will be fed to FTM2 Hardware Trigger 0.
 *
 * Values:
 * - 0b0 - CMP0 output drives FTM2 hardware trigger 0
 * - 0b1 - FTM0 channel match drives FTM2 hardware trigger 0
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT4_FTM2TRG0SRC field. */
#define SIM_RD_SOPT4_FTM2TRG0SRC(base) ((SIM_SOPT4_REG(base) & SIM_SOPT4_FTM2TRG0SRC_MASK) >> SIM_SOPT4_FTM2TRG0SRC_SHIFT)
#define SIM_BRD_SOPT4_FTM2TRG0SRC(base) (BME_UBFX32(&SIM_SOPT4_REG(base), SIM_SOPT4_FTM2TRG0SRC_SHIFT, SIM_SOPT4_FTM2TRG0SRC_WIDTH))

/*! @brief Set the FTM2TRG0SRC field to a new value. */
#define SIM_WR_SOPT4_FTM2TRG0SRC(base, value) (SIM_RMW_SOPT4(base, SIM_SOPT4_FTM2TRG0SRC_MASK, SIM_SOPT4_FTM2TRG0SRC(value)))
#define SIM_BWR_SOPT4_FTM2TRG0SRC(base, value) (BME_BFI32(&SIM_SOPT4_REG(base), ((uint32_t)(value) << SIM_SOPT4_FTM2TRG0SRC_SHIFT), SIM_SOPT4_FTM2TRG0SRC_SHIFT, SIM_SOPT4_FTM2TRG0SRC_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT4, field FTM2TRG2SRC[26] (RW)
 *
 * Selects the source of FTM2 hardware trigger 2.
 *
 * Values:
 * - 0b0 - FTM2_FLT0 pin drives FTM2 hardware trigger 2
 * - 0b1 - XBARA output 36 drives FTM2 hardware trigger 2
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT4_FTM2TRG2SRC field. */
#define SIM_RD_SOPT4_FTM2TRG2SRC(base) ((SIM_SOPT4_REG(base) & SIM_SOPT4_FTM2TRG2SRC_MASK) >> SIM_SOPT4_FTM2TRG2SRC_SHIFT)
#define SIM_BRD_SOPT4_FTM2TRG2SRC(base) (BME_UBFX32(&SIM_SOPT4_REG(base), SIM_SOPT4_FTM2TRG2SRC_SHIFT, SIM_SOPT4_FTM2TRG2SRC_WIDTH))

/*! @brief Set the FTM2TRG2SRC field to a new value. */
#define SIM_WR_SOPT4_FTM2TRG2SRC(base, value) (SIM_RMW_SOPT4(base, SIM_SOPT4_FTM2TRG2SRC_MASK, SIM_SOPT4_FTM2TRG2SRC(value)))
#define SIM_BWR_SOPT4_FTM2TRG2SRC(base, value) (BME_BFI32(&SIM_SOPT4_REG(base), ((uint32_t)(value) << SIM_SOPT4_FTM2TRG2SRC_SHIFT), SIM_SOPT4_FTM2TRG2SRC_SHIFT, SIM_SOPT4_FTM2TRG2SRC_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT4, field FTM3TRG0SRC[28] (RW)
 *
 * Selects the source of FTM3 hardware trigger 0. Also in parallel
 * SIM_OPT8[FTM3_SYNCBIT] will be fed to FTM3 Hardware Trigger 0.
 *
 * Values:
 * - 0b0 - CMP0 output drives FTM3 hardware trigger 0
 * - 0b1 - FTM1 channel match drives FTM3 hardware trigger 0
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT4_FTM3TRG0SRC field. */
#define SIM_RD_SOPT4_FTM3TRG0SRC(base) ((SIM_SOPT4_REG(base) & SIM_SOPT4_FTM3TRG0SRC_MASK) >> SIM_SOPT4_FTM3TRG0SRC_SHIFT)
#define SIM_BRD_SOPT4_FTM3TRG0SRC(base) (BME_UBFX32(&SIM_SOPT4_REG(base), SIM_SOPT4_FTM3TRG0SRC_SHIFT, SIM_SOPT4_FTM3TRG0SRC_WIDTH))

/*! @brief Set the FTM3TRG0SRC field to a new value. */
#define SIM_WR_SOPT4_FTM3TRG0SRC(base, value) (SIM_RMW_SOPT4(base, SIM_SOPT4_FTM3TRG0SRC_MASK, SIM_SOPT4_FTM3TRG0SRC(value)))
#define SIM_BWR_SOPT4_FTM3TRG0SRC(base, value) (BME_BFI32(&SIM_SOPT4_REG(base), ((uint32_t)(value) << SIM_SOPT4_FTM3TRG0SRC_SHIFT), SIM_SOPT4_FTM3TRG0SRC_SHIFT, SIM_SOPT4_FTM3TRG0SRC_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT4, field FTM3TRG1SRC[29] (RW)
 *
 * Selects the source of FTM3 hardware trigger 1.
 *
 * Values:
 * - 0b0 - PDB1 channel 1 output trigger drives FTM3 hardware trigger 1
 * - 0b1 - FTM1 channel match drives FTM3 hardware trigger 1
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT4_FTM3TRG1SRC field. */
#define SIM_RD_SOPT4_FTM3TRG1SRC(base) ((SIM_SOPT4_REG(base) & SIM_SOPT4_FTM3TRG1SRC_MASK) >> SIM_SOPT4_FTM3TRG1SRC_SHIFT)
#define SIM_BRD_SOPT4_FTM3TRG1SRC(base) (BME_UBFX32(&SIM_SOPT4_REG(base), SIM_SOPT4_FTM3TRG1SRC_SHIFT, SIM_SOPT4_FTM3TRG1SRC_WIDTH))

/*! @brief Set the FTM3TRG1SRC field to a new value. */
#define SIM_WR_SOPT4_FTM3TRG1SRC(base, value) (SIM_RMW_SOPT4(base, SIM_SOPT4_FTM3TRG1SRC_MASK, SIM_SOPT4_FTM3TRG1SRC(value)))
#define SIM_BWR_SOPT4_FTM3TRG1SRC(base, value) (BME_BFI32(&SIM_SOPT4_REG(base), ((uint32_t)(value) << SIM_SOPT4_FTM3TRG1SRC_SHIFT), SIM_SOPT4_FTM3TRG1SRC_SHIFT, SIM_SOPT4_FTM3TRG1SRC_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT4, field FTM3TRG2SRC[30] (RW)
 *
 * Selects the source of FTM3 hardware trigger 2.
 *
 * Values:
 * - 0b0 - FTM3_FLT0 pin drives FTM3 hardware trigger 2
 * - 0b1 - XBARA output 37 drives FTM3 hardware trigger 2
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT4_FTM3TRG2SRC field. */
#define SIM_RD_SOPT4_FTM3TRG2SRC(base) ((SIM_SOPT4_REG(base) & SIM_SOPT4_FTM3TRG2SRC_MASK) >> SIM_SOPT4_FTM3TRG2SRC_SHIFT)
#define SIM_BRD_SOPT4_FTM3TRG2SRC(base) (BME_UBFX32(&SIM_SOPT4_REG(base), SIM_SOPT4_FTM3TRG2SRC_SHIFT, SIM_SOPT4_FTM3TRG2SRC_WIDTH))

/*! @brief Set the FTM3TRG2SRC field to a new value. */
#define SIM_WR_SOPT4_FTM3TRG2SRC(base, value) (SIM_RMW_SOPT4(base, SIM_SOPT4_FTM3TRG2SRC_MASK, SIM_SOPT4_FTM3TRG2SRC(value)))
#define SIM_BWR_SOPT4_FTM3TRG2SRC(base, value) (BME_BFI32(&SIM_SOPT4_REG(base), ((uint32_t)(value) << SIM_SOPT4_FTM3TRG2SRC_SHIFT), SIM_SOPT4_FTM3TRG2SRC_SHIFT, SIM_SOPT4_FTM3TRG2SRC_WIDTH))
/*@}*/

