ErichStyger/mcuoneclipse/Examples/KDS/TWR-KV58F220M/TWR_KV58F220M_PEx_2_SDKv2/SDK/platform/devices/MKV58F24/include/MKV58F24_extension.h
/*! @brief Set the HSADC0ATRGSEL field to a new value. */
#define SIM_WR_SOPT7_HSADC0ATRGSEL(base, value) (SIM_RMW_SOPT7(base, SIM_SOPT7_HSADC0ATRGSEL_MASK, SIM_SOPT7_HSADC0ATRGSEL(value)))
#define SIM_BWR_SOPT7_HSADC0ATRGSEL(base, value) (BME_BFI32(&SIM_SOPT7_REG(base), ((uint32_t)(value) << SIM_SOPT7_HSADC0ATRGSEL_SHIFT), SIM_SOPT7_HSADC0ATRGSEL_SHIFT, SIM_SOPT7_HSADC0ATRGSEL_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT7, field HSADC0AALTTRGEN[7:6] (RW)
 *
 * Enable alternative conversion triggers for HSADC0A.
 *
 * Values:
 * - 0b00 - XBARA output 12.
 * - 0b01 - PDB0 channel0 trigger selected for HSADC0A.
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT7_HSADC0AALTTRGEN field. */
#define SIM_RD_SOPT7_HSADC0AALTTRGEN(base) ((SIM_SOPT7_REG(base) & SIM_SOPT7_HSADC0AALTTRGEN_MASK) >> SIM_SOPT7_HSADC0AALTTRGEN_SHIFT)
#define SIM_BRD_SOPT7_HSADC0AALTTRGEN(base) (BME_UBFX32(&SIM_SOPT7_REG(base), SIM_SOPT7_HSADC0AALTTRGEN_SHIFT, SIM_SOPT7_HSADC0AALTTRGEN_WIDTH))

/*! @brief Set the HSADC0AALTTRGEN field to a new value. */
#define SIM_WR_SOPT7_HSADC0AALTTRGEN(base, value) (SIM_RMW_SOPT7(base, SIM_SOPT7_HSADC0AALTTRGEN_MASK, SIM_SOPT7_HSADC0AALTTRGEN(value)))
#define SIM_BWR_SOPT7_HSADC0AALTTRGEN(base, value) (BME_BFI32(&SIM_SOPT7_REG(base), ((uint32_t)(value) << SIM_SOPT7_HSADC0AALTTRGEN_SHIFT), SIM_SOPT7_HSADC0AALTTRGEN_SHIFT, SIM_SOPT7_HSADC0AALTTRGEN_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT7, field HSADC0BTRGSEL[11:8] (RW)
 *
 * Selects the HSADC0B trigger source when alternative triggers are functional
 * in stop modes.
 *
 * Values:
 * - 0b0000 - Reserved
 * - 0b0001 - High speed comparator 0 output
 * - 0b0010 - High speed comparator 1 output
 * - 0b0011 - High speed comparator 2 output
 * - 0b0100 - PIT trigger 0
 * - 0b0101 - PIT trigger 1
 * - 0b0110 - PIT trigger 2
 * - 0b0111 - PIT trigger 3
 * - 0b1000 - FTM0 trigger
 * - 0b1001 - FTM1 trigger
 * - 0b1010 - FTM2 trigger
 * - 0b1011 - FTM3 trigger
 * - 0b1100 - XBARA output 41
 * - 0b1101 - Reserved
 * - 0b1110 - Low-power timer trigger
 * - 0b1111 - Reserved
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT7_HSADC0BTRGSEL field. */
#define SIM_RD_SOPT7_HSADC0BTRGSEL(base) ((SIM_SOPT7_REG(base) & SIM_SOPT7_HSADC0BTRGSEL_MASK) >> SIM_SOPT7_HSADC0BTRGSEL_SHIFT)
#define SIM_BRD_SOPT7_HSADC0BTRGSEL(base) (BME_UBFX32(&SIM_SOPT7_REG(base), SIM_SOPT7_HSADC0BTRGSEL_SHIFT, SIM_SOPT7_HSADC0BTRGSEL_WIDTH))

/*! @brief Set the HSADC0BTRGSEL field to a new value. */
#define SIM_WR_SOPT7_HSADC0BTRGSEL(base, value) (SIM_RMW_SOPT7(base, SIM_SOPT7_HSADC0BTRGSEL_MASK, SIM_SOPT7_HSADC0BTRGSEL(value)))
#define SIM_BWR_SOPT7_HSADC0BTRGSEL(base, value) (BME_BFI32(&SIM_SOPT7_REG(base), ((uint32_t)(value) << SIM_SOPT7_HSADC0BTRGSEL_SHIFT), SIM_SOPT7_HSADC0BTRGSEL_SHIFT, SIM_SOPT7_HSADC0BTRGSEL_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT7, field HSADC0BALTTRGEN[15:14] (RW)
 *
 * Enable alternative conversion triggers for HSADC0B.
 *
 * Values:
 * - 0b00 - XBARA output 13.
 * - 0b01 - PDB1 channel0 trigger selected for HSADC0B
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT7_HSADC0BALTTRGEN field. */
#define SIM_RD_SOPT7_HSADC0BALTTRGEN(base) ((SIM_SOPT7_REG(base) & SIM_SOPT7_HSADC0BALTTRGEN_MASK) >> SIM_SOPT7_HSADC0BALTTRGEN_SHIFT)
#define SIM_BRD_SOPT7_HSADC0BALTTRGEN(base) (BME_UBFX32(&SIM_SOPT7_REG(base), SIM_SOPT7_HSADC0BALTTRGEN_SHIFT, SIM_SOPT7_HSADC0BALTTRGEN_WIDTH))

/*! @brief Set the HSADC0BALTTRGEN field to a new value. */
#define SIM_WR_SOPT7_HSADC0BALTTRGEN(base, value) (SIM_RMW_SOPT7(base, SIM_SOPT7_HSADC0BALTTRGEN_MASK, SIM_SOPT7_HSADC0BALTTRGEN(value)))
#define SIM_BWR_SOPT7_HSADC0BALTTRGEN(base, value) (BME_BFI32(&SIM_SOPT7_REG(base), ((uint32_t)(value) << SIM_SOPT7_HSADC0BALTTRGEN_SHIFT), SIM_SOPT7_HSADC0BALTTRGEN_SHIFT, SIM_SOPT7_HSADC0BALTTRGEN_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT7, field HSADC1ATRGSEL[19:16] (RW)
 *
 * Selects the HSADC1A trigger source when alternative triggers are functional
 * in stop modes.
 *
 * Values:
 * - 0b0000 - Reserved
 * - 0b0001 - High speed comparator 0 output
 * - 0b0010 - High speed comparator 1 output
 * - 0b0011 - High speed comparator 2 output
 * - 0b0100 - PIT trigger 0
 * - 0b0101 - PIT trigger 1
 * - 0b0110 - PIT trigger 2
 * - 0b0111 - PIT trigger 3
 * - 0b1000 - FTM0 trigger
 * - 0b1001 - FTM1 trigger
 * - 0b1010 - FTM2 trigger
 * - 0b1011 - FTM3 trigger
 * - 0b1100 - XBARA output 41
 * - 0b1101 - Reserved
 * - 0b1110 - Low-power timer trigger
 * - 0b1111 - Reserved
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT7_HSADC1ATRGSEL field. */
#define SIM_RD_SOPT7_HSADC1ATRGSEL(base) ((SIM_SOPT7_REG(base) & SIM_SOPT7_HSADC1ATRGSEL_MASK) >> SIM_SOPT7_HSADC1ATRGSEL_SHIFT)
#define SIM_BRD_SOPT7_HSADC1ATRGSEL(base) (BME_UBFX32(&SIM_SOPT7_REG(base), SIM_SOPT7_HSADC1ATRGSEL_SHIFT, SIM_SOPT7_HSADC1ATRGSEL_WIDTH))

/*! @brief Set the HSADC1ATRGSEL field to a new value. */
#define SIM_WR_SOPT7_HSADC1ATRGSEL(base, value) (SIM_RMW_SOPT7(base, SIM_SOPT7_HSADC1ATRGSEL_MASK, SIM_SOPT7_HSADC1ATRGSEL(value)))
#define SIM_BWR_SOPT7_HSADC1ATRGSEL(base, value) (BME_BFI32(&SIM_SOPT7_REG(base), ((uint32_t)(value) << SIM_SOPT7_HSADC1ATRGSEL_SHIFT), SIM_SOPT7_HSADC1ATRGSEL_SHIFT, SIM_SOPT7_HSADC1ATRGSEL_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT7, field HSADC1AALTTRGEN[23:22] (RW)
 *
 * Enable alternative conversion triggers for SYNCA input of HSADC1A.
 *
 * Values:
 * - 0b00 - XBARA output 42.
 * - 0b01 - PDB1 channel 1 trigger selected for HSADC1A.
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT7_HSADC1AALTTRGEN field. */
#define SIM_RD_SOPT7_HSADC1AALTTRGEN(base) ((SIM_SOPT7_REG(base) & SIM_SOPT7_HSADC1AALTTRGEN_MASK) >> SIM_SOPT7_HSADC1AALTTRGEN_SHIFT)
#define SIM_BRD_SOPT7_HSADC1AALTTRGEN(base) (BME_UBFX32(&SIM_SOPT7_REG(base), SIM_SOPT7_HSADC1AALTTRGEN_SHIFT, SIM_SOPT7_HSADC1AALTTRGEN_WIDTH))

/*! @brief Set the HSADC1AALTTRGEN field to a new value. */
#define SIM_WR_SOPT7_HSADC1AALTTRGEN(base, value) (SIM_RMW_SOPT7(base, SIM_SOPT7_HSADC1AALTTRGEN_MASK, SIM_SOPT7_HSADC1AALTTRGEN(value)))
#define SIM_BWR_SOPT7_HSADC1AALTTRGEN(base, value) (BME_BFI32(&SIM_SOPT7_REG(base), ((uint32_t)(value) << SIM_SOPT7_HSADC1AALTTRGEN_SHIFT), SIM_SOPT7_HSADC1AALTTRGEN_SHIFT, SIM_SOPT7_HSADC1AALTTRGEN_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT7, field HSADC1BTRGSEL[27:24] (RW)
 *
 * Selects the HSADC1B trigger source when alternative triggers are functional
 * in stop modes.
 *
 * Values:
 * - 0b0000 - PDB external trigger pin input (PDB0_EXTRG)
 * - 0b0001 - High speed comparator 0 output
 * - 0b0010 - High speed comparator 1 output
 * - 0b0011 - High speed comparator 2 output
 * - 0b0100 - PIT trigger 0
 * - 0b0101 - PIT trigger 1
 * - 0b0110 - PIT trigger 2
 * - 0b0111 - PIT trigger 3
 * - 0b1000 - FTM0 trigger
 * - 0b1001 - FTM1 trigger
 * - 0b1010 - FTM2 trigger
 * - 0b1011 - FTM3 trigger
 * - 0b1100 - XBARA output 38
 * - 0b1101 - Reserved
 * - 0b1110 - Low-power timer trigger
 * - 0b1111 - Reserved
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT7_HSADC1BTRGSEL field. */
#define SIM_RD_SOPT7_HSADC1BTRGSEL(base) ((SIM_SOPT7_REG(base) & SIM_SOPT7_HSADC1BTRGSEL_MASK) >> SIM_SOPT7_HSADC1BTRGSEL_SHIFT)
#define SIM_BRD_SOPT7_HSADC1BTRGSEL(base) (BME_UBFX32(&SIM_SOPT7_REG(base), SIM_SOPT7_HSADC1BTRGSEL_SHIFT, SIM_SOPT7_HSADC1BTRGSEL_WIDTH))

