ErichStyger/mcuoneclipse/Examples/KDS/TWR-KV58F220M/TWR_KV58F220M_PEx_2_SDKv2/SDK/platform/devices/MKV58F24/include/MKV58F24_extension.h
/*! @brief Set the FTM1CLKSEL field to a new value. */
#define SIM_WR_SOPT9_FTM1CLKSEL(base, value) (SIM_RMW_SOPT9(base, SIM_SOPT9_FTM1CLKSEL_MASK, SIM_SOPT9_FTM1CLKSEL(value)))
#define SIM_BWR_SOPT9_FTM1CLKSEL(base, value) (BME_BFI32(&SIM_SOPT9_REG(base), ((uint32_t)(value) << SIM_SOPT9_FTM1CLKSEL_SHIFT), SIM_SOPT9_FTM1CLKSEL_SHIFT, SIM_SOPT9_FTM1CLKSEL_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT9, field FTM2CLKSEL[29:28] (RW)
 *
 * Selects the external pin used to drive the clock to the FTM1 module. The
 * selected pin must also be configured for the FTM1 module external clock function
 * through the appropriate pin control register in the port control module.
 *
 * Values:
 * - 0b00 - FTM2 external clock driven by FTM_CLK0 pin
 * - 0b01 - FTM2 external clock driven by FTM_CLK1 pin
 * - 0b10 - FTM2 external clock driven by FTM_CLK2 pin
 * - 0b11 - Reserved
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT9_FTM2CLKSEL field. */
#define SIM_RD_SOPT9_FTM2CLKSEL(base) ((SIM_SOPT9_REG(base) & SIM_SOPT9_FTM2CLKSEL_MASK) >> SIM_SOPT9_FTM2CLKSEL_SHIFT)
#define SIM_BRD_SOPT9_FTM2CLKSEL(base) (BME_UBFX32(&SIM_SOPT9_REG(base), SIM_SOPT9_FTM2CLKSEL_SHIFT, SIM_SOPT9_FTM2CLKSEL_WIDTH))

/*! @brief Set the FTM2CLKSEL field to a new value. */
#define SIM_WR_SOPT9_FTM2CLKSEL(base, value) (SIM_RMW_SOPT9(base, SIM_SOPT9_FTM2CLKSEL_MASK, SIM_SOPT9_FTM2CLKSEL(value)))
#define SIM_BWR_SOPT9_FTM2CLKSEL(base, value) (BME_BFI32(&SIM_SOPT9_REG(base), ((uint32_t)(value) << SIM_SOPT9_FTM2CLKSEL_SHIFT), SIM_SOPT9_FTM2CLKSEL_SHIFT, SIM_SOPT9_FTM2CLKSEL_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT9, field FTM3CLKSEL[31:30] (RW)
 *
 * Selects the external pin used to drive the clock to the FTM3 module. The
 * selected pin must also be configured for the FTM3 module external clock function
 * through the appropriate pin control register in the port control module.
 *
 * Values:
 * - 0b00 - FTM3 external clock driven by FTM_CLK0 pin
 * - 0b01 - FTM3 external clock driven by FTM_CLK1 pin
 * - 0b10 - FTM3 external clock driven by FTM_CLK2 pin
 * - 0b11 - Reserved
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT9_FTM3CLKSEL field. */
#define SIM_RD_SOPT9_FTM3CLKSEL(base) ((SIM_SOPT9_REG(base) & SIM_SOPT9_FTM3CLKSEL_MASK) >> SIM_SOPT9_FTM3CLKSEL_SHIFT)
#define SIM_BRD_SOPT9_FTM3CLKSEL(base) (BME_UBFX32(&SIM_SOPT9_REG(base), SIM_SOPT9_FTM3CLKSEL_SHIFT, SIM_SOPT9_FTM3CLKSEL_WIDTH))

/*! @brief Set the FTM3CLKSEL field to a new value. */
#define SIM_WR_SOPT9_FTM3CLKSEL(base, value) (SIM_RMW_SOPT9(base, SIM_SOPT9_FTM3CLKSEL_MASK, SIM_SOPT9_FTM3CLKSEL(value)))
#define SIM_BWR_SOPT9_FTM3CLKSEL(base, value) (BME_BFI32(&SIM_SOPT9_REG(base), ((uint32_t)(value) << SIM_SOPT9_FTM3CLKSEL_SHIFT), SIM_SOPT9_FTM3CLKSEL_SHIFT, SIM_SOPT9_FTM3CLKSEL_WIDTH))
/*@}*/

/*******************************************************************************
 * SIM_SDID - System Device Identification Register
 ******************************************************************************/

/*!
 * @brief SIM_SDID - System Device Identification Register (RO)
 *
 * Reset value: 0x00600180U
 */
/*!
 * @name Constants and macros for entire SIM_SDID register
 */
/*@{*/
#define SIM_RD_SDID(base)        (SIM_SDID_REG(base))
/*@}*/

/*
 * Constants & macros for individual SIM_SDID bitfields
 */

/*!
 * @name Register SIM_SDID, field PINID[3:0] (RO)
 *
 * Specifies the pincount of the device.
 *
 * Values:
 * - 0b1000 - 100-pin
 * - 0b1001 - Reserved
 * - 0b1010 - 144-pin
 */
/*@{*/
/*! @brief Read current value of the SIM_SDID_PINID field. */
#define SIM_RD_SDID_PINID(base) ((SIM_SDID_REG(base) & SIM_SDID_PINID_MASK) >> SIM_SDID_PINID_SHIFT)
#define SIM_BRD_SDID_PINID(base) (BME_UBFX32(&SIM_SDID_REG(base), SIM_SDID_PINID_SHIFT, SIM_SDID_PINID_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SDID, field DIEID[11:7] (RO)
 *
 * Specifies the silicon implementation number for the device.
 *
 * Values:
 * - 0b00011 - KV5x
 */
/*@{*/
/*! @brief Read current value of the SIM_SDID_DIEID field. */
#define SIM_RD_SDID_DIEID(base) ((SIM_SDID_REG(base) & SIM_SDID_DIEID_MASK) >> SIM_SDID_DIEID_SHIFT)
#define SIM_BRD_SDID_DIEID(base) (BME_UBFX32(&SIM_SDID_REG(base), SIM_SDID_DIEID_SHIFT, SIM_SDID_DIEID_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SDID, field REVID[15:12] (RO)
 *
 * Specifies the silicon implementation number for the device.
 */
/*@{*/
/*! @brief Read current value of the SIM_SDID_REVID field. */
#define SIM_RD_SDID_REVID(base) ((SIM_SDID_REG(base) & SIM_SDID_REVID_MASK) >> SIM_SDID_REVID_SHIFT)
#define SIM_BRD_SDID_REVID(base) (BME_UBFX32(&SIM_SDID_REG(base), SIM_SDID_REVID_SHIFT, SIM_SDID_REVID_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SDID, field SERIESID[23:20] (RO)
 *
 * Specifies the Kinetis series of the device.
 *
 * Values:
 * - 0b0110 - Kinetis V series
 */
/*@{*/
/*! @brief Read current value of the SIM_SDID_SERIESID field. */
#define SIM_RD_SDID_SERIESID(base) ((SIM_SDID_REG(base) & SIM_SDID_SERIESID_MASK) >> SIM_SDID_SERIESID_SHIFT)
#define SIM_BRD_SDID_SERIESID(base) (BME_UBFX32(&SIM_SDID_REG(base), SIM_SDID_SERIESID_SHIFT, SIM_SDID_SERIESID_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SDID, field SUBFAMID[27:24] (RO)
 *
 * Specifies the Kinetis sub-family of the device.
 *
 * Values:
 * - 0b0110 - KVx6 Subfamily (eFlexPWM with FlexTimer and HSADC)
 * - 0b0111 - Reserved
 * - 0b1000 - KVx8 Subfamily (eFlexPWM with FlexTimer, HSADC, and Ethernet)
 */
/*@{*/
/*! @brief Read current value of the SIM_SDID_SUBFAMID field. */
#define SIM_RD_SDID_SUBFAMID(base) ((SIM_SDID_REG(base) & SIM_SDID_SUBFAMID_MASK) >> SIM_SDID_SUBFAMID_SHIFT)
#define SIM_BRD_SDID_SUBFAMID(base) (BME_UBFX32(&SIM_SDID_REG(base), SIM_SDID_SUBFAMID_SHIFT, SIM_SDID_SUBFAMID_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SDID, field FAMILYID[31:28] (RO)
 *
 * Specifies the Kinetis family of the device.
 *
 * Values:
 * - 0b0101 - This is the KV5x series
 */
/*@{*/
/*! @brief Read current value of the SIM_SDID_FAMILYID field. */
#define SIM_RD_SDID_FAMILYID(base) ((SIM_SDID_REG(base) & SIM_SDID_FAMILYID_MASK) >> SIM_SDID_FAMILYID_SHIFT)
#define SIM_BRD_SDID_FAMILYID(base) (BME_UBFX32(&SIM_SDID_REG(base), SIM_SDID_FAMILYID_SHIFT, SIM_SDID_FAMILYID_WIDTH))
/*@}*/

