ErichStyger/mcuoneclipse/Examples/KDS/TWR-KV58F220M/TWR_KV58F220M_PEx_2_SDKv2/SDK/platform/devices/MKV58F24/include/MKV58F24_extension.h
/*******************************************************************************
 * SIM_SCGC1 - System Clock Gating Control Register 1
 ******************************************************************************/

/*!
 * @brief SIM_SCGC1 - System Clock Gating Control Register 1 (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire SIM_SCGC1 register
 */
/*@{*/
#define SIM_RD_SCGC1(base)       (SIM_SCGC1_REG(base))
#define SIM_WR_SCGC1(base, value) (SIM_SCGC1_REG(base) = (value))
#define SIM_RMW_SCGC1(base, mask, value) (SIM_WR_SCGC1(base, (SIM_RD_SCGC1(base) & ~(mask)) | (value)))
#define SIM_SET_SCGC1(base, value) (BME_OR32(&SIM_SCGC1_REG(base), (uint32_t)(value)))
#define SIM_CLR_SCGC1(base, value) (BME_AND32(&SIM_SCGC1_REG(base), (uint32_t)(~(value))))
#define SIM_TOG_SCGC1(base, value) (BME_XOR32(&SIM_SCGC1_REG(base), (uint32_t)(value)))
/*@}*/

/* Unified clock gate bit access macros */
#define SIM_SCGC_BIT_REG(base, index)        (*((volatile uint32_t *)&SIM_SCGC1_REG(base) + (((uint32_t)(index) >> 5) - 0U)))
#define SIM_SCGC_BIT_SHIFT(index)            ((uint32_t)(index) & ((1U << 5) - 1U))
#define SIM_RD_SCGC_BIT(base, index)         (SIM_SCGC_BIT_REG((base), (index)) & (1U << SIM_SCGC_BIT_SHIFT(index)))
#define SIM_BRD_SCGC_BIT(base, index)        (BME_UBFX32(&SIM_SCGC_BIT_REG((base), (index)), SIM_SCGC_BIT_SHIFT(index), 1))
#define SIM_WR_SCGC_BIT(base, index, value)  (SIM_SCGC_BIT_REG((base), (index)) = (SIM_SCGC_BIT_REG((base), (index)) & ~(1U << SIM_SCGC_BIT_SHIFT(index))) | ((uint32_t)(value) << SIM_SCGC_BIT_SHIFT(index)))
#define SIM_BWR_SCGC_BIT(base, index, value) (BME_BFI32(&SIM_SCGC_BIT_REG((base), (index)), ((uint32_t)(value) << SIM_SCGC_BIT_SHIFT(index)), SIM_SCGC_BIT_SHIFT(index), 1))

/*
 * Constants & macros for individual SIM_SCGC1 bitfields
 */

/*!
 * @name Register SIM_SCGC1, field UART4[10] (RW)
 *
 * This bit controls the clock gate to the UART4 module.
 *
 * Values:
 * - 0b0 - Clock disabled
 * - 0b1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC1_UART4 field. */
#define SIM_RD_SCGC1_UART4(base) ((SIM_SCGC1_REG(base) & SIM_SCGC1_UART4_MASK) >> SIM_SCGC1_UART4_SHIFT)
#define SIM_BRD_SCGC1_UART4(base) (BME_UBFX32(&SIM_SCGC1_REG(base), SIM_SCGC1_UART4_SHIFT, SIM_SCGC1_UART4_WIDTH))

/*! @brief Set the UART4 field to a new value. */
#define SIM_WR_SCGC1_UART4(base, value) (SIM_RMW_SCGC1(base, SIM_SCGC1_UART4_MASK, SIM_SCGC1_UART4(value)))
#define SIM_BWR_SCGC1_UART4(base, value) (BME_BFI32(&SIM_SCGC1_REG(base), ((uint32_t)(value) << SIM_SCGC1_UART4_SHIFT), SIM_SCGC1_UART4_SHIFT, SIM_SCGC1_UART4_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SCGC1, field UART5[11] (RW)
 *
 * This bit controls the clock gate to the UART5 module.
 *
 * Values:
 * - 0b0 - Clock disabled
 * - 0b1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC1_UART5 field. */
#define SIM_RD_SCGC1_UART5(base) ((SIM_SCGC1_REG(base) & SIM_SCGC1_UART5_MASK) >> SIM_SCGC1_UART5_SHIFT)
#define SIM_BRD_SCGC1_UART5(base) (BME_UBFX32(&SIM_SCGC1_REG(base), SIM_SCGC1_UART5_SHIFT, SIM_SCGC1_UART5_WIDTH))

/*! @brief Set the UART5 field to a new value. */
#define SIM_WR_SCGC1_UART5(base, value) (SIM_RMW_SCGC1(base, SIM_SCGC1_UART5_MASK, SIM_SCGC1_UART5(value)))
#define SIM_BWR_SCGC1_UART5(base, value) (BME_BFI32(&SIM_SCGC1_REG(base), ((uint32_t)(value) << SIM_SCGC1_UART5_SHIFT), SIM_SCGC1_UART5_SHIFT, SIM_SCGC1_UART5_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SCGC1, field PWM1_SM0[24] (RW)
 *
 * This bit controls the clock gate to the PWM submodule 0.
 *
 * Values:
 * - 0b0 - Clock disabled
 * - 0b1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC1_PWM1_SM0 field. */
#define SIM_RD_SCGC1_PWM1_SM0(base) ((SIM_SCGC1_REG(base) & SIM_SCGC1_PWM1_SM0_MASK) >> SIM_SCGC1_PWM1_SM0_SHIFT)
#define SIM_BRD_SCGC1_PWM1_SM0(base) (BME_UBFX32(&SIM_SCGC1_REG(base), SIM_SCGC1_PWM1_SM0_SHIFT, SIM_SCGC1_PWM1_SM0_WIDTH))

/*! @brief Set the PWM1_SM0 field to a new value. */
#define SIM_WR_SCGC1_PWM1_SM0(base, value) (SIM_RMW_SCGC1(base, SIM_SCGC1_PWM1_SM0_MASK, SIM_SCGC1_PWM1_SM0(value)))
#define SIM_BWR_SCGC1_PWM1_SM0(base, value) (BME_BFI32(&SIM_SCGC1_REG(base), ((uint32_t)(value) << SIM_SCGC1_PWM1_SM0_SHIFT), SIM_SCGC1_PWM1_SM0_SHIFT, SIM_SCGC1_PWM1_SM0_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SCGC1, field PWM1_SM1[25] (RW)
 *
 * This bit controls the clock gate to the PWM submodule 1.
 *
 * Values:
 * - 0b0 - Clock disabled
 * - 0b1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC1_PWM1_SM1 field. */
#define SIM_RD_SCGC1_PWM1_SM1(base) ((SIM_SCGC1_REG(base) & SIM_SCGC1_PWM1_SM1_MASK) >> SIM_SCGC1_PWM1_SM1_SHIFT)
#define SIM_BRD_SCGC1_PWM1_SM1(base) (BME_UBFX32(&SIM_SCGC1_REG(base), SIM_SCGC1_PWM1_SM1_SHIFT, SIM_SCGC1_PWM1_SM1_WIDTH))

/*! @brief Set the PWM1_SM1 field to a new value. */
#define SIM_WR_SCGC1_PWM1_SM1(base, value) (SIM_RMW_SCGC1(base, SIM_SCGC1_PWM1_SM1_MASK, SIM_SCGC1_PWM1_SM1(value)))
#define SIM_BWR_SCGC1_PWM1_SM1(base, value) (BME_BFI32(&SIM_SCGC1_REG(base), ((uint32_t)(value) << SIM_SCGC1_PWM1_SM1_SHIFT), SIM_SCGC1_PWM1_SM1_SHIFT, SIM_SCGC1_PWM1_SM1_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SCGC1, field PWM1_SM2[26] (RW)
 *
 * This bit controls the clock gate to the PWM submodule 2.
 *
 * Values:
 * - 0b0 - Clock disabled
 * - 0b1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC1_PWM1_SM2 field. */
#define SIM_RD_SCGC1_PWM1_SM2(base) ((SIM_SCGC1_REG(base) & SIM_SCGC1_PWM1_SM2_MASK) >> SIM_SCGC1_PWM1_SM2_SHIFT)
#define SIM_BRD_SCGC1_PWM1_SM2(base) (BME_UBFX32(&SIM_SCGC1_REG(base), SIM_SCGC1_PWM1_SM2_SHIFT, SIM_SCGC1_PWM1_SM2_WIDTH))

/*! @brief Set the PWM1_SM2 field to a new value. */
#define SIM_WR_SCGC1_PWM1_SM2(base, value) (SIM_RMW_SCGC1(base, SIM_SCGC1_PWM1_SM2_MASK, SIM_SCGC1_PWM1_SM2(value)))
#define SIM_BWR_SCGC1_PWM1_SM2(base, value) (BME_BFI32(&SIM_SCGC1_REG(base), ((uint32_t)(value) << SIM_SCGC1_PWM1_SM2_SHIFT), SIM_SCGC1_PWM1_SM2_SHIFT, SIM_SCGC1_PWM1_SM2_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SCGC1, field PWM1_SM3[27] (RW)
 *
 * This bit controls the clock gate to the PWM submodule 3.
 *
 * Values:
 * - 0b0 - Clock disabled
 * - 0b1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC1_PWM1_SM3 field. */
#define SIM_RD_SCGC1_PWM1_SM3(base) ((SIM_SCGC1_REG(base) & SIM_SCGC1_PWM1_SM3_MASK) >> SIM_SCGC1_PWM1_SM3_SHIFT)
#define SIM_BRD_SCGC1_PWM1_SM3(base) (BME_UBFX32(&SIM_SCGC1_REG(base), SIM_SCGC1_PWM1_SM3_SHIFT, SIM_SCGC1_PWM1_SM3_WIDTH))

