ErichStyger/mcuoneclipse/Examples/KDS/TWR-KV58F220M/TWR_KV58F220M_PEx_2_SDKv2/SDK/platform/devices/MKV58F24/include/MKV58F24_extension.h
/*! @brief Set the CMP field to a new value. */
#define SIM_WR_SCGC4_CMP(base, value) (SIM_RMW_SCGC4(base, SIM_SCGC4_CMP_MASK, SIM_SCGC4_CMP(value)))
#define SIM_BWR_SCGC4_CMP(base, value) (BME_BFI32(&SIM_SCGC4_REG(base), ((uint32_t)(value) << SIM_SCGC4_CMP_SHIFT), SIM_SCGC4_CMP_SHIFT, SIM_SCGC4_CMP_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SCGC4, field PWM0_SM0[24] (RW)
 *
 * This bit controls the clock gate to the PWM submodule 0.
 *
 * Values:
 * - 0b0 - Clock disabled
 * - 0b1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC4_PWM0_SM0 field. */
#define SIM_RD_SCGC4_PWM0_SM0(base) ((SIM_SCGC4_REG(base) & SIM_SCGC4_PWM0_SM0_MASK) >> SIM_SCGC4_PWM0_SM0_SHIFT)
#define SIM_BRD_SCGC4_PWM0_SM0(base) (BME_UBFX32(&SIM_SCGC4_REG(base), SIM_SCGC4_PWM0_SM0_SHIFT, SIM_SCGC4_PWM0_SM0_WIDTH))

/*! @brief Set the PWM0_SM0 field to a new value. */
#define SIM_WR_SCGC4_PWM0_SM0(base, value) (SIM_RMW_SCGC4(base, SIM_SCGC4_PWM0_SM0_MASK, SIM_SCGC4_PWM0_SM0(value)))
#define SIM_BWR_SCGC4_PWM0_SM0(base, value) (BME_BFI32(&SIM_SCGC4_REG(base), ((uint32_t)(value) << SIM_SCGC4_PWM0_SM0_SHIFT), SIM_SCGC4_PWM0_SM0_SHIFT, SIM_SCGC4_PWM0_SM0_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SCGC4, field PWM0_SM1[25] (RW)
 *
 * This bit controls the clock gate to the PWM submodule 1.
 *
 * Values:
 * - 0b0 - Clock disabled
 * - 0b1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC4_PWM0_SM1 field. */
#define SIM_RD_SCGC4_PWM0_SM1(base) ((SIM_SCGC4_REG(base) & SIM_SCGC4_PWM0_SM1_MASK) >> SIM_SCGC4_PWM0_SM1_SHIFT)
#define SIM_BRD_SCGC4_PWM0_SM1(base) (BME_UBFX32(&SIM_SCGC4_REG(base), SIM_SCGC4_PWM0_SM1_SHIFT, SIM_SCGC4_PWM0_SM1_WIDTH))

/*! @brief Set the PWM0_SM1 field to a new value. */
#define SIM_WR_SCGC4_PWM0_SM1(base, value) (SIM_RMW_SCGC4(base, SIM_SCGC4_PWM0_SM1_MASK, SIM_SCGC4_PWM0_SM1(value)))
#define SIM_BWR_SCGC4_PWM0_SM1(base, value) (BME_BFI32(&SIM_SCGC4_REG(base), ((uint32_t)(value) << SIM_SCGC4_PWM0_SM1_SHIFT), SIM_SCGC4_PWM0_SM1_SHIFT, SIM_SCGC4_PWM0_SM1_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SCGC4, field PWM0_SM2[26] (RW)
 *
 * This bit controls the clock gate to the PWM submodule 2.
 *
 * Values:
 * - 0b0 - Clock disabled
 * - 0b1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC4_PWM0_SM2 field. */
#define SIM_RD_SCGC4_PWM0_SM2(base) ((SIM_SCGC4_REG(base) & SIM_SCGC4_PWM0_SM2_MASK) >> SIM_SCGC4_PWM0_SM2_SHIFT)
#define SIM_BRD_SCGC4_PWM0_SM2(base) (BME_UBFX32(&SIM_SCGC4_REG(base), SIM_SCGC4_PWM0_SM2_SHIFT, SIM_SCGC4_PWM0_SM2_WIDTH))

/*! @brief Set the PWM0_SM2 field to a new value. */
#define SIM_WR_SCGC4_PWM0_SM2(base, value) (SIM_RMW_SCGC4(base, SIM_SCGC4_PWM0_SM2_MASK, SIM_SCGC4_PWM0_SM2(value)))
#define SIM_BWR_SCGC4_PWM0_SM2(base, value) (BME_BFI32(&SIM_SCGC4_REG(base), ((uint32_t)(value) << SIM_SCGC4_PWM0_SM2_SHIFT), SIM_SCGC4_PWM0_SM2_SHIFT, SIM_SCGC4_PWM0_SM2_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SCGC4, field PWM0_SM3[27] (RW)
 *
 * This bit controls the clock gate to the PWM submodule 3.
 *
 * Values:
 * - 0b0 - Clock disabled
 * - 0b1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC4_PWM0_SM3 field. */
#define SIM_RD_SCGC4_PWM0_SM3(base) ((SIM_SCGC4_REG(base) & SIM_SCGC4_PWM0_SM3_MASK) >> SIM_SCGC4_PWM0_SM3_SHIFT)
#define SIM_BRD_SCGC4_PWM0_SM3(base) (BME_UBFX32(&SIM_SCGC4_REG(base), SIM_SCGC4_PWM0_SM3_SHIFT, SIM_SCGC4_PWM0_SM3_WIDTH))

/*! @brief Set the PWM0_SM3 field to a new value. */
#define SIM_WR_SCGC4_PWM0_SM3(base, value) (SIM_RMW_SCGC4(base, SIM_SCGC4_PWM0_SM3_MASK, SIM_SCGC4_PWM0_SM3(value)))
#define SIM_BWR_SCGC4_PWM0_SM3(base, value) (BME_BFI32(&SIM_SCGC4_REG(base), ((uint32_t)(value) << SIM_SCGC4_PWM0_SM3_SHIFT), SIM_SCGC4_PWM0_SM3_SHIFT, SIM_SCGC4_PWM0_SM3_WIDTH))
/*@}*/

/*******************************************************************************
 * SIM_SCGC5 - System Clock Gating Control Register 5
 ******************************************************************************/

/*!
 * @brief SIM_SCGC5 - System Clock Gating Control Register 5 (RW)
 *
 * Reset value: 0x00040182U
 */
/*!
 * @name Constants and macros for entire SIM_SCGC5 register
 */
/*@{*/
#define SIM_RD_SCGC5(base)       (SIM_SCGC5_REG(base))
#define SIM_WR_SCGC5(base, value) (SIM_SCGC5_REG(base) = (value))
#define SIM_RMW_SCGC5(base, mask, value) (SIM_WR_SCGC5(base, (SIM_RD_SCGC5(base) & ~(mask)) | (value)))
#define SIM_SET_SCGC5(base, value) (BME_OR32(&SIM_SCGC5_REG(base), (uint32_t)(value)))
#define SIM_CLR_SCGC5(base, value) (BME_AND32(&SIM_SCGC5_REG(base), (uint32_t)(~(value))))
#define SIM_TOG_SCGC5(base, value) (BME_XOR32(&SIM_SCGC5_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual SIM_SCGC5 bitfields
 */

/*!
 * @name Register SIM_SCGC5, field LPTMR[0] (RW)
 *
 * This bit controls software access to the Low Power Timer module.
 *
 * Values:
 * - 0b0 - Access disabled
 * - 0b1 - Access enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC5_LPTMR field. */
#define SIM_RD_SCGC5_LPTMR(base) ((SIM_SCGC5_REG(base) & SIM_SCGC5_LPTMR_MASK) >> SIM_SCGC5_LPTMR_SHIFT)
#define SIM_BRD_SCGC5_LPTMR(base) (BME_UBFX32(&SIM_SCGC5_REG(base), SIM_SCGC5_LPTMR_SHIFT, SIM_SCGC5_LPTMR_WIDTH))

/*! @brief Set the LPTMR field to a new value. */
#define SIM_WR_SCGC5_LPTMR(base, value) (SIM_RMW_SCGC5(base, SIM_SCGC5_LPTMR_MASK, SIM_SCGC5_LPTMR(value)))
#define SIM_BWR_SCGC5_LPTMR(base, value) (BME_BFI32(&SIM_SCGC5_REG(base), ((uint32_t)(value) << SIM_SCGC5_LPTMR_SHIFT), SIM_SCGC5_LPTMR_SHIFT, SIM_SCGC5_LPTMR_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SCGC5, field PORTA[9] (RW)
 *
 * This bit controls the clock gate to the Port A module.
 *
 * Values:
 * - 0b0 - Clock disabled
 * - 0b1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC5_PORTA field. */
#define SIM_RD_SCGC5_PORTA(base) ((SIM_SCGC5_REG(base) & SIM_SCGC5_PORTA_MASK) >> SIM_SCGC5_PORTA_SHIFT)
#define SIM_BRD_SCGC5_PORTA(base) (BME_UBFX32(&SIM_SCGC5_REG(base), SIM_SCGC5_PORTA_SHIFT, SIM_SCGC5_PORTA_WIDTH))

/*! @brief Set the PORTA field to a new value. */
#define SIM_WR_SCGC5_PORTA(base, value) (SIM_RMW_SCGC5(base, SIM_SCGC5_PORTA_MASK, SIM_SCGC5_PORTA(value)))
#define SIM_BWR_SCGC5_PORTA(base, value) (BME_BFI32(&SIM_SCGC5_REG(base), ((uint32_t)(value) << SIM_SCGC5_PORTA_SHIFT), SIM_SCGC5_PORTA_SHIFT, SIM_SCGC5_PORTA_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SCGC5, field PORTB[10] (RW)
 *
 * This bit controls the clock gate to the Port B module.
 *
 * Values:
 * - 0b0 - Clock disabled
 * - 0b1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC5_PORTB field. */
#define SIM_RD_SCGC5_PORTB(base) ((SIM_SCGC5_REG(base) & SIM_SCGC5_PORTB_MASK) >> SIM_SCGC5_PORTB_SHIFT)
#define SIM_BRD_SCGC5_PORTB(base) (BME_UBFX32(&SIM_SCGC5_REG(base), SIM_SCGC5_PORTB_SHIFT, SIM_SCGC5_PORTB_WIDTH))

/*! @brief Set the PORTB field to a new value. */
#define SIM_WR_SCGC5_PORTB(base, value) (SIM_RMW_SCGC5(base, SIM_SCGC5_PORTB_MASK, SIM_SCGC5_PORTB(value)))
#define SIM_BWR_SCGC5_PORTB(base, value) (BME_BFI32(&SIM_SCGC5_REG(base), ((uint32_t)(value) << SIM_SCGC5_PORTB_SHIFT), SIM_SCGC5_PORTB_SHIFT, SIM_SCGC5_PORTB_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SCGC5, field PORTC[11] (RW)
 *
 * This bit controls the clock gate to the Port C module.
 *
 * Values:
 * - 0b0 - Clock disabled
 * - 0b1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC5_PORTC field. */
#define SIM_RD_SCGC5_PORTC(base) ((SIM_SCGC5_REG(base) & SIM_SCGC5_PORTC_MASK) >> SIM_SCGC5_PORTC_SHIFT)
#define SIM_BRD_SCGC5_PORTC(base) (BME_UBFX32(&SIM_SCGC5_REG(base), SIM_SCGC5_PORTC_SHIFT, SIM_SCGC5_PORTC_WIDTH))

