ErichStyger/mcuoneclipse/Examples/KDS/TWR-KV58F220M/TWR_KV58F220M_PEx_2_SDKv2/SDK/platform/devices/MKV58F24/include/MKV58F24_extension.h
/*******************************************************************************
 * SIM_UIDML - Unique Identification Register Mid Low
 ******************************************************************************/

/*!
 * @brief SIM_UIDML - Unique Identification Register Mid Low (RO)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire SIM_UIDML register
 */
/*@{*/
#define SIM_RD_UIDML(base)       (SIM_UIDML_REG(base))
/*@}*/

/*******************************************************************************
 * SIM_UIDL - Unique Identification Register Low
 ******************************************************************************/

/*!
 * @brief SIM_UIDL - Unique Identification Register Low (RO)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire SIM_UIDL register
 */
/*@{*/
#define SIM_RD_UIDL(base)        (SIM_UIDL_REG(base))
/*@}*/

/*******************************************************************************
 * SIM_CLKDIV4 - System Clock Divider Register 4
 ******************************************************************************/

/*!
 * @brief SIM_CLKDIV4 - System Clock Divider Register 4 (RW)
 *
 * Reset value: 0x10000000U
 */
/*!
 * @name Constants and macros for entire SIM_CLKDIV4 register
 */
/*@{*/
#define SIM_RD_CLKDIV4(base)     (SIM_CLKDIV4_REG(base))
#define SIM_WR_CLKDIV4(base, value) (SIM_CLKDIV4_REG(base) = (value))
#define SIM_RMW_CLKDIV4(base, mask, value) (SIM_WR_CLKDIV4(base, (SIM_RD_CLKDIV4(base) & ~(mask)) | (value)))
#define SIM_SET_CLKDIV4(base, value) (BME_OR32(&SIM_CLKDIV4_REG(base), (uint32_t)(value)))
#define SIM_CLR_CLKDIV4(base, value) (BME_AND32(&SIM_CLKDIV4_REG(base), (uint32_t)(~(value))))
#define SIM_TOG_CLKDIV4(base, value) (BME_XOR32(&SIM_CLKDIV4_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual SIM_CLKDIV4 bitfields
 */

/*!
 * @name Register SIM_CLKDIV4, field TRACEFRAC[0] (RW)
 *
 * This field sets the divide value for the fractional clock divider used as a
 * source for trace clock. The source clock for the fractional clock divider is
 * set by the SOPT2 TRACECLKSEL register bit. Divider output clock = Divider input
 * clock*((TRACEFRAC+1)/(TRACEDIV+1))
 */
/*@{*/
/*! @brief Read current value of the SIM_CLKDIV4_TRACEFRAC field. */
#define SIM_RD_CLKDIV4_TRACEFRAC(base) ((SIM_CLKDIV4_REG(base) & SIM_CLKDIV4_TRACEFRAC_MASK) >> SIM_CLKDIV4_TRACEFRAC_SHIFT)
#define SIM_BRD_CLKDIV4_TRACEFRAC(base) (BME_UBFX32(&SIM_CLKDIV4_REG(base), SIM_CLKDIV4_TRACEFRAC_SHIFT, SIM_CLKDIV4_TRACEFRAC_WIDTH))

/*! @brief Set the TRACEFRAC field to a new value. */
#define SIM_WR_CLKDIV4_TRACEFRAC(base, value) (SIM_RMW_CLKDIV4(base, SIM_CLKDIV4_TRACEFRAC_MASK, SIM_CLKDIV4_TRACEFRAC(value)))
#define SIM_BWR_CLKDIV4_TRACEFRAC(base, value) (BME_BFI32(&SIM_CLKDIV4_REG(base), ((uint32_t)(value) << SIM_CLKDIV4_TRACEFRAC_SHIFT), SIM_CLKDIV4_TRACEFRAC_SHIFT, SIM_CLKDIV4_TRACEFRAC_WIDTH))
/*@}*/

/*!
 * @name Register SIM_CLKDIV4, field TRACEDIV[3:1] (RW)
 *
 * This field sets the divide value for the fractional clock divider used as a
 * source for trace clock. The source clock for the fractional clock divider is
 * set by the SOPT2 TRACECLKSEL register bit. Divider output clock = Divider input
 * clock * ((TRACEFRAC+1)/(TRACEDIV+1))
 */
/*@{*/
/*! @brief Read current value of the SIM_CLKDIV4_TRACEDIV field. */
#define SIM_RD_CLKDIV4_TRACEDIV(base) ((SIM_CLKDIV4_REG(base) & SIM_CLKDIV4_TRACEDIV_MASK) >> SIM_CLKDIV4_TRACEDIV_SHIFT)
#define SIM_BRD_CLKDIV4_TRACEDIV(base) (BME_UBFX32(&SIM_CLKDIV4_REG(base), SIM_CLKDIV4_TRACEDIV_SHIFT, SIM_CLKDIV4_TRACEDIV_WIDTH))

/*! @brief Set the TRACEDIV field to a new value. */
#define SIM_WR_CLKDIV4_TRACEDIV(base, value) (SIM_RMW_CLKDIV4(base, SIM_CLKDIV4_TRACEDIV_MASK, SIM_CLKDIV4_TRACEDIV(value)))
#define SIM_BWR_CLKDIV4_TRACEDIV(base, value) (BME_BFI32(&SIM_CLKDIV4_REG(base), ((uint32_t)(value) << SIM_CLKDIV4_TRACEDIV_SHIFT), SIM_CLKDIV4_TRACEDIV_SHIFT, SIM_CLKDIV4_TRACEDIV_WIDTH))
/*@}*/

/*!
 * @name Register SIM_CLKDIV4, field TRACEDIVEN[28] (RW)
 *
 * This bit controls the Debug Trace Divider.
 *
 * Values:
 * - 0b0 - Debug trace divider disabled
 * - 0b1 - Debug trace divider enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_CLKDIV4_TRACEDIVEN field. */
#define SIM_RD_CLKDIV4_TRACEDIVEN(base) ((SIM_CLKDIV4_REG(base) & SIM_CLKDIV4_TRACEDIVEN_MASK) >> SIM_CLKDIV4_TRACEDIVEN_SHIFT)
#define SIM_BRD_CLKDIV4_TRACEDIVEN(base) (BME_UBFX32(&SIM_CLKDIV4_REG(base), SIM_CLKDIV4_TRACEDIVEN_SHIFT, SIM_CLKDIV4_TRACEDIVEN_WIDTH))

/*! @brief Set the TRACEDIVEN field to a new value. */
#define SIM_WR_CLKDIV4_TRACEDIVEN(base, value) (SIM_RMW_CLKDIV4(base, SIM_CLKDIV4_TRACEDIVEN_MASK, SIM_CLKDIV4_TRACEDIVEN(value)))
#define SIM_BWR_CLKDIV4_TRACEDIVEN(base, value) (BME_BFI32(&SIM_CLKDIV4_REG(base), ((uint32_t)(value) << SIM_CLKDIV4_TRACEDIVEN_SHIFT), SIM_CLKDIV4_TRACEDIVEN_SHIFT, SIM_CLKDIV4_TRACEDIVEN_WIDTH))
/*@}*/

/*******************************************************************************
 * SIM_MISCTRL0 - Miscellaneous Control Register 0
 ******************************************************************************/

/*!
 * @brief SIM_MISCTRL0 - Miscellaneous Control Register 0 (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire SIM_MISCTRL0 register
 */
/*@{*/
#define SIM_RD_MISCTRL0(base)    (SIM_MISCTRL0_REG(base))
#define SIM_WR_MISCTRL0(base, value) (SIM_MISCTRL0_REG(base) = (value))
#define SIM_RMW_MISCTRL0(base, mask, value) (SIM_WR_MISCTRL0(base, (SIM_RD_MISCTRL0(base) & ~(mask)) | (value)))
#define SIM_SET_MISCTRL0(base, value) (BME_OR32(&SIM_MISCTRL0_REG(base), (uint32_t)(value)))
#define SIM_CLR_MISCTRL0(base, value) (BME_AND32(&SIM_MISCTRL0_REG(base), (uint32_t)(~(value))))
#define SIM_TOG_MISCTRL0(base, value) (BME_XOR32(&SIM_MISCTRL0_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual SIM_MISCTRL0 bitfields
 */

/*!
 * @name Register SIM_MISCTRL0, field CMPWIN0SRC[9:8] (RW)
 *
 * Values:
 * - 0b00 - XBARA output 16.
 * - 0b01 - CMP0 Sample/Window input is driven by both PDB0 and PDB1 pluse-out
 *     channel 0.
 * - 0b10 - PDB0 pluse-out channel 0.
 * - 0b11 - PDB1 pluse-out channel 0.
 */
/*@{*/
/*! @brief Read current value of the SIM_MISCTRL0_CMPWIN0SRC field. */
#define SIM_RD_MISCTRL0_CMPWIN0SRC(base) ((SIM_MISCTRL0_REG(base) & SIM_MISCTRL0_CMPWIN0SRC_MASK) >> SIM_MISCTRL0_CMPWIN0SRC_SHIFT)
#define SIM_BRD_MISCTRL0_CMPWIN0SRC(base) (BME_UBFX32(&SIM_MISCTRL0_REG(base), SIM_MISCTRL0_CMPWIN0SRC_SHIFT, SIM_MISCTRL0_CMPWIN0SRC_WIDTH))

/*! @brief Set the CMPWIN0SRC field to a new value. */
#define SIM_WR_MISCTRL0_CMPWIN0SRC(base, value) (SIM_RMW_MISCTRL0(base, SIM_MISCTRL0_CMPWIN0SRC_MASK, SIM_MISCTRL0_CMPWIN0SRC(value)))
#define SIM_BWR_MISCTRL0_CMPWIN0SRC(base, value) (BME_BFI32(&SIM_MISCTRL0_REG(base), ((uint32_t)(value) << SIM_MISCTRL0_CMPWIN0SRC_SHIFT), SIM_MISCTRL0_CMPWIN0SRC_SHIFT, SIM_MISCTRL0_CMPWIN0SRC_WIDTH))
/*@}*/

/*!
 * @name Register SIM_MISCTRL0, field CMPWIN1SRC[11:10] (RW)
 *
 * Values:
 * - 0b00 - XBARA output 17.
 * - 0b01 - CMP1 Sample/Window input is driven by both PDB0 and PDB1 pluse-out
 *     channel 1.
 * - 0b10 - PDB0 pluse-out channel 1.
 * - 0b11 - PDB1 pluse-out channel 1.
 */
/*@{*/
/*! @brief Read current value of the SIM_MISCTRL0_CMPWIN1SRC field. */
#define SIM_RD_MISCTRL0_CMPWIN1SRC(base) ((SIM_MISCTRL0_REG(base) & SIM_MISCTRL0_CMPWIN1SRC_MASK) >> SIM_MISCTRL0_CMPWIN1SRC_SHIFT)
#define SIM_BRD_MISCTRL0_CMPWIN1SRC(base) (BME_UBFX32(&SIM_MISCTRL0_REG(base), SIM_MISCTRL0_CMPWIN1SRC_SHIFT, SIM_MISCTRL0_CMPWIN1SRC_WIDTH))

/*! @brief Set the CMPWIN1SRC field to a new value. */
#define SIM_WR_MISCTRL0_CMPWIN1SRC(base, value) (SIM_RMW_MISCTRL0(base, SIM_MISCTRL0_CMPWIN1SRC_MASK, SIM_MISCTRL0_CMPWIN1SRC(value)))
#define SIM_BWR_MISCTRL0_CMPWIN1SRC(base, value) (BME_BFI32(&SIM_MISCTRL0_REG(base), ((uint32_t)(value) << SIM_MISCTRL0_CMPWIN1SRC_SHIFT), SIM_MISCTRL0_CMPWIN1SRC_SHIFT, SIM_MISCTRL0_CMPWIN1SRC_WIDTH))
/*@}*/

/*!
 * @name Register SIM_MISCTRL0, field CMPWIN2SRC[13:12] (RW)
 *
 * Values:
 * - 0b00 - XBARA output 18.
 * - 0b01 - CMP2 Sample/Window input is driven by both PDB0 and PDB1 pluse-out
 *     channel 2.
 * - 0b10 - PDB0 pluse-out channel 2.
 * - 0b11 - PDB1 pluse-out channel 2.
 */
/*@{*/
/*! @brief Read current value of the SIM_MISCTRL0_CMPWIN2SRC field. */
#define SIM_RD_MISCTRL0_CMPWIN2SRC(base) ((SIM_MISCTRL0_REG(base) & SIM_MISCTRL0_CMPWIN2SRC_MASK) >> SIM_MISCTRL0_CMPWIN2SRC_SHIFT)
#define SIM_BRD_MISCTRL0_CMPWIN2SRC(base) (BME_UBFX32(&SIM_MISCTRL0_REG(base), SIM_MISCTRL0_CMPWIN2SRC_SHIFT, SIM_MISCTRL0_CMPWIN2SRC_WIDTH))

/*! @brief Set the CMPWIN2SRC field to a new value. */
#define SIM_WR_MISCTRL0_CMPWIN2SRC(base, value) (SIM_RMW_MISCTRL0(base, SIM_MISCTRL0_CMPWIN2SRC_MASK, SIM_MISCTRL0_CMPWIN2SRC(value)))
#define SIM_BWR_MISCTRL0_CMPWIN2SRC(base, value) (BME_BFI32(&SIM_MISCTRL0_REG(base), ((uint32_t)(value) << SIM_MISCTRL0_CMPWIN2SRC_SHIFT), SIM_MISCTRL0_CMPWIN2SRC_SHIFT, SIM_MISCTRL0_CMPWIN2SRC_WIDTH))
/*@}*/

/*!
 * @name Register SIM_MISCTRL0, field CMPWIN3SRC[15:14] (RW)
 *
 * Values:
 * - 0b00 - XBARA output 19.
 * - 0b01 - CMP3 Sample/Window input is driven by both PDB0 and PDB1 pluse-out
 *     channel 3.
 * - 0b10 - PDB0 pluse-out channel 3.
 * - 0b11 - PDB1 pluse-out channel 3.
 */
/*@{*/
/*! @brief Read current value of the SIM_MISCTRL0_CMPWIN3SRC field. */
#define SIM_RD_MISCTRL0_CMPWIN3SRC(base) ((SIM_MISCTRL0_REG(base) & SIM_MISCTRL0_CMPWIN3SRC_MASK) >> SIM_MISCTRL0_CMPWIN3SRC_SHIFT)
#define SIM_BRD_MISCTRL0_CMPWIN3SRC(base) (BME_UBFX32(&SIM_MISCTRL0_REG(base), SIM_MISCTRL0_CMPWIN3SRC_SHIFT, SIM_MISCTRL0_CMPWIN3SRC_WIDTH))

/*! @brief Set the CMPWIN3SRC field to a new value. */
#define SIM_WR_MISCTRL0_CMPWIN3SRC(base, value) (SIM_RMW_MISCTRL0(base, SIM_MISCTRL0_CMPWIN3SRC_MASK, SIM_MISCTRL0_CMPWIN3SRC(value)))
#define SIM_BWR_MISCTRL0_CMPWIN3SRC(base, value) (BME_BFI32(&SIM_MISCTRL0_REG(base), ((uint32_t)(value) << SIM_MISCTRL0_CMPWIN3SRC_SHIFT), SIM_MISCTRL0_CMPWIN3SRC_SHIFT, SIM_MISCTRL0_CMPWIN3SRC_WIDTH))
/*@}*/

/*!
 * @name Register SIM_MISCTRL0, field EWMINSRC[16] (RW)
 *
 * This bit controls the ewm_in source of EWM module.
 *
 * Values:
 * - 0b0 - XBARA output 58.
 * - 0b1 - EWM_IN pin
 */
/*@{*/
/*! @brief Read current value of the SIM_MISCTRL0_EWMINSRC field. */
#define SIM_RD_MISCTRL0_EWMINSRC(base) ((SIM_MISCTRL0_REG(base) & SIM_MISCTRL0_EWMINSRC_MASK) >> SIM_MISCTRL0_EWMINSRC_SHIFT)
#define SIM_BRD_MISCTRL0_EWMINSRC(base) (BME_UBFX32(&SIM_MISCTRL0_REG(base), SIM_MISCTRL0_EWMINSRC_SHIFT, SIM_MISCTRL0_EWMINSRC_WIDTH))

/*! @brief Set the EWMINSRC field to a new value. */
#define SIM_WR_MISCTRL0_EWMINSRC(base, value) (SIM_RMW_MISCTRL0(base, SIM_MISCTRL0_EWMINSRC_MASK, SIM_MISCTRL0_EWMINSRC(value)))
#define SIM_BWR_MISCTRL0_EWMINSRC(base, value) (BME_BFI32(&SIM_MISCTRL0_REG(base), ((uint32_t)(value) << SIM_MISCTRL0_EWMINSRC_SHIFT), SIM_MISCTRL0_EWMINSRC_SHIFT, SIM_MISCTRL0_EWMINSRC_WIDTH))
/*@}*/

/*!
 * @name Register SIM_MISCTRL0, field DACTRIGSRC[19:18] (RW)
 *
 * Values:
 * - 0b00 - XBARA output 15.
 * - 0b01 - DAC0 can be triggered by both PDB0 interval trigger 0 and PDB1
 *     interval trigger 0.
 * - 0b10 - PDB0 interval trigger 0
 * - 0b11 - PDB1 interval trigger 0
 */
/*@{*/
/*! @brief Read current value of the SIM_MISCTRL0_DACTRIGSRC field. */
#define SIM_RD_MISCTRL0_DACTRIGSRC(base) ((SIM_MISCTRL0_REG(base) & SIM_MISCTRL0_DACTRIGSRC_MASK) >> SIM_MISCTRL0_DACTRIGSRC_SHIFT)
#define SIM_BRD_MISCTRL0_DACTRIGSRC(base) (BME_UBFX32(&SIM_MISCTRL0_REG(base), SIM_MISCTRL0_DACTRIGSRC_SHIFT, SIM_MISCTRL0_DACTRIGSRC_WIDTH))

/*! @brief Set the DACTRIGSRC field to a new value. */
#define SIM_WR_MISCTRL0_DACTRIGSRC(base, value) (SIM_RMW_MISCTRL0(base, SIM_MISCTRL0_DACTRIGSRC_MASK, SIM_MISCTRL0_DACTRIGSRC(value)))
#define SIM_BWR_MISCTRL0_DACTRIGSRC(base, value) (BME_BFI32(&SIM_MISCTRL0_REG(base), ((uint32_t)(value) << SIM_MISCTRL0_DACTRIGSRC_SHIFT), SIM_MISCTRL0_DACTRIGSRC_SHIFT, SIM_MISCTRL0_DACTRIGSRC_WIDTH))
/*@}*/

