ErichStyger/mcuoneclipse/Examples/KDS/TWR-KV58F220M/TWR_KV58F220M_PEx_2_SDKv2/SDK/platform/devices/MKV58F24/include/MKV58F24_extension.h
/*******************************************************************************
 * SIM_MISCTRL1 - Miscellaneous Control Register 1
 ******************************************************************************/

/*!
 * @brief SIM_MISCTRL1 - Miscellaneous Control Register 1 (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire SIM_MISCTRL1 register
 */
/*@{*/
#define SIM_RD_MISCTRL1(base)    (SIM_MISCTRL1_REG(base))
#define SIM_WR_MISCTRL1(base, value) (SIM_MISCTRL1_REG(base) = (value))
#define SIM_RMW_MISCTRL1(base, mask, value) (SIM_WR_MISCTRL1(base, (SIM_RD_MISCTRL1(base) & ~(mask)) | (value)))
#define SIM_SET_MISCTRL1(base, value) (BME_OR32(&SIM_MISCTRL1_REG(base), (uint32_t)(value)))
#define SIM_CLR_MISCTRL1(base, value) (BME_AND32(&SIM_MISCTRL1_REG(base), (uint32_t)(~(value))))
#define SIM_TOG_MISCTRL1(base, value) (BME_XOR32(&SIM_MISCTRL1_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual SIM_MISCTRL1 bitfields
 */

/*!
 * @name Register SIM_MISCTRL1, field SYNCXBARAPITTRIG0[8] (RW)
 *
 * This field controls the synchronizer between PIT trigger 0 and XBARA's input.
 * Set this bit if the XBARA's input PIT trigger 0 is fed into fast peripherials
 * through xbar.
 *
 * Values:
 * - 0b0 - Disable, bypass synchronizer.
 * - 0b1 - Enable.
 */
/*@{*/
/*! @brief Read current value of the SIM_MISCTRL1_SYNCXBARAPITTRIG0 field. */
#define SIM_RD_MISCTRL1_SYNCXBARAPITTRIG0(base) ((SIM_MISCTRL1_REG(base) & SIM_MISCTRL1_SYNCXBARAPITTRIG0_MASK) >> SIM_MISCTRL1_SYNCXBARAPITTRIG0_SHIFT)
#define SIM_BRD_MISCTRL1_SYNCXBARAPITTRIG0(base) (BME_UBFX32(&SIM_MISCTRL1_REG(base), SIM_MISCTRL1_SYNCXBARAPITTRIG0_SHIFT, SIM_MISCTRL1_SYNCXBARAPITTRIG0_WIDTH))

/*! @brief Set the SYNCXBARAPITTRIG0 field to a new value. */
#define SIM_WR_MISCTRL1_SYNCXBARAPITTRIG0(base, value) (SIM_RMW_MISCTRL1(base, SIM_MISCTRL1_SYNCXBARAPITTRIG0_MASK, SIM_MISCTRL1_SYNCXBARAPITTRIG0(value)))
#define SIM_BWR_MISCTRL1_SYNCXBARAPITTRIG0(base, value) (BME_BFI32(&SIM_MISCTRL1_REG(base), ((uint32_t)(value) << SIM_MISCTRL1_SYNCXBARAPITTRIG0_SHIFT), SIM_MISCTRL1_SYNCXBARAPITTRIG0_SHIFT, SIM_MISCTRL1_SYNCXBARAPITTRIG0_WIDTH))
/*@}*/

/*!
 * @name Register SIM_MISCTRL1, field SYNCXBARAPITTRIG1[9] (RW)
 *
 * This field controls the synchronizer between PIT trigger 1 and XBARA's input.
 * Set this bit if the XBARA's input PIT trigger 1 is fed into fast peripherials
 * through xbar.
 *
 * Values:
 * - 0b0 - Disable, bypass synchronizer.
 * - 0b1 - Enable.
 */
/*@{*/
/*! @brief Read current value of the SIM_MISCTRL1_SYNCXBARAPITTRIG1 field. */
#define SIM_RD_MISCTRL1_SYNCXBARAPITTRIG1(base) ((SIM_MISCTRL1_REG(base) & SIM_MISCTRL1_SYNCXBARAPITTRIG1_MASK) >> SIM_MISCTRL1_SYNCXBARAPITTRIG1_SHIFT)
#define SIM_BRD_MISCTRL1_SYNCXBARAPITTRIG1(base) (BME_UBFX32(&SIM_MISCTRL1_REG(base), SIM_MISCTRL1_SYNCXBARAPITTRIG1_SHIFT, SIM_MISCTRL1_SYNCXBARAPITTRIG1_WIDTH))

/*! @brief Set the SYNCXBARAPITTRIG1 field to a new value. */
#define SIM_WR_MISCTRL1_SYNCXBARAPITTRIG1(base, value) (SIM_RMW_MISCTRL1(base, SIM_MISCTRL1_SYNCXBARAPITTRIG1_MASK, SIM_MISCTRL1_SYNCXBARAPITTRIG1(value)))
#define SIM_BWR_MISCTRL1_SYNCXBARAPITTRIG1(base, value) (BME_BFI32(&SIM_MISCTRL1_REG(base), ((uint32_t)(value) << SIM_MISCTRL1_SYNCXBARAPITTRIG1_SHIFT), SIM_MISCTRL1_SYNCXBARAPITTRIG1_SHIFT, SIM_MISCTRL1_SYNCXBARAPITTRIG1_WIDTH))
/*@}*/

/*!
 * @name Register SIM_MISCTRL1, field SYNCXBARAPITTRIG2[10] (RW)
 *
 * This field controls the synchronizer between PIT trigger 2 and XBARA's input.
 * Set this bit if the XBARA's input PIT trigger 2 is fed into fast peripherials
 * through xbar.
 *
 * Values:
 * - 0b0 - Disable, bypass synchronizer.
 * - 0b1 - Enable.
 */
/*@{*/
/*! @brief Read current value of the SIM_MISCTRL1_SYNCXBARAPITTRIG2 field. */
#define SIM_RD_MISCTRL1_SYNCXBARAPITTRIG2(base) ((SIM_MISCTRL1_REG(base) & SIM_MISCTRL1_SYNCXBARAPITTRIG2_MASK) >> SIM_MISCTRL1_SYNCXBARAPITTRIG2_SHIFT)
#define SIM_BRD_MISCTRL1_SYNCXBARAPITTRIG2(base) (BME_UBFX32(&SIM_MISCTRL1_REG(base), SIM_MISCTRL1_SYNCXBARAPITTRIG2_SHIFT, SIM_MISCTRL1_SYNCXBARAPITTRIG2_WIDTH))

/*! @brief Set the SYNCXBARAPITTRIG2 field to a new value. */
#define SIM_WR_MISCTRL1_SYNCXBARAPITTRIG2(base, value) (SIM_RMW_MISCTRL1(base, SIM_MISCTRL1_SYNCXBARAPITTRIG2_MASK, SIM_MISCTRL1_SYNCXBARAPITTRIG2(value)))
#define SIM_BWR_MISCTRL1_SYNCXBARAPITTRIG2(base, value) (BME_BFI32(&SIM_MISCTRL1_REG(base), ((uint32_t)(value) << SIM_MISCTRL1_SYNCXBARAPITTRIG2_SHIFT), SIM_MISCTRL1_SYNCXBARAPITTRIG2_SHIFT, SIM_MISCTRL1_SYNCXBARAPITTRIG2_WIDTH))
/*@}*/

/*!
 * @name Register SIM_MISCTRL1, field SYNCXBARAPITTRIG3[11] (RW)
 *
 * This field controls the synchronizer between PIT trigger 3 and XBARA's input.
 * Set this bit if the XBARA's input PIT trigger 3 is fed into fast peripherials
 * through xbar.
 *
 * Values:
 * - 0b0 - Disable, bypass synchronizer.
 * - 0b1 - Enable.
 */
/*@{*/
/*! @brief Read current value of the SIM_MISCTRL1_SYNCXBARAPITTRIG3 field. */
#define SIM_RD_MISCTRL1_SYNCXBARAPITTRIG3(base) ((SIM_MISCTRL1_REG(base) & SIM_MISCTRL1_SYNCXBARAPITTRIG3_MASK) >> SIM_MISCTRL1_SYNCXBARAPITTRIG3_SHIFT)
#define SIM_BRD_MISCTRL1_SYNCXBARAPITTRIG3(base) (BME_UBFX32(&SIM_MISCTRL1_REG(base), SIM_MISCTRL1_SYNCXBARAPITTRIG3_SHIFT, SIM_MISCTRL1_SYNCXBARAPITTRIG3_WIDTH))

/*! @brief Set the SYNCXBARAPITTRIG3 field to a new value. */
#define SIM_WR_MISCTRL1_SYNCXBARAPITTRIG3(base, value) (SIM_RMW_MISCTRL1(base, SIM_MISCTRL1_SYNCXBARAPITTRIG3_MASK, SIM_MISCTRL1_SYNCXBARAPITTRIG3(value)))
#define SIM_BWR_MISCTRL1_SYNCXBARAPITTRIG3(base, value) (BME_BFI32(&SIM_MISCTRL1_REG(base), ((uint32_t)(value) << SIM_MISCTRL1_SYNCXBARAPITTRIG3_SHIFT), SIM_MISCTRL1_SYNCXBARAPITTRIG3_SHIFT, SIM_MISCTRL1_SYNCXBARAPITTRIG3_WIDTH))
/*@}*/

/*!
 * @name Register SIM_MISCTRL1, field SYNCXBARBPITTRIG0[12] (RW)
 *
 * This field controls the synchronizer between PIT trigger 0 and XBARB's input.
 * Set this bit if the XBARB's input PIT trigger 0 is fed into fast peripherials
 * through xbar.
 *
 * Values:
 * - 0b0 - Disable, bypass synchronizer.
 * - 0b1 - Enable.
 */
/*@{*/
/*! @brief Read current value of the SIM_MISCTRL1_SYNCXBARBPITTRIG0 field. */
#define SIM_RD_MISCTRL1_SYNCXBARBPITTRIG0(base) ((SIM_MISCTRL1_REG(base) & SIM_MISCTRL1_SYNCXBARBPITTRIG0_MASK) >> SIM_MISCTRL1_SYNCXBARBPITTRIG0_SHIFT)
#define SIM_BRD_MISCTRL1_SYNCXBARBPITTRIG0(base) (BME_UBFX32(&SIM_MISCTRL1_REG(base), SIM_MISCTRL1_SYNCXBARBPITTRIG0_SHIFT, SIM_MISCTRL1_SYNCXBARBPITTRIG0_WIDTH))

/*! @brief Set the SYNCXBARBPITTRIG0 field to a new value. */
#define SIM_WR_MISCTRL1_SYNCXBARBPITTRIG0(base, value) (SIM_RMW_MISCTRL1(base, SIM_MISCTRL1_SYNCXBARBPITTRIG0_MASK, SIM_MISCTRL1_SYNCXBARBPITTRIG0(value)))
#define SIM_BWR_MISCTRL1_SYNCXBARBPITTRIG0(base, value) (BME_BFI32(&SIM_MISCTRL1_REG(base), ((uint32_t)(value) << SIM_MISCTRL1_SYNCXBARBPITTRIG0_SHIFT), SIM_MISCTRL1_SYNCXBARBPITTRIG0_SHIFT, SIM_MISCTRL1_SYNCXBARBPITTRIG0_WIDTH))
/*@}*/

/*!
 * @name Register SIM_MISCTRL1, field SYNCXBARBPITTRIG1[13] (RW)
 *
 * This field controls the synchronizer between PIT trigger 1 and XBARB's input.
 * Set this bit if the XBARB's input PIT trigger 1 is fed into fast peripherials
 * through xbar.
 *
 * Values:
 * - 0b0 - Disable, bypass synchronizer.
 * - 0b1 - Enable.
 */
/*@{*/
/*! @brief Read current value of the SIM_MISCTRL1_SYNCXBARBPITTRIG1 field. */
#define SIM_RD_MISCTRL1_SYNCXBARBPITTRIG1(base) ((SIM_MISCTRL1_REG(base) & SIM_MISCTRL1_SYNCXBARBPITTRIG1_MASK) >> SIM_MISCTRL1_SYNCXBARBPITTRIG1_SHIFT)
#define SIM_BRD_MISCTRL1_SYNCXBARBPITTRIG1(base) (BME_UBFX32(&SIM_MISCTRL1_REG(base), SIM_MISCTRL1_SYNCXBARBPITTRIG1_SHIFT, SIM_MISCTRL1_SYNCXBARBPITTRIG1_WIDTH))

