ErichStyger/mcuoneclipse/Examples/KDS/TWR-KV58F220M/TWR_KV58F220M_PEx_2_SDKv2/SDK/platform/devices/MKV58F24/include/MKV58F24_extension.h
/*
 * Constants & macros for individual XBARA_SEL1 bitfields
 */

/*!
 * @name Register XBARA_SEL1, field SEL2[5:0] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT2 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL1_SEL2 field. */
#define XBARA_RD_SEL1_SEL2(base) ((XBARA_SEL1_REG(base) & XBARA_SEL1_SEL2_MASK) >> XBARA_SEL1_SEL2_SHIFT)
#define XBARA_BRD_SEL1_SEL2(base) (BME_UBFX16(&XBARA_SEL1_REG(base), XBARA_SEL1_SEL2_SHIFT, XBARA_SEL1_SEL2_WIDTH))

/*! @brief Set the SEL2 field to a new value. */
#define XBARA_WR_SEL1_SEL2(base, value) (XBARA_RMW_SEL1(base, XBARA_SEL1_SEL2_MASK, XBARA_SEL1_SEL2(value)))
#define XBARA_BWR_SEL1_SEL2(base, value) (BME_BFI16(&XBARA_SEL1_REG(base), ((uint16_t)(value) << XBARA_SEL1_SEL2_SHIFT), XBARA_SEL1_SEL2_SHIFT, XBARA_SEL1_SEL2_WIDTH))
/*@}*/

/*!
 * @name Register XBARA_SEL1, field SEL3[13:8] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT3 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL1_SEL3 field. */
#define XBARA_RD_SEL1_SEL3(base) ((XBARA_SEL1_REG(base) & XBARA_SEL1_SEL3_MASK) >> XBARA_SEL1_SEL3_SHIFT)
#define XBARA_BRD_SEL1_SEL3(base) (BME_UBFX16(&XBARA_SEL1_REG(base), XBARA_SEL1_SEL3_SHIFT, XBARA_SEL1_SEL3_WIDTH))

/*! @brief Set the SEL3 field to a new value. */
#define XBARA_WR_SEL1_SEL3(base, value) (XBARA_RMW_SEL1(base, XBARA_SEL1_SEL3_MASK, XBARA_SEL1_SEL3(value)))
#define XBARA_BWR_SEL1_SEL3(base, value) (BME_BFI16(&XBARA_SEL1_REG(base), ((uint16_t)(value) << XBARA_SEL1_SEL3_SHIFT), XBARA_SEL1_SEL3_SHIFT, XBARA_SEL1_SEL3_WIDTH))
/*@}*/

/*******************************************************************************
 * XBARA_SEL2 - Crossbar A Select Register 2
 ******************************************************************************/

/*!
 * @brief XBARA_SEL2 - Crossbar A Select Register 2 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBARA_SEL2 register
 */
/*@{*/
#define XBARA_RD_SEL2(base)      (XBARA_SEL2_REG(base))
#define XBARA_WR_SEL2(base, value) (XBARA_SEL2_REG(base) = (value))
#define XBARA_RMW_SEL2(base, mask, value) (XBARA_WR_SEL2(base, (XBARA_RD_SEL2(base) & ~(mask)) | (value)))
#define XBARA_SET_SEL2(base, value) (BME_OR16(&XBARA_SEL2_REG(base), (uint16_t)(value)))
#define XBARA_CLR_SEL2(base, value) (BME_AND16(&XBARA_SEL2_REG(base), (uint16_t)(~(value))))
#define XBARA_TOG_SEL2(base, value) (BME_XOR16(&XBARA_SEL2_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual XBARA_SEL2 bitfields
 */

/*!
 * @name Register XBARA_SEL2, field SEL4[5:0] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT4 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL2_SEL4 field. */
#define XBARA_RD_SEL2_SEL4(base) ((XBARA_SEL2_REG(base) & XBARA_SEL2_SEL4_MASK) >> XBARA_SEL2_SEL4_SHIFT)
#define XBARA_BRD_SEL2_SEL4(base) (BME_UBFX16(&XBARA_SEL2_REG(base), XBARA_SEL2_SEL4_SHIFT, XBARA_SEL2_SEL4_WIDTH))

/*! @brief Set the SEL4 field to a new value. */
#define XBARA_WR_SEL2_SEL4(base, value) (XBARA_RMW_SEL2(base, XBARA_SEL2_SEL4_MASK, XBARA_SEL2_SEL4(value)))
#define XBARA_BWR_SEL2_SEL4(base, value) (BME_BFI16(&XBARA_SEL2_REG(base), ((uint16_t)(value) << XBARA_SEL2_SEL4_SHIFT), XBARA_SEL2_SEL4_SHIFT, XBARA_SEL2_SEL4_WIDTH))
/*@}*/

/*!
 * @name Register XBARA_SEL2, field SEL5[13:8] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT5 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL2_SEL5 field. */
#define XBARA_RD_SEL2_SEL5(base) ((XBARA_SEL2_REG(base) & XBARA_SEL2_SEL5_MASK) >> XBARA_SEL2_SEL5_SHIFT)
#define XBARA_BRD_SEL2_SEL5(base) (BME_UBFX16(&XBARA_SEL2_REG(base), XBARA_SEL2_SEL5_SHIFT, XBARA_SEL2_SEL5_WIDTH))

/*! @brief Set the SEL5 field to a new value. */
#define XBARA_WR_SEL2_SEL5(base, value) (XBARA_RMW_SEL2(base, XBARA_SEL2_SEL5_MASK, XBARA_SEL2_SEL5(value)))
#define XBARA_BWR_SEL2_SEL5(base, value) (BME_BFI16(&XBARA_SEL2_REG(base), ((uint16_t)(value) << XBARA_SEL2_SEL5_SHIFT), XBARA_SEL2_SEL5_SHIFT, XBARA_SEL2_SEL5_WIDTH))
/*@}*/

/*******************************************************************************
 * XBARA_SEL3 - Crossbar A Select Register 3
 ******************************************************************************/

/*!
 * @brief XBARA_SEL3 - Crossbar A Select Register 3 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBARA_SEL3 register
 */
/*@{*/
#define XBARA_RD_SEL3(base)      (XBARA_SEL3_REG(base))
#define XBARA_WR_SEL3(base, value) (XBARA_SEL3_REG(base) = (value))
#define XBARA_RMW_SEL3(base, mask, value) (XBARA_WR_SEL3(base, (XBARA_RD_SEL3(base) & ~(mask)) | (value)))
#define XBARA_SET_SEL3(base, value) (BME_OR16(&XBARA_SEL3_REG(base), (uint16_t)(value)))
#define XBARA_CLR_SEL3(base, value) (BME_AND16(&XBARA_SEL3_REG(base), (uint16_t)(~(value))))
#define XBARA_TOG_SEL3(base, value) (BME_XOR16(&XBARA_SEL3_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual XBARA_SEL3 bitfields
 */

/*!
 * @name Register XBARA_SEL3, field SEL6[5:0] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT6 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL3_SEL6 field. */
#define XBARA_RD_SEL3_SEL6(base) ((XBARA_SEL3_REG(base) & XBARA_SEL3_SEL6_MASK) >> XBARA_SEL3_SEL6_SHIFT)
#define XBARA_BRD_SEL3_SEL6(base) (BME_UBFX16(&XBARA_SEL3_REG(base), XBARA_SEL3_SEL6_SHIFT, XBARA_SEL3_SEL6_WIDTH))

/*! @brief Set the SEL6 field to a new value. */
#define XBARA_WR_SEL3_SEL6(base, value) (XBARA_RMW_SEL3(base, XBARA_SEL3_SEL6_MASK, XBARA_SEL3_SEL6(value)))
#define XBARA_BWR_SEL3_SEL6(base, value) (BME_BFI16(&XBARA_SEL3_REG(base), ((uint16_t)(value) << XBARA_SEL3_SEL6_SHIFT), XBARA_SEL3_SEL6_SHIFT, XBARA_SEL3_SEL6_WIDTH))
/*@}*/

/*!
 * @name Register XBARA_SEL3, field SEL7[13:8] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT7 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL3_SEL7 field. */
#define XBARA_RD_SEL3_SEL7(base) ((XBARA_SEL3_REG(base) & XBARA_SEL3_SEL7_MASK) >> XBARA_SEL3_SEL7_SHIFT)
#define XBARA_BRD_SEL3_SEL7(base) (BME_UBFX16(&XBARA_SEL3_REG(base), XBARA_SEL3_SEL7_SHIFT, XBARA_SEL3_SEL7_WIDTH))

