ErichStyger/mcuoneclipse/Examples/KDS/TWR-KV58F220M/TWR_KV58F220M_PEx_2_SDKv2/SDK/platform/devices/MKV58F24/include/MKV58F24_extension.h
/*! @brief Set the SEL7 field to a new value. */
#define XBARA_WR_SEL3_SEL7(base, value) (XBARA_RMW_SEL3(base, XBARA_SEL3_SEL7_MASK, XBARA_SEL3_SEL7(value)))
#define XBARA_BWR_SEL3_SEL7(base, value) (BME_BFI16(&XBARA_SEL3_REG(base), ((uint16_t)(value) << XBARA_SEL3_SEL7_SHIFT), XBARA_SEL3_SEL7_SHIFT, XBARA_SEL3_SEL7_WIDTH))
/*@}*/

/*******************************************************************************
 * XBARA_SEL4 - Crossbar A Select Register 4
 ******************************************************************************/

/*!
 * @brief XBARA_SEL4 - Crossbar A Select Register 4 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBARA_SEL4 register
 */
/*@{*/
#define XBARA_RD_SEL4(base)      (XBARA_SEL4_REG(base))
#define XBARA_WR_SEL4(base, value) (XBARA_SEL4_REG(base) = (value))
#define XBARA_RMW_SEL4(base, mask, value) (XBARA_WR_SEL4(base, (XBARA_RD_SEL4(base) & ~(mask)) | (value)))
#define XBARA_SET_SEL4(base, value) (BME_OR16(&XBARA_SEL4_REG(base), (uint16_t)(value)))
#define XBARA_CLR_SEL4(base, value) (BME_AND16(&XBARA_SEL4_REG(base), (uint16_t)(~(value))))
#define XBARA_TOG_SEL4(base, value) (BME_XOR16(&XBARA_SEL4_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual XBARA_SEL4 bitfields
 */

/*!
 * @name Register XBARA_SEL4, field SEL8[5:0] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT8 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL4_SEL8 field. */
#define XBARA_RD_SEL4_SEL8(base) ((XBARA_SEL4_REG(base) & XBARA_SEL4_SEL8_MASK) >> XBARA_SEL4_SEL8_SHIFT)
#define XBARA_BRD_SEL4_SEL8(base) (BME_UBFX16(&XBARA_SEL4_REG(base), XBARA_SEL4_SEL8_SHIFT, XBARA_SEL4_SEL8_WIDTH))

/*! @brief Set the SEL8 field to a new value. */
#define XBARA_WR_SEL4_SEL8(base, value) (XBARA_RMW_SEL4(base, XBARA_SEL4_SEL8_MASK, XBARA_SEL4_SEL8(value)))
#define XBARA_BWR_SEL4_SEL8(base, value) (BME_BFI16(&XBARA_SEL4_REG(base), ((uint16_t)(value) << XBARA_SEL4_SEL8_SHIFT), XBARA_SEL4_SEL8_SHIFT, XBARA_SEL4_SEL8_WIDTH))
/*@}*/

/*!
 * @name Register XBARA_SEL4, field SEL9[13:8] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT9 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL4_SEL9 field. */
#define XBARA_RD_SEL4_SEL9(base) ((XBARA_SEL4_REG(base) & XBARA_SEL4_SEL9_MASK) >> XBARA_SEL4_SEL9_SHIFT)
#define XBARA_BRD_SEL4_SEL9(base) (BME_UBFX16(&XBARA_SEL4_REG(base), XBARA_SEL4_SEL9_SHIFT, XBARA_SEL4_SEL9_WIDTH))

/*! @brief Set the SEL9 field to a new value. */
#define XBARA_WR_SEL4_SEL9(base, value) (XBARA_RMW_SEL4(base, XBARA_SEL4_SEL9_MASK, XBARA_SEL4_SEL9(value)))
#define XBARA_BWR_SEL4_SEL9(base, value) (BME_BFI16(&XBARA_SEL4_REG(base), ((uint16_t)(value) << XBARA_SEL4_SEL9_SHIFT), XBARA_SEL4_SEL9_SHIFT, XBARA_SEL4_SEL9_WIDTH))
/*@}*/

/*******************************************************************************
 * XBARA_SEL5 - Crossbar A Select Register 5
 ******************************************************************************/

/*!
 * @brief XBARA_SEL5 - Crossbar A Select Register 5 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBARA_SEL5 register
 */
/*@{*/
#define XBARA_RD_SEL5(base)      (XBARA_SEL5_REG(base))
#define XBARA_WR_SEL5(base, value) (XBARA_SEL5_REG(base) = (value))
#define XBARA_RMW_SEL5(base, mask, value) (XBARA_WR_SEL5(base, (XBARA_RD_SEL5(base) & ~(mask)) | (value)))
#define XBARA_SET_SEL5(base, value) (BME_OR16(&XBARA_SEL5_REG(base), (uint16_t)(value)))
#define XBARA_CLR_SEL5(base, value) (BME_AND16(&XBARA_SEL5_REG(base), (uint16_t)(~(value))))
#define XBARA_TOG_SEL5(base, value) (BME_XOR16(&XBARA_SEL5_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual XBARA_SEL5 bitfields
 */

/*!
 * @name Register XBARA_SEL5, field SEL10[5:0] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT10 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL5_SEL10 field. */
#define XBARA_RD_SEL5_SEL10(base) ((XBARA_SEL5_REG(base) & XBARA_SEL5_SEL10_MASK) >> XBARA_SEL5_SEL10_SHIFT)
#define XBARA_BRD_SEL5_SEL10(base) (BME_UBFX16(&XBARA_SEL5_REG(base), XBARA_SEL5_SEL10_SHIFT, XBARA_SEL5_SEL10_WIDTH))

/*! @brief Set the SEL10 field to a new value. */
#define XBARA_WR_SEL5_SEL10(base, value) (XBARA_RMW_SEL5(base, XBARA_SEL5_SEL10_MASK, XBARA_SEL5_SEL10(value)))
#define XBARA_BWR_SEL5_SEL10(base, value) (BME_BFI16(&XBARA_SEL5_REG(base), ((uint16_t)(value) << XBARA_SEL5_SEL10_SHIFT), XBARA_SEL5_SEL10_SHIFT, XBARA_SEL5_SEL10_WIDTH))
/*@}*/

/*!
 * @name Register XBARA_SEL5, field SEL11[13:8] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT11 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL5_SEL11 field. */
#define XBARA_RD_SEL5_SEL11(base) ((XBARA_SEL5_REG(base) & XBARA_SEL5_SEL11_MASK) >> XBARA_SEL5_SEL11_SHIFT)
#define XBARA_BRD_SEL5_SEL11(base) (BME_UBFX16(&XBARA_SEL5_REG(base), XBARA_SEL5_SEL11_SHIFT, XBARA_SEL5_SEL11_WIDTH))

/*! @brief Set the SEL11 field to a new value. */
#define XBARA_WR_SEL5_SEL11(base, value) (XBARA_RMW_SEL5(base, XBARA_SEL5_SEL11_MASK, XBARA_SEL5_SEL11(value)))
#define XBARA_BWR_SEL5_SEL11(base, value) (BME_BFI16(&XBARA_SEL5_REG(base), ((uint16_t)(value) << XBARA_SEL5_SEL11_SHIFT), XBARA_SEL5_SEL11_SHIFT, XBARA_SEL5_SEL11_WIDTH))
/*@}*/

/*******************************************************************************
 * XBARA_SEL6 - Crossbar A Select Register 6
 ******************************************************************************/

/*!
 * @brief XBARA_SEL6 - Crossbar A Select Register 6 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBARA_SEL6 register
 */
/*@{*/
#define XBARA_RD_SEL6(base)      (XBARA_SEL6_REG(base))
#define XBARA_WR_SEL6(base, value) (XBARA_SEL6_REG(base) = (value))
#define XBARA_RMW_SEL6(base, mask, value) (XBARA_WR_SEL6(base, (XBARA_RD_SEL6(base) & ~(mask)) | (value)))
#define XBARA_SET_SEL6(base, value) (BME_OR16(&XBARA_SEL6_REG(base), (uint16_t)(value)))
#define XBARA_CLR_SEL6(base, value) (BME_AND16(&XBARA_SEL6_REG(base), (uint16_t)(~(value))))
#define XBARA_TOG_SEL6(base, value) (BME_XOR16(&XBARA_SEL6_REG(base), (uint16_t)(value)))
/*@}*/

