ErichStyger/mcuoneclipse/Examples/KDS/TWR-KV58F220M/TWR_KV58F220M_PEx_2_SDKv2/SDK/platform/devices/MKV58F24/include/MKV58F24_extension.h
/*! @brief Set the SEL27 field to a new value. */
#define XBARA_WR_SEL13_SEL27(base, value) (XBARA_RMW_SEL13(base, XBARA_SEL13_SEL27_MASK, XBARA_SEL13_SEL27(value)))
#define XBARA_BWR_SEL13_SEL27(base, value) (BME_BFI16(&XBARA_SEL13_REG(base), ((uint16_t)(value) << XBARA_SEL13_SEL27_SHIFT), XBARA_SEL13_SEL27_SHIFT, XBARA_SEL13_SEL27_WIDTH))
/*@}*/

/*******************************************************************************
 * XBARA_SEL14 - Crossbar A Select Register 14
 ******************************************************************************/

/*!
 * @brief XBARA_SEL14 - Crossbar A Select Register 14 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBARA_SEL14 register
 */
/*@{*/
#define XBARA_RD_SEL14(base)     (XBARA_SEL14_REG(base))
#define XBARA_WR_SEL14(base, value) (XBARA_SEL14_REG(base) = (value))
#define XBARA_RMW_SEL14(base, mask, value) (XBARA_WR_SEL14(base, (XBARA_RD_SEL14(base) & ~(mask)) | (value)))
#define XBARA_SET_SEL14(base, value) (BME_OR16(&XBARA_SEL14_REG(base), (uint16_t)(value)))
#define XBARA_CLR_SEL14(base, value) (BME_AND16(&XBARA_SEL14_REG(base), (uint16_t)(~(value))))
#define XBARA_TOG_SEL14(base, value) (BME_XOR16(&XBARA_SEL14_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual XBARA_SEL14 bitfields
 */

/*!
 * @name Register XBARA_SEL14, field SEL28[5:0] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT28 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL14_SEL28 field. */
#define XBARA_RD_SEL14_SEL28(base) ((XBARA_SEL14_REG(base) & XBARA_SEL14_SEL28_MASK) >> XBARA_SEL14_SEL28_SHIFT)
#define XBARA_BRD_SEL14_SEL28(base) (BME_UBFX16(&XBARA_SEL14_REG(base), XBARA_SEL14_SEL28_SHIFT, XBARA_SEL14_SEL28_WIDTH))

/*! @brief Set the SEL28 field to a new value. */
#define XBARA_WR_SEL14_SEL28(base, value) (XBARA_RMW_SEL14(base, XBARA_SEL14_SEL28_MASK, XBARA_SEL14_SEL28(value)))
#define XBARA_BWR_SEL14_SEL28(base, value) (BME_BFI16(&XBARA_SEL14_REG(base), ((uint16_t)(value) << XBARA_SEL14_SEL28_SHIFT), XBARA_SEL14_SEL28_SHIFT, XBARA_SEL14_SEL28_WIDTH))
/*@}*/

/*!
 * @name Register XBARA_SEL14, field SEL29[13:8] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT29 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL14_SEL29 field. */
#define XBARA_RD_SEL14_SEL29(base) ((XBARA_SEL14_REG(base) & XBARA_SEL14_SEL29_MASK) >> XBARA_SEL14_SEL29_SHIFT)
#define XBARA_BRD_SEL14_SEL29(base) (BME_UBFX16(&XBARA_SEL14_REG(base), XBARA_SEL14_SEL29_SHIFT, XBARA_SEL14_SEL29_WIDTH))

/*! @brief Set the SEL29 field to a new value. */
#define XBARA_WR_SEL14_SEL29(base, value) (XBARA_RMW_SEL14(base, XBARA_SEL14_SEL29_MASK, XBARA_SEL14_SEL29(value)))
#define XBARA_BWR_SEL14_SEL29(base, value) (BME_BFI16(&XBARA_SEL14_REG(base), ((uint16_t)(value) << XBARA_SEL14_SEL29_SHIFT), XBARA_SEL14_SEL29_SHIFT, XBARA_SEL14_SEL29_WIDTH))
/*@}*/

/*******************************************************************************
 * XBARA_SEL15 - Crossbar A Select Register 15
 ******************************************************************************/

/*!
 * @brief XBARA_SEL15 - Crossbar A Select Register 15 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBARA_SEL15 register
 */
/*@{*/
#define XBARA_RD_SEL15(base)     (XBARA_SEL15_REG(base))
#define XBARA_WR_SEL15(base, value) (XBARA_SEL15_REG(base) = (value))
#define XBARA_RMW_SEL15(base, mask, value) (XBARA_WR_SEL15(base, (XBARA_RD_SEL15(base) & ~(mask)) | (value)))
#define XBARA_SET_SEL15(base, value) (BME_OR16(&XBARA_SEL15_REG(base), (uint16_t)(value)))
#define XBARA_CLR_SEL15(base, value) (BME_AND16(&XBARA_SEL15_REG(base), (uint16_t)(~(value))))
#define XBARA_TOG_SEL15(base, value) (BME_XOR16(&XBARA_SEL15_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual XBARA_SEL15 bitfields
 */

/*!
 * @name Register XBARA_SEL15, field SEL30[5:0] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT30 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL15_SEL30 field. */
#define XBARA_RD_SEL15_SEL30(base) ((XBARA_SEL15_REG(base) & XBARA_SEL15_SEL30_MASK) >> XBARA_SEL15_SEL30_SHIFT)
#define XBARA_BRD_SEL15_SEL30(base) (BME_UBFX16(&XBARA_SEL15_REG(base), XBARA_SEL15_SEL30_SHIFT, XBARA_SEL15_SEL30_WIDTH))

/*! @brief Set the SEL30 field to a new value. */
#define XBARA_WR_SEL15_SEL30(base, value) (XBARA_RMW_SEL15(base, XBARA_SEL15_SEL30_MASK, XBARA_SEL15_SEL30(value)))
#define XBARA_BWR_SEL15_SEL30(base, value) (BME_BFI16(&XBARA_SEL15_REG(base), ((uint16_t)(value) << XBARA_SEL15_SEL30_SHIFT), XBARA_SEL15_SEL30_SHIFT, XBARA_SEL15_SEL30_WIDTH))
/*@}*/

/*!
 * @name Register XBARA_SEL15, field SEL31[13:8] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT31 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL15_SEL31 field. */
#define XBARA_RD_SEL15_SEL31(base) ((XBARA_SEL15_REG(base) & XBARA_SEL15_SEL31_MASK) >> XBARA_SEL15_SEL31_SHIFT)
#define XBARA_BRD_SEL15_SEL31(base) (BME_UBFX16(&XBARA_SEL15_REG(base), XBARA_SEL15_SEL31_SHIFT, XBARA_SEL15_SEL31_WIDTH))

/*! @brief Set the SEL31 field to a new value. */
#define XBARA_WR_SEL15_SEL31(base, value) (XBARA_RMW_SEL15(base, XBARA_SEL15_SEL31_MASK, XBARA_SEL15_SEL31(value)))
#define XBARA_BWR_SEL15_SEL31(base, value) (BME_BFI16(&XBARA_SEL15_REG(base), ((uint16_t)(value) << XBARA_SEL15_SEL31_SHIFT), XBARA_SEL15_SEL31_SHIFT, XBARA_SEL15_SEL31_WIDTH))
/*@}*/

/*******************************************************************************
 * XBARA_SEL16 - Crossbar A Select Register 16
 ******************************************************************************/

/*!
 * @brief XBARA_SEL16 - Crossbar A Select Register 16 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBARA_SEL16 register
 */
/*@{*/
#define XBARA_RD_SEL16(base)     (XBARA_SEL16_REG(base))
#define XBARA_WR_SEL16(base, value) (XBARA_SEL16_REG(base) = (value))
#define XBARA_RMW_SEL16(base, mask, value) (XBARA_WR_SEL16(base, (XBARA_RD_SEL16(base) & ~(mask)) | (value)))
#define XBARA_SET_SEL16(base, value) (BME_OR16(&XBARA_SEL16_REG(base), (uint16_t)(value)))
#define XBARA_CLR_SEL16(base, value) (BME_AND16(&XBARA_SEL16_REG(base), (uint16_t)(~(value))))
#define XBARA_TOG_SEL16(base, value) (BME_XOR16(&XBARA_SEL16_REG(base), (uint16_t)(value)))
/*@}*/

