ErichStyger/mcuoneclipse/Examples/KDS/TWR-KV58F220M/TWR_KV58F220M_PEx_2_SDKv2/SDK/platform/devices/MKV58F24/include/MKV58F24_extension.h
/*
 * Constants & macros for individual XBARA_SEL21 bitfields
 */

/*!
 * @name Register XBARA_SEL21, field SEL42[5:0] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT42 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL21_SEL42 field. */
#define XBARA_RD_SEL21_SEL42(base) ((XBARA_SEL21_REG(base) & XBARA_SEL21_SEL42_MASK) >> XBARA_SEL21_SEL42_SHIFT)
#define XBARA_BRD_SEL21_SEL42(base) (BME_UBFX16(&XBARA_SEL21_REG(base), XBARA_SEL21_SEL42_SHIFT, XBARA_SEL21_SEL42_WIDTH))

/*! @brief Set the SEL42 field to a new value. */
#define XBARA_WR_SEL21_SEL42(base, value) (XBARA_RMW_SEL21(base, XBARA_SEL21_SEL42_MASK, XBARA_SEL21_SEL42(value)))
#define XBARA_BWR_SEL21_SEL42(base, value) (BME_BFI16(&XBARA_SEL21_REG(base), ((uint16_t)(value) << XBARA_SEL21_SEL42_SHIFT), XBARA_SEL21_SEL42_SHIFT, XBARA_SEL21_SEL42_WIDTH))
/*@}*/

/*!
 * @name Register XBARA_SEL21, field SEL43[13:8] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT43 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL21_SEL43 field. */
#define XBARA_RD_SEL21_SEL43(base) ((XBARA_SEL21_REG(base) & XBARA_SEL21_SEL43_MASK) >> XBARA_SEL21_SEL43_SHIFT)
#define XBARA_BRD_SEL21_SEL43(base) (BME_UBFX16(&XBARA_SEL21_REG(base), XBARA_SEL21_SEL43_SHIFT, XBARA_SEL21_SEL43_WIDTH))

/*! @brief Set the SEL43 field to a new value. */
#define XBARA_WR_SEL21_SEL43(base, value) (XBARA_RMW_SEL21(base, XBARA_SEL21_SEL43_MASK, XBARA_SEL21_SEL43(value)))
#define XBARA_BWR_SEL21_SEL43(base, value) (BME_BFI16(&XBARA_SEL21_REG(base), ((uint16_t)(value) << XBARA_SEL21_SEL43_SHIFT), XBARA_SEL21_SEL43_SHIFT, XBARA_SEL21_SEL43_WIDTH))
/*@}*/

/*******************************************************************************
 * XBARA_SEL22 - Crossbar A Select Register 22
 ******************************************************************************/

/*!
 * @brief XBARA_SEL22 - Crossbar A Select Register 22 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBARA_SEL22 register
 */
/*@{*/
#define XBARA_RD_SEL22(base)     (XBARA_SEL22_REG(base))
#define XBARA_WR_SEL22(base, value) (XBARA_SEL22_REG(base) = (value))
#define XBARA_RMW_SEL22(base, mask, value) (XBARA_WR_SEL22(base, (XBARA_RD_SEL22(base) & ~(mask)) | (value)))
#define XBARA_SET_SEL22(base, value) (BME_OR16(&XBARA_SEL22_REG(base), (uint16_t)(value)))
#define XBARA_CLR_SEL22(base, value) (BME_AND16(&XBARA_SEL22_REG(base), (uint16_t)(~(value))))
#define XBARA_TOG_SEL22(base, value) (BME_XOR16(&XBARA_SEL22_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual XBARA_SEL22 bitfields
 */

/*!
 * @name Register XBARA_SEL22, field SEL44[5:0] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT44 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL22_SEL44 field. */
#define XBARA_RD_SEL22_SEL44(base) ((XBARA_SEL22_REG(base) & XBARA_SEL22_SEL44_MASK) >> XBARA_SEL22_SEL44_SHIFT)
#define XBARA_BRD_SEL22_SEL44(base) (BME_UBFX16(&XBARA_SEL22_REG(base), XBARA_SEL22_SEL44_SHIFT, XBARA_SEL22_SEL44_WIDTH))

/*! @brief Set the SEL44 field to a new value. */
#define XBARA_WR_SEL22_SEL44(base, value) (XBARA_RMW_SEL22(base, XBARA_SEL22_SEL44_MASK, XBARA_SEL22_SEL44(value)))
#define XBARA_BWR_SEL22_SEL44(base, value) (BME_BFI16(&XBARA_SEL22_REG(base), ((uint16_t)(value) << XBARA_SEL22_SEL44_SHIFT), XBARA_SEL22_SEL44_SHIFT, XBARA_SEL22_SEL44_WIDTH))
/*@}*/

/*!
 * @name Register XBARA_SEL22, field SEL45[13:8] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT45 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL22_SEL45 field. */
#define XBARA_RD_SEL22_SEL45(base) ((XBARA_SEL22_REG(base) & XBARA_SEL22_SEL45_MASK) >> XBARA_SEL22_SEL45_SHIFT)
#define XBARA_BRD_SEL22_SEL45(base) (BME_UBFX16(&XBARA_SEL22_REG(base), XBARA_SEL22_SEL45_SHIFT, XBARA_SEL22_SEL45_WIDTH))

/*! @brief Set the SEL45 field to a new value. */
#define XBARA_WR_SEL22_SEL45(base, value) (XBARA_RMW_SEL22(base, XBARA_SEL22_SEL45_MASK, XBARA_SEL22_SEL45(value)))
#define XBARA_BWR_SEL22_SEL45(base, value) (BME_BFI16(&XBARA_SEL22_REG(base), ((uint16_t)(value) << XBARA_SEL22_SEL45_SHIFT), XBARA_SEL22_SEL45_SHIFT, XBARA_SEL22_SEL45_WIDTH))
/*@}*/

/*******************************************************************************
 * XBARA_SEL23 - Crossbar A Select Register 23
 ******************************************************************************/

/*!
 * @brief XBARA_SEL23 - Crossbar A Select Register 23 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBARA_SEL23 register
 */
/*@{*/
#define XBARA_RD_SEL23(base)     (XBARA_SEL23_REG(base))
#define XBARA_WR_SEL23(base, value) (XBARA_SEL23_REG(base) = (value))
#define XBARA_RMW_SEL23(base, mask, value) (XBARA_WR_SEL23(base, (XBARA_RD_SEL23(base) & ~(mask)) | (value)))
#define XBARA_SET_SEL23(base, value) (BME_OR16(&XBARA_SEL23_REG(base), (uint16_t)(value)))
#define XBARA_CLR_SEL23(base, value) (BME_AND16(&XBARA_SEL23_REG(base), (uint16_t)(~(value))))
#define XBARA_TOG_SEL23(base, value) (BME_XOR16(&XBARA_SEL23_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual XBARA_SEL23 bitfields
 */

/*!
 * @name Register XBARA_SEL23, field SEL46[5:0] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT46 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL23_SEL46 field. */
#define XBARA_RD_SEL23_SEL46(base) ((XBARA_SEL23_REG(base) & XBARA_SEL23_SEL46_MASK) >> XBARA_SEL23_SEL46_SHIFT)
#define XBARA_BRD_SEL23_SEL46(base) (BME_UBFX16(&XBARA_SEL23_REG(base), XBARA_SEL23_SEL46_SHIFT, XBARA_SEL23_SEL46_WIDTH))

/*! @brief Set the SEL46 field to a new value. */
#define XBARA_WR_SEL23_SEL46(base, value) (XBARA_RMW_SEL23(base, XBARA_SEL23_SEL46_MASK, XBARA_SEL23_SEL46(value)))
#define XBARA_BWR_SEL23_SEL46(base, value) (BME_BFI16(&XBARA_SEL23_REG(base), ((uint16_t)(value) << XBARA_SEL23_SEL46_SHIFT), XBARA_SEL23_SEL46_SHIFT, XBARA_SEL23_SEL46_WIDTH))
/*@}*/

/*!
 * @name Register XBARA_SEL23, field SEL47[13:8] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT47 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL23_SEL47 field. */
#define XBARA_RD_SEL23_SEL47(base) ((XBARA_SEL23_REG(base) & XBARA_SEL23_SEL47_MASK) >> XBARA_SEL23_SEL47_SHIFT)
#define XBARA_BRD_SEL23_SEL47(base) (BME_UBFX16(&XBARA_SEL23_REG(base), XBARA_SEL23_SEL47_SHIFT, XBARA_SEL23_SEL47_WIDTH))

/*! @brief Set the SEL47 field to a new value. */
#define XBARA_WR_SEL23_SEL47(base, value) (XBARA_RMW_SEL23(base, XBARA_SEL23_SEL47_MASK, XBARA_SEL23_SEL47(value)))
#define XBARA_BWR_SEL23_SEL47(base, value) (BME_BFI16(&XBARA_SEL23_REG(base), ((uint16_t)(value) << XBARA_SEL23_SEL47_SHIFT), XBARA_SEL23_SEL47_SHIFT, XBARA_SEL23_SEL47_WIDTH))
/*@}*/

