ErichStyger/mcuoneclipse/Examples/KDS/TWR-KV58F220M/TWR_KV58F220M_PEx_2_SDKv2/SDK/platform/devices/MKV58F24/include/MKV58F24_extension.h
/*
 * Constants & macros for individual XBARA_SEL26 bitfields
 */

/*!
 * @name Register XBARA_SEL26, field SEL52[5:0] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT52 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL26_SEL52 field. */
#define XBARA_RD_SEL26_SEL52(base) ((XBARA_SEL26_REG(base) & XBARA_SEL26_SEL52_MASK) >> XBARA_SEL26_SEL52_SHIFT)
#define XBARA_BRD_SEL26_SEL52(base) (BME_UBFX16(&XBARA_SEL26_REG(base), XBARA_SEL26_SEL52_SHIFT, XBARA_SEL26_SEL52_WIDTH))

/*! @brief Set the SEL52 field to a new value. */
#define XBARA_WR_SEL26_SEL52(base, value) (XBARA_RMW_SEL26(base, XBARA_SEL26_SEL52_MASK, XBARA_SEL26_SEL52(value)))
#define XBARA_BWR_SEL26_SEL52(base, value) (BME_BFI16(&XBARA_SEL26_REG(base), ((uint16_t)(value) << XBARA_SEL26_SEL52_SHIFT), XBARA_SEL26_SEL52_SHIFT, XBARA_SEL26_SEL52_WIDTH))
/*@}*/

/*!
 * @name Register XBARA_SEL26, field SEL53[13:8] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT53 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL26_SEL53 field. */
#define XBARA_RD_SEL26_SEL53(base) ((XBARA_SEL26_REG(base) & XBARA_SEL26_SEL53_MASK) >> XBARA_SEL26_SEL53_SHIFT)
#define XBARA_BRD_SEL26_SEL53(base) (BME_UBFX16(&XBARA_SEL26_REG(base), XBARA_SEL26_SEL53_SHIFT, XBARA_SEL26_SEL53_WIDTH))

/*! @brief Set the SEL53 field to a new value. */
#define XBARA_WR_SEL26_SEL53(base, value) (XBARA_RMW_SEL26(base, XBARA_SEL26_SEL53_MASK, XBARA_SEL26_SEL53(value)))
#define XBARA_BWR_SEL26_SEL53(base, value) (BME_BFI16(&XBARA_SEL26_REG(base), ((uint16_t)(value) << XBARA_SEL26_SEL53_SHIFT), XBARA_SEL26_SEL53_SHIFT, XBARA_SEL26_SEL53_WIDTH))
/*@}*/

/*******************************************************************************
 * XBARA_SEL27 - Crossbar A Select Register 27
 ******************************************************************************/

/*!
 * @brief XBARA_SEL27 - Crossbar A Select Register 27 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBARA_SEL27 register
 */
/*@{*/
#define XBARA_RD_SEL27(base)     (XBARA_SEL27_REG(base))
#define XBARA_WR_SEL27(base, value) (XBARA_SEL27_REG(base) = (value))
#define XBARA_RMW_SEL27(base, mask, value) (XBARA_WR_SEL27(base, (XBARA_RD_SEL27(base) & ~(mask)) | (value)))
#define XBARA_SET_SEL27(base, value) (BME_OR16(&XBARA_SEL27_REG(base), (uint16_t)(value)))
#define XBARA_CLR_SEL27(base, value) (BME_AND16(&XBARA_SEL27_REG(base), (uint16_t)(~(value))))
#define XBARA_TOG_SEL27(base, value) (BME_XOR16(&XBARA_SEL27_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual XBARA_SEL27 bitfields
 */

/*!
 * @name Register XBARA_SEL27, field SEL54[5:0] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT54 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL27_SEL54 field. */
#define XBARA_RD_SEL27_SEL54(base) ((XBARA_SEL27_REG(base) & XBARA_SEL27_SEL54_MASK) >> XBARA_SEL27_SEL54_SHIFT)
#define XBARA_BRD_SEL27_SEL54(base) (BME_UBFX16(&XBARA_SEL27_REG(base), XBARA_SEL27_SEL54_SHIFT, XBARA_SEL27_SEL54_WIDTH))

/*! @brief Set the SEL54 field to a new value. */
#define XBARA_WR_SEL27_SEL54(base, value) (XBARA_RMW_SEL27(base, XBARA_SEL27_SEL54_MASK, XBARA_SEL27_SEL54(value)))
#define XBARA_BWR_SEL27_SEL54(base, value) (BME_BFI16(&XBARA_SEL27_REG(base), ((uint16_t)(value) << XBARA_SEL27_SEL54_SHIFT), XBARA_SEL27_SEL54_SHIFT, XBARA_SEL27_SEL54_WIDTH))
/*@}*/

/*!
 * @name Register XBARA_SEL27, field SEL55[13:8] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT55 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL27_SEL55 field. */
#define XBARA_RD_SEL27_SEL55(base) ((XBARA_SEL27_REG(base) & XBARA_SEL27_SEL55_MASK) >> XBARA_SEL27_SEL55_SHIFT)
#define XBARA_BRD_SEL27_SEL55(base) (BME_UBFX16(&XBARA_SEL27_REG(base), XBARA_SEL27_SEL55_SHIFT, XBARA_SEL27_SEL55_WIDTH))

/*! @brief Set the SEL55 field to a new value. */
#define XBARA_WR_SEL27_SEL55(base, value) (XBARA_RMW_SEL27(base, XBARA_SEL27_SEL55_MASK, XBARA_SEL27_SEL55(value)))
#define XBARA_BWR_SEL27_SEL55(base, value) (BME_BFI16(&XBARA_SEL27_REG(base), ((uint16_t)(value) << XBARA_SEL27_SEL55_SHIFT), XBARA_SEL27_SEL55_SHIFT, XBARA_SEL27_SEL55_WIDTH))
/*@}*/

/*******************************************************************************
 * XBARA_SEL28 - Crossbar A Select Register 28
 ******************************************************************************/

/*!
 * @brief XBARA_SEL28 - Crossbar A Select Register 28 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBARA_SEL28 register
 */
/*@{*/
#define XBARA_RD_SEL28(base)     (XBARA_SEL28_REG(base))
#define XBARA_WR_SEL28(base, value) (XBARA_SEL28_REG(base) = (value))
#define XBARA_RMW_SEL28(base, mask, value) (XBARA_WR_SEL28(base, (XBARA_RD_SEL28(base) & ~(mask)) | (value)))
#define XBARA_SET_SEL28(base, value) (BME_OR16(&XBARA_SEL28_REG(base), (uint16_t)(value)))
#define XBARA_CLR_SEL28(base, value) (BME_AND16(&XBARA_SEL28_REG(base), (uint16_t)(~(value))))
#define XBARA_TOG_SEL28(base, value) (BME_XOR16(&XBARA_SEL28_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual XBARA_SEL28 bitfields
 */

/*!
 * @name Register XBARA_SEL28, field SEL56[5:0] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT56 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL28_SEL56 field. */
#define XBARA_RD_SEL28_SEL56(base) ((XBARA_SEL28_REG(base) & XBARA_SEL28_SEL56_MASK) >> XBARA_SEL28_SEL56_SHIFT)
#define XBARA_BRD_SEL28_SEL56(base) (BME_UBFX16(&XBARA_SEL28_REG(base), XBARA_SEL28_SEL56_SHIFT, XBARA_SEL28_SEL56_WIDTH))

/*! @brief Set the SEL56 field to a new value. */
#define XBARA_WR_SEL28_SEL56(base, value) (XBARA_RMW_SEL28(base, XBARA_SEL28_SEL56_MASK, XBARA_SEL28_SEL56(value)))
#define XBARA_BWR_SEL28_SEL56(base, value) (BME_BFI16(&XBARA_SEL28_REG(base), ((uint16_t)(value) << XBARA_SEL28_SEL56_SHIFT), XBARA_SEL28_SEL56_SHIFT, XBARA_SEL28_SEL56_WIDTH))
/*@}*/

/*!
 * @name Register XBARA_SEL28, field SEL57[13:8] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT57 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL28_SEL57 field. */
#define XBARA_RD_SEL28_SEL57(base) ((XBARA_SEL28_REG(base) & XBARA_SEL28_SEL57_MASK) >> XBARA_SEL28_SEL57_SHIFT)
#define XBARA_BRD_SEL28_SEL57(base) (BME_UBFX16(&XBARA_SEL28_REG(base), XBARA_SEL28_SEL57_SHIFT, XBARA_SEL28_SEL57_WIDTH))

/*! @brief Set the SEL57 field to a new value. */
#define XBARA_WR_SEL28_SEL57(base, value) (XBARA_RMW_SEL28(base, XBARA_SEL28_SEL57_MASK, XBARA_SEL28_SEL57(value)))
#define XBARA_BWR_SEL28_SEL57(base, value) (BME_BFI16(&XBARA_SEL28_REG(base), ((uint16_t)(value) << XBARA_SEL28_SEL57_SHIFT), XBARA_SEL28_SEL57_SHIFT, XBARA_SEL28_SEL57_WIDTH))
/*@}*/

