ErichStyger/mcuoneclipse/Examples/KDS/TWR-KV58F220M/TWR_KV58F220M_PEx_2_SDKv2/SDK/platform/devices/MKV58F24/include/MKV58F24_extension.h
/*! @brief Set the EDGE2 field to a new value. */
#define XBARA_WR_CTRL1_EDGE2(base, value) (XBARA_RMW_CTRL1(base, (XBARA_CTRL1_EDGE2_MASK | XBARA_CTRL1_STS2_MASK | XBARA_CTRL1_STS3_MASK), XBARA_CTRL1_EDGE2(value)))
#define XBARA_BWR_CTRL1_EDGE2(base, value) (BME_BFI16(&XBARA_CTRL1_REG(base), ((uint16_t)(value) << XBARA_CTRL1_EDGE2_SHIFT), XBARA_CTRL1_EDGE2_SHIFT, XBARA_CTRL1_EDGE2_WIDTH))
/*@}*/

/*!
 * @name Register XBARA_CTRL1, field STS2[4] (W1C)
 *
 * This bit reflects the results of edge detection for XBAR_OUT2. This field is
 * set to 1 when an edge consistent with the current setting of EDGE2 is detected
 * on XBAR_OUT2. This field is cleared by writing 1 to it or by a DMA_ACK2
 * reception when DEN2 is set. Writing 0 to the field has no effect. When interrupt or
 * DMA functionality is enabled for XBAR_OUT2, this field is 1 when the
 * interrupt or DMA request is asserted and 0 when the interrupt or DMA request has been
 * cleared.
 *
 * Values:
 * - 0b0 - Active edge not yet detected on XBAR_OUT2
 * - 0b1 - Active edge detected on XBAR_OUT2
 */
/*@{*/
/*! @brief Read current value of the XBARA_CTRL1_STS2 field. */
#define XBARA_RD_CTRL1_STS2(base) ((XBARA_CTRL1_REG(base) & XBARA_CTRL1_STS2_MASK) >> XBARA_CTRL1_STS2_SHIFT)
#define XBARA_BRD_CTRL1_STS2(base) (BME_UBFX16(&XBARA_CTRL1_REG(base), XBARA_CTRL1_STS2_SHIFT, XBARA_CTRL1_STS2_WIDTH))

/*! @brief Set the STS2 field to a new value. */
#define XBARA_WR_CTRL1_STS2(base, value) (XBARA_RMW_CTRL1(base, (XBARA_CTRL1_STS2_MASK | XBARA_CTRL1_STS3_MASK), XBARA_CTRL1_STS2(value)))
#define XBARA_BWR_CTRL1_STS2(base, value) (BME_BFI16(&XBARA_CTRL1_REG(base), ((uint16_t)(value) << XBARA_CTRL1_STS2_SHIFT), XBARA_CTRL1_STS2_SHIFT, XBARA_CTRL1_STS2_WIDTH))
/*@}*/

/*!
 * @name Register XBARA_CTRL1, field DEN3[8] (RW)
 *
 * This bit enables the DMA function on the corresponding XBAR_OUT3 output. When
 * enabled, DMA_REQ3 presents the value STS3. When disabled, the DMA_REQ3 output
 * remains low. IEN3 and DEN3 should not both be set to 1.
 *
 * Values:
 * - 0b0 - DMA disabled
 * - 0b1 - DMA enabled
 */
/*@{*/
/*! @brief Read current value of the XBARA_CTRL1_DEN3 field. */
#define XBARA_RD_CTRL1_DEN3(base) ((XBARA_CTRL1_REG(base) & XBARA_CTRL1_DEN3_MASK) >> XBARA_CTRL1_DEN3_SHIFT)
#define XBARA_BRD_CTRL1_DEN3(base) (BME_UBFX16(&XBARA_CTRL1_REG(base), XBARA_CTRL1_DEN3_SHIFT, XBARA_CTRL1_DEN3_WIDTH))

/*! @brief Set the DEN3 field to a new value. */
#define XBARA_WR_CTRL1_DEN3(base, value) (XBARA_RMW_CTRL1(base, (XBARA_CTRL1_DEN3_MASK | XBARA_CTRL1_STS2_MASK | XBARA_CTRL1_STS3_MASK), XBARA_CTRL1_DEN3(value)))
#define XBARA_BWR_CTRL1_DEN3(base, value) (BME_BFI16(&XBARA_CTRL1_REG(base), ((uint16_t)(value) << XBARA_CTRL1_DEN3_SHIFT), XBARA_CTRL1_DEN3_SHIFT, XBARA_CTRL1_DEN3_WIDTH))
/*@}*/

/*!
 * @name Register XBARA_CTRL1, field IEN3[9] (RW)
 *
 * This bit enables the interrupt function on the corresponding XBAR_OUT3
 * output. When the interrupt is enabled, the output INT_REQ3 reflects the value STS3.
 * When the interrupt is disabled, INT_REQ3 remains low. The interrupt request is
 * cleared by writing a 1 to STS3. IEN3 and DEN3 should not both be set to 1.
 *
 * Values:
 * - 0b0 - Interrupt disabled
 * - 0b1 - Interrupt enabled
 */
/*@{*/
/*! @brief Read current value of the XBARA_CTRL1_IEN3 field. */
#define XBARA_RD_CTRL1_IEN3(base) ((XBARA_CTRL1_REG(base) & XBARA_CTRL1_IEN3_MASK) >> XBARA_CTRL1_IEN3_SHIFT)
#define XBARA_BRD_CTRL1_IEN3(base) (BME_UBFX16(&XBARA_CTRL1_REG(base), XBARA_CTRL1_IEN3_SHIFT, XBARA_CTRL1_IEN3_WIDTH))

/*! @brief Set the IEN3 field to a new value. */
#define XBARA_WR_CTRL1_IEN3(base, value) (XBARA_RMW_CTRL1(base, (XBARA_CTRL1_IEN3_MASK | XBARA_CTRL1_STS2_MASK | XBARA_CTRL1_STS3_MASK), XBARA_CTRL1_IEN3(value)))
#define XBARA_BWR_CTRL1_IEN3(base, value) (BME_BFI16(&XBARA_CTRL1_REG(base), ((uint16_t)(value) << XBARA_CTRL1_IEN3_SHIFT), XBARA_CTRL1_IEN3_SHIFT, XBARA_CTRL1_IEN3_WIDTH))
/*@}*/

/*!
 * @name Register XBARA_CTRL1, field EDGE3[11:10] (RW)
 *
 * This field selects which edges on XBAR_OUT3 cause STS3 to assert.
 *
 * Values:
 * - 0b00 - STS3 never asserts
 * - 0b01 - STS3 asserts on rising edges of XBAR_OUT3
 * - 0b10 - STS3 asserts on falling edges of XBAR_OUT3
 * - 0b11 - STS3 asserts on rising and falling edges of XBAR_OUT3
 */
/*@{*/
/*! @brief Read current value of the XBARA_CTRL1_EDGE3 field. */
#define XBARA_RD_CTRL1_EDGE3(base) ((XBARA_CTRL1_REG(base) & XBARA_CTRL1_EDGE3_MASK) >> XBARA_CTRL1_EDGE3_SHIFT)
#define XBARA_BRD_CTRL1_EDGE3(base) (BME_UBFX16(&XBARA_CTRL1_REG(base), XBARA_CTRL1_EDGE3_SHIFT, XBARA_CTRL1_EDGE3_WIDTH))

/*! @brief Set the EDGE3 field to a new value. */
#define XBARA_WR_CTRL1_EDGE3(base, value) (XBARA_RMW_CTRL1(base, (XBARA_CTRL1_EDGE3_MASK | XBARA_CTRL1_STS2_MASK | XBARA_CTRL1_STS3_MASK), XBARA_CTRL1_EDGE3(value)))
#define XBARA_BWR_CTRL1_EDGE3(base, value) (BME_BFI16(&XBARA_CTRL1_REG(base), ((uint16_t)(value) << XBARA_CTRL1_EDGE3_SHIFT), XBARA_CTRL1_EDGE3_SHIFT, XBARA_CTRL1_EDGE3_WIDTH))
/*@}*/

/*!
 * @name Register XBARA_CTRL1, field STS3[12] (W1C)
 *
 * This bit reflects the results of edge detection for XBAR_OUT3. This field is
 * set to 1 when an edge consistent with the current setting of EDGE3 is detected
 * on XBAR_OUT3. This field is cleared by writing 1 to it or by a DMA_ACK3
 * reception when DEN3 is set. Writing 0 to the field has no effect. When interrupt or
 * DMA functionality is enabled for XBAR_OUT3, this field is 1 when the
 * interrupt or DMA request is asserted and 0 when the interrupt or DMA request has been
 * cleared.
 *
 * Values:
 * - 0b0 - Active edge not yet detected on XBAR_OUT3
 * - 0b1 - Active edge detected on XBAR_OUT3
 */
/*@{*/
/*! @brief Read current value of the XBARA_CTRL1_STS3 field. */
#define XBARA_RD_CTRL1_STS3(base) ((XBARA_CTRL1_REG(base) & XBARA_CTRL1_STS3_MASK) >> XBARA_CTRL1_STS3_SHIFT)
#define XBARA_BRD_CTRL1_STS3(base) (BME_UBFX16(&XBARA_CTRL1_REG(base), XBARA_CTRL1_STS3_SHIFT, XBARA_CTRL1_STS3_WIDTH))

/*! @brief Set the STS3 field to a new value. */
#define XBARA_WR_CTRL1_STS3(base, value) (XBARA_RMW_CTRL1(base, (XBARA_CTRL1_STS3_MASK | XBARA_CTRL1_STS2_MASK), XBARA_CTRL1_STS3(value)))
#define XBARA_BWR_CTRL1_STS3(base, value) (BME_BFI16(&XBARA_CTRL1_REG(base), ((uint16_t)(value) << XBARA_CTRL1_STS3_SHIFT), XBARA_CTRL1_STS3_SHIFT, XBARA_CTRL1_STS3_WIDTH))
/*@}*/

/* Macros for entire XBARA_SELx register.  */
#define XBARA_SELx(base, outIndex)                (*(volatile uint16_t *)((uintptr_t)&XBARA_SEL0_REG(base) + ((outIndex) & (~1U))))

