ErichStyger/mcuoneclipse/Examples/KDS/TWR-KV58F220M/TWR_KV58F220M_PEx_2_SDKv2/SDK/platform/devices/MKV58F24/include/MKV58F24_extension.h
/* Macros for entire XBARA_CTRLx register. */
#define XBARA_CTRLx(base, outIndex)               (*(volatile uint16_t *)((uintptr_t)&XBARA_CTRL0_REG(base) + ((outIndex) & (~1U))))

/* Set the XBARA_SELx_SELx field to a new value. */
#define XBARA_WR_SELx_SELx(base, outIndex, input) (BME_BFI16(&XBARA_SELx((base), (outIndex)), ((uint16_t)(input) << (XBARA_SEL0_SEL1_SHIFT * ((outIndex) % 2U))), (XBARA_SEL0_SEL1_SHIFT * ((outIndex) % 2U)), XBARA_SEL0_SEL0_WIDTH))

/* Read current value of the XBARA_SELx_SELx field. */
#define XBARA_RD_SELx_SELx(base, outIndex)        (BME_UBFX16(&XBARA_SELx((base), (outIndex)), XBARA_SEL0_SEL1_SHIFT * ((outIndex) % 2U), XBARA_SEL0_SEL0_WIDTH))

/* Set the XBARA_CTRLx_IENx field to a new value. */
#define XBARA_WR_CTRLx_IENx(base, outIndex, enable) (BME_BFI16(&XBARA_CTRLx((base), (outIndex)), ((uint16_t)(enable) << (XBARA_CTRL0_DEN1_SHIFT * ((outIndex) % 2U) + 1U)), (XBARA_CTRL0_DEN1_SHIFT * ((outIndex) % 2U) + XBARA_CTRL0_IEN0_SHIFT), XBARA_CTRL0_IEN0_WIDTH))

/* Set the XBARA_CTRLx_DENx field to a new value. */
#define XBARA_WR_CTRLx_DENx(base, outIndex, enable) (BME_BFI16(&XBARA_CTRLx((base), (outIndex)), ((uint16_t)(enable) << (XBARA_CTRL0_DEN1_SHIFT * ((outIndex) % 2U))), (XBARA_CTRL0_DEN1_SHIFT * ((outIndex) % 2U)), XBARA_CTRL0_DEN0_WIDTH))

/* Read current value of the XBARA_CTRLx_IENx field. */
#define XBARA_RD_CTRLx_IENx(base, outIndex)       (BME_UBFX16(&XBARA_CTRLx((base), (outIndex)), (XBARA_CTRL0_DEN1_SHIFT * ((outIndex) % 2U) + XBARA_CTRL0_IEN0_SHIFT), XBARA_CTRL0_IEN0_WIDTH))

/* Read current value of the XBARA_CTRLx_DENx field. */
#define XBARA_RD_CTRLx_DENx(base, outIndex)       (BME_UBFX16(&XBARA_CTRLx((base), (outIndex)), (XBARA_CTRL0_DEN1_SHIFT * ((outIndex) % 2U)), XBARA_CTRL0_DEN0_WIDTH))

/* Set the XBARA_CTRLx_EDGEx field to a new value. */
#define XBARA_WR_CTRLx_EDGEx(base, outIndex, edge) (BME_BFI16(&XBARA_CTRLx((base), (outIndex)), ((uint16_t)(edge) << (XBARA_CTRL0_DEN1_SHIFT * ((outIndex) % 2U) + XBARA_CTRL0_EDGE0_SHIFT)), (XBARA_CTRL0_DEN1_SHIFT * ((outIndex) % 2U) + XBARA_CTRL0_EDGE0_SHIFT), XBARA_CTRL0_EDGE0_WIDTH))

/* Read current value of the XBARA_CTRLx_EDGEx field. */
#define XBARA_RD_CTRLx_EDGEx(base, outIndex)      (BME_UBFX16(&XBARA_CTRLx((base), (outIndex)), (XBARA_CTRL0_DEN1_SHIFT * ((outIndex) % 2U) + XBARA_CTRL0_EDGE0_SHIFT), XBARA_CTRL0_EDGE0_WIDTH))

/* Read current value of the XBARA_CTRLx_STSx field. */
#define XBARA_RD_CTRLx_STSx(base, outIndex)       (BME_UBFX16(&XBARA_CTRLx((base), (outIndex)), (XBARA_CTRL0_DEN1_SHIFT * ((outIndex) % 2U) + XBARA_CTRL0_STS0_SHIFT), XBARA_CTRL0_STS0_WIDTH))

/* Clear the XBARA_CTRLx_STSx field value. */
#define XBARA_CLR_CTRLx_STSx(base, outIndex)      (BME_BFI16(&XBARA_CTRLx((base), (outIndex)), ((uint16_t)XBARA_CTRL0_STS0_MASK << (XBARA_CTRL0_IEN0_SHIFT * (outIndex) % 2)), ((XBARA_CTRL0_IEN0_SHIFT * ((outIndex) % 2)) + XBARA_CTRL0_STS0_SHIFT), XBARA_CTRL0_STS0_WIDTH))

/*
 * MKV58F24 XBARB
 *
 * Crossbar Switch
 *
 * Registers defined in this header file:
 * - XBARB_SEL0 - Crossbar B Select Register 0
 * - XBARB_SEL1 - Crossbar B Select Register 1
 * - XBARB_SEL2 - Crossbar B Select Register 2
 * - XBARB_SEL3 - Crossbar B Select Register 3
 * - XBARB_SEL4 - Crossbar B Select Register 4
 * - XBARB_SEL5 - Crossbar B Select Register 5
 * - XBARB_SEL6 - Crossbar B Select Register 6
 * - XBARB_SEL7 - Crossbar B Select Register 7
 */

#define XBARB_INSTANCE_COUNT (1U) /*!< Number of instances of the XBARB module. */
#define XBARB_IDX (0U) /*!< Instance number for XBARB. */

/*******************************************************************************
 * XBARB_SEL0 - Crossbar B Select Register 0
 ******************************************************************************/

/*!
 * @brief XBARB_SEL0 - Crossbar B Select Register 0 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBARB_SEL0 register
 */
/*@{*/
#define XBARB_RD_SEL0(base)      (XBARB_SEL0_REG(base))
#define XBARB_WR_SEL0(base, value) (XBARB_SEL0_REG(base) = (value))
#define XBARB_RMW_SEL0(base, mask, value) (XBARB_WR_SEL0(base, (XBARB_RD_SEL0(base) & ~(mask)) | (value)))
#define XBARB_SET_SEL0(base, value) (BME_OR16(&XBARB_SEL0_REG(base), (uint16_t)(value)))
#define XBARB_CLR_SEL0(base, value) (BME_AND16(&XBARB_SEL0_REG(base), (uint16_t)(~(value))))
#define XBARB_TOG_SEL0(base, value) (BME_XOR16(&XBARB_SEL0_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual XBARB_SEL0 bitfields
 */

/*!
 * @name Register XBARB_SEL0, field SEL0[5:0] (RW)
 *
 * Input (XBARB_INn) to be muxed to XBARB_OUT0 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARB_SEL0_SEL0 field. */
#define XBARB_RD_SEL0_SEL0(base) ((XBARB_SEL0_REG(base) & XBARB_SEL0_SEL0_MASK) >> XBARB_SEL0_SEL0_SHIFT)
#define XBARB_BRD_SEL0_SEL0(base) (BME_UBFX16(&XBARB_SEL0_REG(base), XBARB_SEL0_SEL0_SHIFT, XBARB_SEL0_SEL0_WIDTH))

/*! @brief Set the SEL0 field to a new value. */
#define XBARB_WR_SEL0_SEL0(base, value) (XBARB_RMW_SEL0(base, XBARB_SEL0_SEL0_MASK, XBARB_SEL0_SEL0(value)))
#define XBARB_BWR_SEL0_SEL0(base, value) (BME_BFI16(&XBARB_SEL0_REG(base), ((uint16_t)(value) << XBARB_SEL0_SEL0_SHIFT), XBARB_SEL0_SEL0_SHIFT, XBARB_SEL0_SEL0_WIDTH))
/*@}*/

/*!
 * @name Register XBARB_SEL0, field SEL1[13:8] (RW)
 *
 * Input (XBARB_INn) to be muxed to XBARB_OUT1 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARB_SEL0_SEL1 field. */
#define XBARB_RD_SEL0_SEL1(base) ((XBARB_SEL0_REG(base) & XBARB_SEL0_SEL1_MASK) >> XBARB_SEL0_SEL1_SHIFT)
#define XBARB_BRD_SEL0_SEL1(base) (BME_UBFX16(&XBARB_SEL0_REG(base), XBARB_SEL0_SEL1_SHIFT, XBARB_SEL0_SEL1_WIDTH))

/*! @brief Set the SEL1 field to a new value. */
#define XBARB_WR_SEL0_SEL1(base, value) (XBARB_RMW_SEL0(base, XBARB_SEL0_SEL1_MASK, XBARB_SEL0_SEL1(value)))
#define XBARB_BWR_SEL0_SEL1(base, value) (BME_BFI16(&XBARB_SEL0_REG(base), ((uint16_t)(value) << XBARB_SEL0_SEL1_SHIFT), XBARB_SEL0_SEL1_SHIFT, XBARB_SEL0_SEL1_WIDTH))
/*@}*/

